import { ResultPage } from './../result/result';
import { QuestionPage } from '../question/question';

export const CHOICE_TYPE = {
    CHECKBOX: 'checkbox',
    BUTTON: 'button'
}

export const TYPE = {
    'RESULT': 'result',
    'QUESTION': 'question',
    'MODULE': 'module'
}

export const LEVEL = {
    R: {
        text: 'ผู้ป่วยฉุกเฉินวิกฤติ',
        color: '#D72732'
    },
    Y: {
        text: 'ผู้ป่วยฉุกเฉินเร่งด่วน',
        color: '#F7E744'
    },
    G: {
        text: 'ผู้ป่วยฉุกเฉินไม่รุนแรง',
        color: '#1BA153'
    },
    W: {
        text: 'ผู้ป่วยทั่วไป',
        color: '#F0F0F0'
    }
}

export const RESULT = {
    GROUP1: {
        R1: {
            code: '1 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆก่อน กระผม/ดิฉัน จะบอกคุณว่าต้องทำอะไร'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเหนื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '1 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R3: {
            code: '1 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R4: {
            code: '1 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'เพราะอาจทำให้ผู้ป่วยสำลักได้'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R5: {
            code: '1 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R6: {
            code: '1 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R7: {
            code: '1 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R8: {
            code: '1 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R9: {
            code: '1 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y1: {
            code: '1 เหลือง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },

                ],
                notes: [

                ]
            }
        },
        Y2: {
            code: '1 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่าผู้ป่วยนอนราบ ',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท',
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y3: {
            code: '1 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่าผู้ป่วยนอนราบ ',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท',
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y4: {
            code: '1 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y5: {
            code: '1 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y8: {
            code: '1 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '1 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G1: {
            code: '1 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G2: {
            code: '1 เขียว 2',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W1: {
            code: '1 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W2: {
            code: '1 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W3: {
            code: '1 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W4: {
            code: '1 ขาว 4',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W5: {
            code: '1 ขาว 5',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W6: {
            code: '1 ขาว 6',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W7: {
            code: '1 ขาว 7',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
    },
    GROUP2: {
        R1: {
            code: '2 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: 'นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆก่อน กระผม/ดิฉัน จะบอกคุณว่าต้องทำอะไร'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเหนื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย ',

                ]
            },
        },
        R2: {
            code: '2 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        R3: {
            code: '2 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',

                ]
            }
        },
        R4: {
            code: '2 แดง 4',
            level: LEVEL.R
        },
        Y1: {
            code: '2 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่านอนศรีษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',

                ]
            }
        },
        Y4: {
            code: '2 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y8: {
            code: '2 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '2 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        W1: {
            code: '2 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W2: {
            code: '2 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W3: {
            code: '2 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W4: {
            code: '2 ขาว 4',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
    },
    GROUP14: {
        R1: {
            code: '14 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: 'นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆก่อน กระผม/ดิฉัน จะบอกคุณว่าต้องทำอะไร'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเหนื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',

                ]
            }
        },
        R2: {
            code: '14 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',

                ]
            }
        },
        R3: {
            code: '14 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',

                ]
            }
        },
        R6: {
            code: '14 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'จัดพื้นที่ให้โล่ง ',
                        subDetails: [
                            'ไม่มีสิ่งกีดขวางขณะที่ผู้ป่วยชัก'
                        ]

                    },
                    {
                        detail: 'ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: 'จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. จัดท่านอนตะแคงซ้าย อยู่ในสถานที่อากาศถ่ายเท'

                ]
            }
        },
        R7: {
            code: '14 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'พูดคุยด้วยท่าทีเป็นมิตร ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: 'สังเกตอาการผู้ป่วย ',
                        subDetails: [
                            'ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร'
                        ]
                    },
                    {
                        detail: 'ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: 'หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้',
                        subDetails: [
                            'อาจต้องใช้วิธีผูกมัด'
                        ]
                    },
                ],
                notes: [
                    '1. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '2. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',

                ]
            }
        },
        R9: {
            code: '14 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'อย่าทำให้ผู้ป่วยอาเจียน ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '2. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',

                ]
            }
        },
        Y4: {
            code: '14 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย'
                ]
            }
        },
        Y8: {
            code: '14 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                            'เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '2. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        Y9: {
            code: '14 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย'
                ]
            }
        },
        G3: {
            code: '14 เขียว 3',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'พูดกับผู้ป่วยด้วยความนุ่มนวล ',
                        subDetails: [
                            'เกลี่ยกล่อมให้นอนพัก'
                        ]
                    },
                    {
                        detail: 'พยายามให้ผู้ป่วยอยู่ในบริเวณบ้าน ',
                        subDetails: [
                            'พื้นที่โล่งอากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: 'ระวังไม่ให้มีสิ่งของที่สามารถทำอันตรายต่อญาติและผู้ป่วยอยู่ใกล้ตัว ',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                ]
            }
        },
        G4: {
            code: '14 เขียว 4',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        G5: {
            code: '14 เขียว 5',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        G8: {
            code: '14 เขียว 8',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ล้างตาด้วยน้ำสะอาด ',
                        subDetails: [
                            'ไม่แนะนำให้ใช้ยาหยอดตาหรือยาป้ายตา'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล  หากอาการยังไม่ดีขึ้นให้ญาตินำผู้ป่วยส่งโรงพยาบาลใกล้บ้าน'
                ]
            }
        },
        W1: {
            code: '14 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            ' หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        }
    }
}


export const QUESTIONS = [
    {
        name: 'ปวดท้อง/หลัง/เชิงกรานและขาหนีบ',
        description: 'ปวดท้อง/หลัง/เชิงกรานและขาหนีบ',
        image: 'assets/imgs/pill.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y9.code,
                            advise: RESULT.GROUP1.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R1.code,
                            advise: RESULT.GROUP1.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y8.code,
                            advise: RESULT.GROUP1.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP2.R3.code,
                    advise: RESULT.GROUP2.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยปวดท้องส่วนใด',
                from: 6,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ปวด/จุกเสียด/แน่นยอดอก/ลิ้นปี่/ท้องส่วนบน (เหนือสะดือ)',
                        to: 7
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ปวดท้องน้อย/หลัง/บั้นเอว/สีข้าง',
                        to: 8
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ปวดไม่จำเพาะเจาะจง/อื่นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y3.code,
                            advise: RESULT.GROUP1.Y3.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุมากกว่า 50 ปี หรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R9.code,
                            advise: RESULT.GROUP1.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y9.code,
                            advise: RESULT.GROUP1.Y9.advise,
                        }
                    },
                ]
            },
            {
                question: 'อาการปวดเกิดจากการบาดเจ็บหรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่เกิดอาการบาดเจ็บ',
                        to: 9
                    },
                    {
                        type: TYPE.MODULE,
                        name: 'เกิดอาการบาดเจ็บ',
                        module_index: 2,
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าใด',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อายุมากกว่า 65 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R8.code,
                            advise: RESULT.GROUP1.R8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อายุ 50 - 65 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y4.code,
                            advise: RESULT.GROUP1.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'อายุน้อยกว่า 50 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y3.code,
                            advise: RESULT.GROUP1.Y3.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอาเจียนหรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อาเจียน',
                        to: 11
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่อาเจียน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y4.code,
                            advise: RESULT.GROUP1.Y4.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีเลือดออกหรือไม่ ที่ใดบ้าง',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อาเจียนเป็นเลือด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R5.code,
                            advise: RESULT.GROUP1.R5.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ถ่ายอุจจาระดำ / แดงคล้ำ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R6.code,
                            advise: RESULT.GROUP1.R6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: '(กรณีเป็นผู้หญิง)มีเลือดออกทางช่องคลอด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R7.code,
                            advise: RESULT.GROUP1.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่เห็นมีเลือดออก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP1.G1.code,
                            advise: RESULT.GROUP1.G1.advise,
                        }
                    },
                ]
            },

        ]
    },
    {
        name: 'แพ้ยา',
        description: 'แพ้อาหาร , สัตว์ต่อย , ภูมิแพ้ ',
        image: 'assets/imgs/pill.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP2.Y9.code,
                            advise: RESULT.GROUP2.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R1.code,
                            advise: RESULT.GROUP2.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP2.Y8.code,
                            advise: RESULT.GROUP2.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP2.R3.code,
                    advise: RESULT.GROUP2.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลม',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อาการซึมลง',
                        checked: false,
                    },
                ]
            },
            {
                question: 'ผุ้ป่วยเคยมีประวัติแพ้รุนแรงต่อสิ่งใดหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'เคย',
                        to: 7
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่เคย',
                        to: 8
                    },
                ]
            },
            {
                question: 'เคยมีอาการเกิดขึ้นหลังจากได้รับสิ่งที่แพ้ภายใน 30 นาทีหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP2.Y1.code,
                            advise: RESULT.GROUP2.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 8
                    },
                ]
            },
            {
                question: 'ผุ้ป่วยเคยแพ้ยา / ช่วงนี้ผู้ป่วยกิน / ได้รับยาแล้วมีอาการแพ้หรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP2.Y4.code,
                            advise: RESULT.GROUP2.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 9
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการผิดปกติอย่างไรบ้าง',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นผื่นคัน / ลมพิษ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP2.W3.code,
                            advise: RESULT.GROUP2.W3.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อาการอื่นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP2.W2.code,
                            advise: RESULT.GROUP2.W2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีอาการผิดปกติ',
                        to: 11
                    },
                ]
            },
            {
                question: 'ผู้ป่วยเคยมีประวัติการแพ้หรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เคย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP2.W4.code,
                            advise: RESULT.GROUP2.W4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่เคย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP2.W1.code,
                            advise: RESULT.GROUP2.W1.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'ได้รับสารพิษ',
        description: 'ยาเกินขนาด',
        image: 'assets/imgs/poison.png',
        color: '#FF85A7',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP14.Y9.code,
                            advise: RESULT.GROUP14.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R1.code,
                            advise: RESULT.GROUP14.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                            color: LEVEL.R.color,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                            color: LEVEL.R.color,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            code: RESULT.GROUP14.Y8.code,
                            advise: RESULT.GROUP14.Y8.advise,
                            color: LEVEL.Y.color,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP14.R3.code,
                    advise: RESULT.GROUP14.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        from: 5,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 5,
                        name: 'ซีดและผิวซีดเย็ด',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 5,
                        name: 'เป็นลมหรือเกือบเป็นลม',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการชักหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ชัก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R6.code,
                            advise: RESULT.GROUP14.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 7
                    },
                ]
            },
            {
                question: 'เจ้าหน้าที่ร้องขอการเตรียมพร้อมเนื่องจากผู้ป่วยมีภาวะคุกคาม อันจะเป็นอัตรายต่อตนเองและผู้อื่นหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,

                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R7.code,
                            advise: RESULT.GROUP14.R7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 8
                    },
                ]
            },
            {
                question: 'ผู้ป่วยได้รับ/สารอะไรเข้าสู่ร่างกาย',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยา',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP14.G4.code,
                            advise: RESULT.GROUP14.G4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'สารเคมีที่ใช้ในการเกษตร',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R9.code,
                            advise: RESULT.GROUP14.R9.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'สารกัดกร่อน / สารเคมีอื่น (ที่ไม่ใช่อาหารยา)',
                        to: 9,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'สารป้องกันตัว เช่น แก๊สน้ำตา สเปรย์พริกไทย',
                        to: 11,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'สารเสพติด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP14.G3.code,
                            advise: RESULT.GROUP14.G3.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยกลืน น้ำลาย น้ำ และอากหาร ลำบากหรือไม่่',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'กลืนลำบาก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R9.code,
                            advise: RESULT.GROUP14.R9.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'กลืนได้ปกติ',
                        to: 10
                    },
                ]
            },
            {
                question: 'มีอาการผิดปกติอื่นเช่น เจ็บคอ ปวดท้อง ปวดศรีษะ คัน วิงเวียน',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP14.Y4.code,
                            advise: RESULT.GROUP14.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP14.G5.code,
                            advise: RESULT.GROUP14.G5.advise,
                        }
                    },
                ]
            },
            {
                question: 'มีอาการผิดปกติหรือไม่ เช่น ปวดท้อง ปวดศรีษะ คัน วิงเวียน',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            code: RESULT.GROUP14.G8.code,
                            advise: RESULT.GROUP14.G8.advise,
                            color: LEVEL.G.color,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            code: RESULT.GROUP14.W1.code,
                            advise: RESULT.GROUP14.W1.advise,
                            color: LEVEL.W.color,
                        }
                    },
                ]
            },
        ]
    }
]
