import { ResultPage } from './../result/result';
import { QuestionPage } from '../question/question';

export const CHOICE_TYPE = {
    CHECKBOX: 'checkbox',
    BUTTON: 'button'
}

export const TYPE = {
    'RESULT': 'result',
    'QUESTION': 'question',
    'MODULE': 'module'
}

export const LEVEL = {
    R: {
        text: 'ผู้ป่วยฉุกเฉินวิกฤติ',
        color: '#D72732'
    },
    Y: {
        text: 'ผู้ป่วยฉุกเฉินเร่งด่วน',
        color: '#F7E744'
    },
    G: {
        text: 'ผู้ป่วยฉุกเฉินไม่รุนแรง',
        color: '#1BA153'
    },
    W: {
        text: 'ผู้ป่วยทั่วไป',
        color: '#F0F0F0'
    }
}

export const RESULT = {
    GROUP1: {
        R1: {
            code: '1 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '1 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R3: {
            code: '1 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R4: {
            code: '1 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'เพราะอาจทำให้ผู้ป่วยสำลักได้'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R5: {
            code: '1 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R6: {
            code: '1 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R7: {
            code: '1 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R8: {
            code: '1 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R9: {
            code: '1 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y1: {
            code: '1 เหลือง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },

                ],
                notes: [

                ]
            }
        },
        Y2: {
            code: '1 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่าผู้ป่วยนอนราบ ',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท',
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y3: {
            code: '1 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่าผู้ป่วยนอนราบ ',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท',
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y4: {
            code: '1 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y5: {
            code: '1 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y6: {
            code: '1 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y8: {
            code: '1 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '1 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G1: {
            code: '1 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G2: {
            code: '1 เขียว 2',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W1: {
            code: '1 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W2: {
            code: '1 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W3: {
            code: '1 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W4: {
            code: '1 ขาว 4',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W5: {
            code: '1 ขาว 5',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W6: {
            code: '1 ขาว 6',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W7: {
            code: '1 ขาว 7',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
    },
    GROUP2: {
        R1: {
            code: '2 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: 'นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย ',

                ]
            },
        },
        R2: {
            code: '2 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        R3: {
            code: '2 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',

                ]
            }
        },
        R4: {
            code: '2 แดง 4',
            level: LEVEL.R
        },
        Y1: {
            code: '2 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่านอนศรีษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',

                ]
            }
        },
        Y4: {
            code: '2 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y8: {
            code: '2 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '2 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        W1: {
            code: '2 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W2: {
            code: '2 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W3: {
            code: '2 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W4: {
            code: '2 ขาว 4',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
    },
    GROUP3: {
        R1: {
            code: '3 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย ',
                ]
            },
        },
        R2: {
            code: '3 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        R3: {
            code: '3 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        R4: {
            code: '3 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนในท่าที่ผู้ป่วยสบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        R5: {
            code: '3 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ใช้ผ้าสะอาดกดห้ามเลือดไว้ให้แน่น ไม่เอาผ้าออก',
                        subDetails: [

                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยอยู่ในท่าที่สบาย อยู่ในอาการที่ถ่ายเท',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        R6: {
            code: '3 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ล้างบาดแผลด้วยน้ำสะอาดหลายๆครั้ง ',
                        subDetails: [
                            'และใช้น้ำแข็งหรือถุงน้ำแข็งประคบหรือวางไว้บนบาดแผล'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยนอนอยู่ในท่าที่บาดแผลงูพิษกัดอยู่ต่ำกว่าระดับหัวใจ ',
                        subDetails: [
                            'นอนอยู่นิ่งๆ  เคลื่อนไหวร่างกายให้น้อยที่สุด และควรปลอบใจให้ผู้ป่วยสบายใจ'
                        ]
                    },
                    {
                        detail: '3. รีบนำผู้ป่วยส่งโรงพยาบาลที่ใกล้ที่สุด',
                        subDetails: [
                            'ถ้านำสัตว์ที่กัดไปด้วยหรือบอกชื่อของสัตว์ที่กัดได้ด้วยยิ่งดี '
                        ]
                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        Y1: {
            code: '3 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ล้างแผลและรอบบริเวณแผลด้วยสบู่ ',
                        subDetails: [
                            'และชะล้างแผลด้วยน้ำสะอาดปริมาณมาก ๆ'
                        ]

                    },
                    {
                        detail: '2. ซับแผลให้แห้งด้วยผ้าก๊อซที่สะอาด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. กรณีแผลเหวะหวะให้ปล่อยแผลไว้',
                        subDetails: [
                            'โดยไม่ต้องเย็บแผลแต่ปิดแผลด้วยผ้าก๊อซสะอาด'
                        ]
                    },
                    {
                        detail: '4. แนะนำให้ฉีดยาวัคซีนป้องกันโรคบาดทะยักและวัคคซีนป้องกันพิษสุนัขบ้าที่โรงพยาบาลหรือสถานีอนามัย',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้แจ้งกลับมาทาง 1669 อีกครั้ง',
                ]
            }
        },
        Y2: {
            code: '3 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนศรีษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    'กดเหล็กในออก(หากทำได้) , ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        Y8: {
            code: '3 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '3 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ล้างแผลและรอบบริเวณแผลด้วยสบู่ ',
                        subDetails: [
                            'และชะล้างแผลด้วยน้ำสะอาดปริมาณมาก ๆ'
                        ]

                    },
                    {
                        detail: '2. ซับแผลให้แห้งด้วยผ้าก๊อซที่สะอาด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. กรณีแผลเหวะหวะให้ปล่อยแผลไว้',
                        subDetails: [
                            'โดยไม่ต้องเย็บแผลแต่ปิดแผลด้วยผ้าก๊อซสะอาด'
                        ]
                    },
                    {
                        detail: '4. แนะนำให้ฉีดยาวัคซีนป้องกันโรคบาดทะยักและวัคคซีนป้องกันพิษสุนัขบ้าที่โรงพยาบาลหรือสถานีอนามัย',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้แจ้งกลับมาทาง 1669 อีกครั้ง',
                ]
            }
        },
        W1: {
            code: '3 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'กดเหล็กในออก(หากทำได้)  ',
                        subDetails: [
                            'ประคบน้ำแข็งบริเวณที่ถูกต่อย ถ้ามีอาการปวด ให้รับประทานยาแก้ปวด  ถ้าคันหรือผิวหนังมีผื่นขึ้น ให้รับประทานยาแก้แพ้ ถ้าอาการไม่ทุเลาลง แนะนำให้มาพบแพทย์ในวันเวลาราชการ'
                        ]

                    },
                ],
                notes: [
                ]
            }
        },
        W2: {
            code: '3 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ล้างแผลและรอบบริเวณแผลด้วยสบู่ ',
                        subDetails: [
                            'และชะล้างแผลด้วยน้ำสะอาดปริมาณมาก ๆ'
                        ]

                    },
                    {
                        detail: '2. ซับแผลให้แห้งด้วยผ้าก๊อซที่สะอาด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. กรณีแผลเหวะหวะให้ปล่อยแผลไว้',
                        subDetails: [
                            'โดยไม่ต้องเย็บแผลแต่ปิดแผลด้วยผ้าก๊อซสะอาด'
                        ]
                    },
                    {
                        detail: '4. แนะนำให้ฉีดยาวัคซีนป้องกันโรคบาดทะยักและวัคคซีนป้องกันพิษสุนัขบ้าที่โรงพยาบาลหรือสถานีอนามัย',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้แจ้งกลับมาทาง 1669 อีกครั้ง',
                ]
            }
        },
        W3: {
            code: '3 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ล้างแผลและรอบบริเวณแผลด้วยสบู่ ',
                        subDetails: [
                            'และชะล้างแผลด้วยน้ำสะอาดปริมาณมาก ๆ'
                        ]
                    },
                    {
                        detail: '2. แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            ' หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },

                ],
                notes: [
                ]
            }
        },
        G1: {
            code: '3 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
    },
    GROUP4: {
        R1: {
            code: '4 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '4 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R3: {
            code: '4 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R4: {
            code: '4 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร',
                        subDetails: [
                            'เพราะอาจทำให้ผู้ป่วยสำลักได้'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R5: {
            code: '4 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร',
                        subDetails: [
                            'เพราะอาจทำให้ผู้ป่วยสำลักได้'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R6: {
            code: '4 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร',
                        subDetails: [
                            'เพราะอาจทำให้ผู้ป่วยสำลักได้'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R7: {
            code: '4 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R9: {
            code: '4 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนในท่าที่ผู้ป่วยสบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y1: {
            code: '4 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y2: {
            code: '4 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y3: {
            code: '4 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบในท่าที่สบาย ',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y4: {
            code: '4 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบในท่าที่สบาย ',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y6: {
            code: '4 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนั่งหรือยืน',
                        subDetails: [
                            'ให้บีบปลายจมูกโดยไม่คลายออก และอยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y8: {
            code: '4 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '4 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบในท่าที่สบาย ',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W1: {
            code: '4 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก และอยู่ในท่าที่สบาย ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วยไปตรวจในวันและเวลาราชการ ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ]

                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [

                        ]

                    },
                ],
                notes: [
                ]
            }
        },
        W2: {
            code: '4 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก และอยู่ในท่าที่สบาย ',
                        subDetails: [
                            'หากมีเลือดไหลอีก ให้ผู้ป่วยนั่งหรือยืน ให้บีบปลายจมูกโดยไม่คลายออก และอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วยไปตรวจในวันและเวลาราชการ ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ]

                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [

                        ]

                    },
                ],
                notes: [
                ]
            }
        },
        W3: {
            code: '4 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก และอยู่ในท่าที่สบาย ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วยไปตรวจในวันและเวลาราชการ ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ]

                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [

                        ]

                    },
                ],
                notes: [
                ]
            }
        },
        G1: {
            code: '4 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        G2: {
            code: '4 เขียว 2',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
    },
    GROUP5: {
        R1: {
            code: '5 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '5 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R3: {
            code: '5 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R4: {
            code: '5 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R6: {
            code: '5 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y1: {
            code: '5 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. แนะนำไม่ให้บีบหรือนวด บริเวณที่มีอาการชา',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y2: {
            code: '5 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y4: {
            code: '5 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y5: {
            code: '5 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y7: {
            code: '5 เหลือง 7',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y8: {
            code: '5 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '5 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        G1: {
            code: '5 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                    {
                        detail: '4. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G4: {
            code: '5 เขียว 4',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. หากทำตามคำแนะนำข้อ 3 แล้วไม่ดีขึ้น ให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },

                ],
                notes: [
                ]
            }
        },
        G6: {
            code: '5 เขียว 6',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้สังเกตอาการผู้ป่วยอยู่ที่บ้าน',
                        subDetails: [
                            'หากมีอาการผิดปกติ ให้ญาติพาผู้ป่วยส่ง รพ.'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G7: {
            code: '5 เขียว 7',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [
                ]
            }
        },
        G8: {
            code: '5 เขียว 8',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. ล้างตาด้วยน้ำสะอาด ไม่แนะนำให้ใช้ยาหยอดตาหรือยาป้ายตา',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. หากถูกบริเวณอื่นที่ไม่ใช่ตา ให้ล้างด้วยน้ำสะอาดและสบู่ ',
                        subDetails: [
                            'ไม่ควรใช้น้ำยาใดๆ ป้าย บริเวณที่ถูกสาร'
                        ]
                    },
                ],
                notes: [
                    'ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล  หากอาการยังไม่ดีขึ้นให้ญาตินำผู้ป่วยส่งโรงพยาบาลใกล้บ้าน'
                ]
            }
        },
        W1: {
            code: '5 ขาว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้สังเกตอาการผู้ป่วยอยู่ที่บ้าน หากมีอาการผิดปกติ ให้ญาติพาผู้ป่วยส่ง รพ.',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
    },
    GROUP6: {
        R1: {
            code: '6 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. ให้ทำการปั๊มหัวใจไปเรื่อยๆ จนกว่ารถ รพ. จะไปถึง',
                    '2. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '3. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '6 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. ให้ทำการปั๊มหัวใจไปเรื่อยๆ จนกว่ารถ รพ. จะไปถึง',
                    '2. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '3. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        Y1: {
            code: '6 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. ให้ทำการปั๊มหัวใจไปเรื่อยๆ จนกว่ารถ รพ. จะไปถึง',
                    '2. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '3. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        Y4: {
            code: '6 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. ให้ทำการปั๊มหัวใจไปเรื่อยๆ จนกว่ารถ รพ. จะไปถึง',
                    '2. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '3. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        Y8: {
            code: '6 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
    },
    GROUP7: {
        R1: {
            code: '7 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '7 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R3: {
            code: '7 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R4: {
            code: '7 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R5: {
            code: '7 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R6: {
            code: '7 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. หากผู้ป่วยเคยได้รับการสั่งให้ใช้ยาอมใต้ลิ้น หรือยาพ่นขยายหลอดเลือดหัวใจ และไม่มีอาการเป็นลมหรือมึนศีรษะ แนะนำให้ผู้ป่วยใช้ยาเฉพาะตามที่แพทย์เคยสั่ง',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R7: {
            code: '7 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. หากผู้ป่วยเคยได้รับการสั่งให้ใช้ยาอมใต้ลิ้น หรือยาพ่นขยายหลอดเลือดหัวใจ และไม่มีอาการเป็นลมหรือมึนศีรษะ แนะนำให้ผู้ป่วยใช้ยาเฉพาะตามที่แพทย์เคยสั่ง',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R8: {
            code: '7 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R9: {
            code: '7 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y1: {
            code: '7 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        Y4: {
            code: '7 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y5: {
            code: '7 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y6: {
            code: '7 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y8: {
            code: '7 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '7 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        G1: {
            code: '7 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                    {
                        detail: '4. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        G6: {
            code: '7 เขียว 6',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [
                ]
            }
        },
        W1: {
            code: '7 ขาว 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. แนะนำให้สังเกตอาการผู้ป่วยอยู่ที่บ้าน ',
                        subDetails: [
                            'หากมีอาการผิดปกติ ให้ญาติพาผู้ป่วยส่งรพ.'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W2: {
            code: '7 ขาว 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. แนะนำให้สังเกตอาการผู้ป่วยอยู่ที่บ้าน ',
                        subDetails: [
                            'หากมีอาการผิดปกติ ให้ญาติพาผู้ป่วยส่งรพ.'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
    },
    GROUP8: {
        R1: {
            code: '8 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        R2: {
            code: '8 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'สำหรับผู้ป่วยอายุ 8 ปี ขึ้นไป',
                        subDetails: [
                            '<b>ผู้ป่วยรู้สึกตัวดี</b>',
                            '1. ให้ผู้ป่วยยืนขึ้น  ผู้ช่วยเหลือยืนด้านหลังผู้ป่วย  โอบมือรอบผู้ป่วย  กำมือเป็นกำปั้นวางใต้ลิ้นปี่ตรงกลางเหนือสะดือ',
                            '2. ใช้มืออีกข้างหนึ่ง  กุมรอบกำปั้นอีกมือหนึ่งให้แน่  และกระตุกมือดันเข้าหาตัวผู้ป่วยบริเวณใต้ลิ้นปี่  ให้สิ่งแปลกปลอมหลุดออกมา  ถ้ายังไม่หลุดให้ทำซ้ำจนกว่าสิ่งแปลกปลอมจะหลุดออกมา',
                            '<b>ผู้ป่วยไม่รู้สึกตัว</b>',
                            '1. จัดผู้ป่วยนอนราบกับพื้น',
                            '2. ถ้าผู้ป่วยไม่หายใจ  ให้ทำการช่วยหายใจแบบผู้ใหญ่',
                            '3. การกดหน้าท้อง  (ABDOMINAL THRUSTS)',
                            '3.1  นั่งคร่อมบริเวณเข่าของผู้ป่วย',
                            '3.2  วางสันมือตรงบริเวณใต้ลิ้นปี่เหนือสะดือ  มืออีกข้างหนึ่งวางทับบนหลังมือแรก  ให้สันมือตรงกัน',
                            '3.3  ออกแรงกระแทกดันไปทางศีรษะผู้ป่วย  ในแนวกึ่งกลางลำตัว  ด้วยความเร็วติดต่อกัน  5  ครั้ง',
                            '3.4  อ้าปากผู้ป่วยดูว่าสิ่งแปลกปลอมหลุดออกมาอยู่ในปากผู้ป่วยหรือไม่  ถ้ามีสิ่งแปลกปลอมอยู่ให้ล้วงออก',
                            '3.5  ถ้าสิ่งแปลกปลอมยังไม่หลุดออกมา  ให้ทำซ้ำ  ตามข้อ 3.2 - 3.4  จนกระทั่งสิ่งแปลกปลอมหลุดออกมาและผู้ป่วยเริ่มหายใจได้เอง  หรือจนกว่าหน่วยกู้ชีพจะมาถึง',
                        ]
                    },
                    {
                        detail: 'สำหรับเด็กอายุ  1-8 ปี',
                        subDetails: [
                            '<b>ผู้ป่วยรู้สึกตัวดี ให้กระแทกบริเวณท้องส่วนบน  ในขณะที่เด็กยืนหรือนั่ง</b>',
                            '1. ให้ผู้ช่วยเหลือยืนด้านหลังและหันหน้าไปทางเดียวกับผู้ป่วย  โอบรอบตัวผู้ป่วย',
                            '2. กำมือข้างหนึ่งเป็นกำปั้น  วางไว้ใต้ลิ้นปี่เหนือสะดือเล็กน้อย',
                            '3. มืออีกข้างหนึ่งกุมรอบกำปั้นของมือแรก  ออกแรงกระแทกขึ้นไปทางด้านบนเร็ว ๆ และหลาย ๆ ครั้ง  ทำจนกว่าสิ่งแปลกปลอมจะหลุดออกมา',
                            '<b>ผู้ป่วยไม่รู้สึกตัว   ให้กระแทกบริเวณท้องส่วนบน  ในขณะที่เด็กนอนราบ</b>',
                            '1. จัดให้เด็กนอนหงาย',
                            '2. ผู้ช่วยเหลือคุกเข่าข้างตัวหรือคร่อมบริเวณเข่าของผู้ป่วย',
                            '3. วางสันมือข้างหนึ่งบริเวณใต้ลิ้นปี่เหนือสะดือ  มืออีกข้างวางทับบนหลังมือแรก  ให้สันมือตรงกัน',
                            '4. ออกแรงกระแทกดันไปทางศีรษะผู้ป่วย  ในแนวกึ่งกลางลำตัว  ด้วยความเร็วติดต่อกัน  5  ครั้ง',
                            '5. อ้าปากผู้ป่วยดูว่าสิ่งแปลกปลอมหลุดออกมาอยู่ในปากผู้ป่วยหรือไม่  ถ้ามีสิ่งแปลกปลอมอยู่ให้ล้วงออก',
                            '6. ถ้าสิ่งแปลกปลอมยังไม่หลุดออกมา  ให้ทำซ้ำ  ตามข้อ  3 - 4  จนกระทั่งสิ่งแปลกปลอมหลุดออกมาและผู้ป่วยเริ่มหายใจได้เอง  หรือจนกว่าหน่วยกู้ชีพจะมาถึง',
                        ]
                    },
                    {
                        detail: 'สำหรับเด็กทารกอายุต่ำกว่า  1 ปี   ผู้ช่วยเหลือนั่งบนเก้าอี้',
                        subDetails: [
                            '1. จับให้ทารกคว่ำลงตามแนวมือ  และแขนผู้ช่วยเหลือ  (โดยจับให้แน่นที่ส่วนคางของทารก)  ให้ศีรษะของทารกอยู่ต่ำกว่าลำตัวผู้ช่วยเหลือ',
                            '2. ใช้สันมือตบระหว่างกรุดูกสะบักของทารกทั้ง 2 ข้าง 5 ครั้ง',
                            '3. หลังจากออกแรงตบบนหลังแล้ว  จับให้ทารกนอนหงายบนท้องแขนส่วนล่าง  โดยวางแขนไว้บนต้นขาของผู้ช่วยเหลือ  และจับศีรษะของทารกให้ศีรษะอยู่ต่ำกว่าลำตัว',
                            '4. ใช้นิ้วกลางและนิ้วนางกดแบบกระแทกลงบนกระดูกหน้าอก  เหนือเส้นซึ่งลากเชื่อมระหว่างหัวนมซ้ายกับขวา  กดแบบกระแทก  จำนวน 5 ครั้ง',
                            '5. ทำข้อ 2 สลับกับข้อ 4  จนกว่าสิ่งแปลกปลอมจะออกมา',
                        ]

                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        R3: {
            code: '8 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'สำหรับผู้ป่วยอายุ 8 ปี ขึ้นไป',
                        subDetails: [
                            '<b>ผู้ป่วยรู้สึกตัวดี</b>',
                            '1. ให้ผู้ป่วยยืนขึ้น  ผู้ช่วยเหลือยืนด้านหลังผู้ป่วย  โอบมือรอบผู้ป่วย  กำมือเป็นกำปั้นวางใต้ลิ้นปี่ตรงกลางเหนือสะดือ',
                            '2. ใช้มืออีกข้างหนึ่ง  กุมรอบกำปั้นอีกมือหนึ่งให้แน่  และกระตุกมือดันเข้าหาตัวผู้ป่วยบริเวณใต้ลิ้นปี่  ให้สิ่งแปลกปลอมหลุดออกมา  ถ้ายังไม่หลุดให้ทำซ้ำจนกว่าสิ่งแปลกปลอมจะหลุดออกมา',
                            '<b>ผู้ป่วยไม่รู้สึกตัว</b>',
                            '1. จัดผู้ป่วยนอนราบกับพื้น',
                            '2. ถ้าผู้ป่วยไม่หายใจ  ให้ทำการช่วยหายใจแบบผู้ใหญ่',
                            '3. การกดหน้าท้อง  (ABDOMINAL THRUSTS)',
                            '3.1  นั่งคร่อมบริเวณเข่าของผู้ป่วย',
                            '3.2  วางสันมือตรงบริเวณใต้ลิ้นปี่เหนือสะดือ  มืออีกข้างหนึ่งวางทับบนหลังมือแรก  ให้สันมือตรงกัน',
                            '3.3  ออกแรงกระแทกดันไปทางศีรษะผู้ป่วย  ในแนวกึ่งกลางลำตัว  ด้วยความเร็วติดต่อกัน  5  ครั้ง',
                            '3.4  อ้าปากผู้ป่วยดูว่าสิ่งแปลกปลอมหลุดออกมาอยู่ในปากผู้ป่วยหรือไม่  ถ้ามีสิ่งแปลกปลอมอยู่ให้ล้วงออก',
                            '3.5  ถ้าสิ่งแปลกปลอมยังไม่หลุดออกมา  ให้ทำซ้ำ  ตามข้อ 3.2 - 3.4  จนกระทั่งสิ่งแปลกปลอมหลุดออกมาและผู้ป่วยเริ่มหายใจได้เอง  หรือจนกว่าหน่วยกู้ชีพจะมาถึง',
                        ]
                    },
                    {
                        detail: 'สำหรับเด็กอายุ  1-8 ปี',
                        subDetails: [
                            '<b>ผู้ป่วยรู้สึกตัวดี ให้กระแทกบริเวณท้องส่วนบน  ในขณะที่เด็กยืนหรือนั่ง</b>',
                            '1. ให้ผู้ช่วยเหลือยืนด้านหลังและหันหน้าไปทางเดียวกับผู้ป่วย  โอบรอบตัวผู้ป่วย',
                            '2. กำมือข้างหนึ่งเป็นกำปั้น  วางไว้ใต้ลิ้นปี่เหนือสะดือเล็กน้อย',
                            '3. มืออีกข้างหนึ่งกุมรอบกำปั้นของมือแรก  ออกแรงกระแทกขึ้นไปทางด้านบนเร็ว ๆ และหลาย ๆ ครั้ง  ทำจนกว่าสิ่งแปลกปลอมจะหลุดออกมา',
                            '<b>ผู้ป่วยไม่รู้สึกตัว   ให้กระแทกบริเวณท้องส่วนบน  ในขณะที่เด็กนอนราบ</b>',
                            '1. จัดให้เด็กนอนหงาย',
                            '2. ผู้ช่วยเหลือคุกเข่าข้างตัวหรือคร่อมบริเวณเข่าของผู้ป่วย',
                            '3. วางสันมือข้างหนึ่งบริเวณใต้ลิ้นปี่เหนือสะดือ  มืออีกข้างวางทับบนหลังมือแรก  ให้สันมือตรงกัน',
                            '4. ออกแรงกระแทกดันไปทางศีรษะผู้ป่วย  ในแนวกึ่งกลางลำตัว  ด้วยความเร็วติดต่อกัน  5  ครั้ง',
                            '5. อ้าปากผู้ป่วยดูว่าสิ่งแปลกปลอมหลุดออกมาอยู่ในปากผู้ป่วยหรือไม่  ถ้ามีสิ่งแปลกปลอมอยู่ให้ล้วงออก',
                            '6. ถ้าสิ่งแปลกปลอมยังไม่หลุดออกมา  ให้ทำซ้ำ  ตามข้อ  3 - 4  จนกระทั่งสิ่งแปลกปลอมหลุดออกมาและผู้ป่วยเริ่มหายใจได้เอง  หรือจนกว่าหน่วยกู้ชีพจะมาถึง',
                        ]
                    },
                    {
                        detail: 'สำหรับเด็กทารกอายุต่ำกว่า  1 ปี   ผู้ช่วยเหลือนั่งบนเก้าอี้',
                        subDetails: [
                            '1. จับให้ทารกคว่ำลงตามแนวมือ  และแขนผู้ช่วยเหลือ  (โดยจับให้แน่นที่ส่วนคางของทารก)  ให้ศีรษะของทารกอยู่ต่ำกว่าลำตัวผู้ช่วยเหลือ',
                            '2. ใช้สันมือตบระหว่างกรุดูกสะบักของทารกทั้ง 2 ข้าง 5 ครั้ง',
                            '3. หลังจากออกแรงตบบนหลังแล้ว  จับให้ทารกนอนหงายบนท้องแขนส่วนล่าง  โดยวางแขนไว้บนต้นขาของผู้ช่วยเหลือ  และจับศีรษะของทารกให้ศีรษะอยู่ต่ำกว่าลำตัว',
                            '4. ใช้นิ้วกลางและนิ้วนางกดแบบกระแทกลงบนกระดูกหน้าอก  เหนือเส้นซึ่งลากเชื่อมระหว่างหัวนมซ้ายกับขวา  กดแบบกระแทก  จำนวน 5 ครั้ง',
                            '5. ทำข้อ 2 สลับกับข้อ 4  จนกว่าสิ่งแปลกปลอมจะออกมา',
                        ]

                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y1: {
            code: '8 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ไม่ควรนำอาการ หรือน้ำ หรืองสิ่งของใดๆ เข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '2. ไม่ควรล้วง หรือใช้นิ้วกวาดเข้าไปในปาก',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. . กระตุ้นให้ผู้ป่วยไอ จนกว่าสิ่งแปลกปลอมหรือเศษอาหาร จะหลุดออกมา',
                        subDetails: [

                        ]
                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มเริ่มพูดไม่มีเสียง หรือไอไม่ได้ ให้ที่ ตาม 8 แดง 2',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            }
        },
        Y2: {
            code: '8 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ไม่ควรนำอาการ หรือน้ำ หรืองสิ่งของใดๆ เข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '2. ไม่ควรล้วง หรือใช้นิ้วกวาดเข้าไปในปาก',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. กระตุ้นให้ผู้ป่วยไอ จนกว่าสิ่งแปลกปลอมหรือเศษอาหาร จะหลุดออกมา',
                        subDetails: [

                        ]
                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มเริ่มพูดไม่มีเสียง หรือไอไม่ได้ ให้ที่ ตาม 8 แดง 2',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            }
        },
        Y8: {
            code: '8 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '8 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท',
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        G1: {
            code: '8 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท',
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        W1: {
            code: '8 ขาว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ให้ผู้ป่วยนอนพัก และอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หากมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 เพื่อรับฟังคำแนะนำ หากไม่มีอาการเปลี่ยนแปลง แนะนำให้ไปตรวจรักษาที่ รพ.ในวันและเวลาราชการ',
                        ]
                    },

                ],
                notes: [
                ]
            }
        },
    },
    GROUP9: {
        R1: {
            code: '9 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        R2: {
            code: '9 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        R3: {
            code: '9 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        R4: {
            code: '9 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'เพราะอาจทำให้ผู้ป่วยสำลักได้'
                        ]

                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        R5: {
            code: '9 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        R6: {
            code: '9 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดพื้นที่ให้โล่ง ไม่มีสิ่งกีดขวางขณะที่ผู้ป่วยชัก',
                        subDetails: [

                        ]

                    },
                    {
                        detail: '2. ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]

                    },
                    {
                        detail: '3. จัดท่านอนตะแคงซ้าย อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [

                        ]

                    },
                    {
                        detail: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และ ไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]

                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        R7: {
            code: '9 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y1: {
            code: '9 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        Y3: {
            code: '9 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [

                ]
            }
        },
        Y8: {
            code: '9 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '9 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [

                ]
            }
        },
        W1: {
            code: '9 ขาว 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. แนะนำให้สังเกตอาการผู้ป่วยอยู่ที่บ้าน ',
                        subDetails: [
                            'หากมีอาการผิดปกติ ให้ญาติพาผู้ป่วยส่งตรวจที่ รพ. ในวันและเวลาราชการ',
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W2: {
            code: '9 ขาว 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. แนะนำให้สังเกตอาการผู้ป่วยอยู่ที่บ้าน ',
                        subDetails: [
                            'หากมีอาการผิดปกติ ให้ญาติพาผู้ป่วยส่งตรวจที่ รพ. ในวันและเวลาราชการ',
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
    },
    GROUP10: {
        R1: {
            code: '10 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '10 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R3: {
            code: '10 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R4: {
            code: '10 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'เพราะอาจทำให้ผู้ป่วยสำลักได้'
                        ]

                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R5: {
            code: '10 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. นำผู้ป่วยเข้าที่ร่ม มีอากาศถ่ายเทได้สะดวก',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. เปลื้องหรือคลายเสื้อผ้า',
                        subDetails: [
                            'สิ่งที่รัดออกให้หลวม ถอดผ้าหนาๆ ออก เพื่อให้ความร้อนระบายออกจากร่างกายได้ง่าย และให้นอนหงายศีรษะสูง'
                        ]

                    },
                    {
                        detail: '3. เช็ดตัวด้วยน้ำเย็น',
                        subDetails: [
                            'วางกระเป๋าน้ำแข็งบนศีรษะ เพื่อช่วยลดอุณหภูมิให้กลับไปอยู่ในระดับปกติ โดยเร็ว'
                        ]
                    },
                    {
                        detail: '4. ห้ามคนมุงดู',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. หลีกเลี่ยงการให้ยาลดไข้',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ไม่ควรดื่มน้ำร้อน ชา, กาแฟ, เหล้า ฯลฯ',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากมีเลือด ให้ใช้ผ้าสะอาดปิดบริเวณที่เลือดออก ยกเว้น เลือดกำเดาไหล',
                    '3. กรณีเลือดกำเดาไหลให้ ผู้ป่วยนั่งหรือยืน ให้บีบปลายจมูกโดยไม่คลายออก และอยู่ในสถานที่อากาศถ่ายเท',
                    '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                ]
            }
        },
        R6: {
            code: '10 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดพื้นที่ให้โล่ง ไม่มีสิ่งกีดขวางขณะที่ผู้ป่วยชัก',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '2. ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. จัดท่านอนตะแคงซ้าย อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และ ไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        R7: {
            code: '10 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. นำผู้ป่วยเข้าที่ร่ม มีอากาศถ่ายเทได้สะดวก',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. เปลื้องหรือคลายเสื้อผ้า',
                        subDetails: [
                            'สิ่งที่รัดออกให้หลวม ถอดผ้าหนาๆ ออก เพื่อให้ความร้อนระบายออกจากร่างกายได้ง่าย และให้นอนหงายศีรษะสูง'
                        ]

                    },
                    {
                        detail: '3. เช็ดตัวด้วยน้ำเย็น',
                        subDetails: [
                            'วางกระเป๋าน้ำแข็งบนศีรษะ เพื่อช่วยลดอุณหภูมิให้กลับไปอยู่ในระดับปกติ โดยเร็ว'
                        ]
                    },
                    {
                        detail: '4. ห้ามคนมุงดู',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. หลีกเลี่ยงการให้ยาลดไข้',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ไม่ควรดื่มน้ำร้อน ชา, กาแฟ, เหล้า ฯลฯ',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                ]
            }
        },
        R8: {
            code: '10 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. นำผู้ป่วยเข้าที่ร่ม มีอากาศถ่ายเทได้สะดวก',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. เปลื้องหรือคลายเสื้อผ้า',
                        subDetails: [
                            'สิ่งที่รัดออกให้หลวม ถอดผ้าหนาๆ ออก เพื่อให้ความร้อนระบายออกจากร่างกายได้ง่าย และให้นอนหงายศีรษะสูง'
                        ]

                    },
                    {
                        detail: '3. เช็ดตัวด้วยน้ำเย็น',
                        subDetails: [
                            'วางกระเป๋าน้ำแข็งบนศีรษะ เพื่อช่วยลดอุณหภูมิให้กลับไปอยู่ในระดับปกติ โดยเร็ว'
                        ]
                    },
                    {
                        detail: '4. ห้ามคนมุงดู',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. หลีกเลี่ยงการให้ยาลดไข้',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ไม่ควรดื่มน้ำร้อน ชา, กาแฟ, เหล้า ฯลฯ',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                ]
            }
        },
        R9: {
            code: '10 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y1: {
            code: '10 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. นำผู้ป่วยเข้าที่ร่ม มีอากาศถ่ายเทได้สะดวก',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. เปลื้องหรือคลายเสื้อผ้า',
                        subDetails: [
                            'สิ่งที่รัดออกให้หลวม ถอดผ้าหนาๆ ออก เพื่อให้ความร้อนระบายออกจากร่างกายได้ง่าย และให้นอนหงายศีรษะสูง'
                        ]

                    },
                    {
                        detail: '3. เช็ดตัวด้วยน้ำเย็น',
                        subDetails: [
                            'วางกระเป๋าน้ำแข็งบนศีรษะ เพื่อช่วยลดอุณหภูมิให้กลับไปอยู่ในระดับปกติ โดยเร็ว'
                        ]
                    },
                    {
                        detail: '4. ห้ามคนมุงดู',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. หลีกเลี่ยงการให้ยาลดไข้',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ไม่ควรดื่มน้ำร้อน ชา, กาแฟ, เหล้า ฯลฯ',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                ]
            }
        },
        Y2: {
            code: '10 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                ]
            }
        },
        Y3: {
            code: '10 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. นำผู้ป่วยเข้าที่ร่ม มีอากาศถ่ายเทได้สะดวก',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. เปลื้องหรือคลายเสื้อผ้า',
                        subDetails: [
                            'สิ่งที่รัดออกให้หลวม ถอดผ้าหนาๆ ออก เพื่อให้ความร้อนระบายออกจากร่างกายได้ง่าย และให้นอนหงายศีรษะสูง'
                        ]

                    },
                    {
                        detail: '3. เช็ดตัวด้วยน้ำเย็น',
                        subDetails: [
                            'วางกระเป๋าน้ำแข็งบนศีรษะ เพื่อช่วยลดอุณหภูมิให้กลับไปอยู่ในระดับปกติ โดยเร็ว'
                        ]
                    },
                    {
                        detail: '4. ห้ามคนมุงดู',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. หลีกเลี่ยงการให้ยาลดไข้',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ไม่ควรดื่มน้ำร้อน ชา, กาแฟ, เหล้า ฯลฯ',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                ]
            }
        },
        Y4: {
            code: '10 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ไม่สัมผัสหรือแตะต้องตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยถอดเสื้อผ้าที่ปนเปื้อนออก หากทำได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ล้างสารเคมีออกจากตาอย่างต่อเนื่อง',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้าสารเคมีเป็นผง ให้ปัดออก ห้ามใช้ล้าง',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. รวบรวมข้อมูลเกี่ยวกับสารเคมี เช่น ขวด หรือภาชนะบรรจุภัณฑ์ ไปรพ. กับคนผู้ป่วยด้วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. อย่าให้ผู้ป่วยดื่มหรือกินสิ่งใด',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y5: {
            code: '10 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. หากผู้ป่วยหนาวและตัวแห้ง ให้ห่มผ้าให้ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. หากผู้ป่วยหนาวและตัวเปียก ให้ถอดเสื้อผ้าที่เปีบกออกและห่มผ้าให้ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่มหรือกินสิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                ]
            }
        },
        Y6: {
            code: '10 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                ]
            }
        },
        Y9: {
            code: '10 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                ]
            }
        },
        Y8: {
            code: '10 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        G2: {
            code: '10 เขียว 2',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                ]
            }
        },
        G8: {
            code: '10 เขียว 8',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ล้างตาด้วยน้ำสะอาด ไม่แนะนำให้ใช้ยาหยอดตาหรือยาป้ายตา',
                        subDetails: [
                        ]

                    },
                ],
                notes: [
                    'ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล หากอาการยังไม่ดีขึ้นให้ญาตินำผู้ป่วยส่งโรงพยาบาลใกล้บ้าน'
                ]
            }
        },
        W1: {
            code: '10 ขาว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ล้างตัวให้สะอาด ',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก หายใจขัด หรืออาการผิดปกติอื่นๆ ให้โทรแจ้ง 1669 อีกครั้ง หากไม่มีอาการผิดปกติ ให้แนะนำไปตรวจที่ รพ. ในวันและเวลาราชการ',
                        ]

                    },
                ],
                notes: [
                ]
            }
        },
    },
    GROUP12: {
        R1: {
            code: '12 แดง 1',
            leave: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: 'นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            }
        },
        R2: {
            code: '12 แดง 2',
            leave: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R3: {
            code: '12 แดง 3',
            leave: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        R4: {
            code: '12 แดง 4',
            leave: LEVEL.R,
            eave: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'อย่าให้ผู้ป่วยดื่ม',
                        subDetails: [
                            'อย่าให้ผู้ป่วยดื่ม'
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        R5: {
            code: '12 แดง 5',
            leave: LEVEL.R,
            eave: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y8: {
            code: '12 เหลือง 8',
            leave: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y1: {
            code: '12 เหลือง 1',
            leave: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y2: {
            code: '12 เหลือง 2',
            leave: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่าผู้ป่วยนอนราบศรีษะต่ำ ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [
                            ''
                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y4: {
            code: '12 เหลือง 4',
            leave: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y5: {
            code: '12 เหลือง 5',
            leave: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y9: {
            code: '12 เหลือง 9',
            leave: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        G1: {
            code: '12 เขียว 1',
            leave: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยอยู่ในพื้นที่โล่งและให้ผู้ป่วยนอนพัก',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. หากมีเลือดกำเดาไหล ให้ก้มหน้าและบีบปลายจมูกไว้ไม่คลาย ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G2: {
            code: '12 เขียว 2',
            leave: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        W1: {
            code: '12 ขาว 1',
            leave: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            ' หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W2: {
            code: '12 ขาว 2',
            leave: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            ' หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W3: {
            code: '12 ขาว 3',
            leave: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            ' หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W4: {
            code: '12 ขาว 4',
            leave: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            ' หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
    },
    GROUP13: {
        R1: {
            code: '13 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย'
                ]
            },
        },
        R2: {
            code: '13 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        R3: {
            code: '13 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศีรษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        R4: {
            code: '13 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศีรษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร เพราะอาจทำให้ผู้ป่วยสำลักได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R5: {
            code: '13 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ใช้ผ้าสะอาดกดห้ามเลือดไว้ให้แน่น ไม่เอาผ้าออก',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยอยู่ในท่าที่สบาย อยู่ในอาการที่ถ่ายเท',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R6: {
            code: '13 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดพื้นที่ให้โล่ง ไม่มีสิ่งกีดขวางขณะที่ผู้ป่วยชัก',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                            'และ ไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย'
                        ]

                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง'
                ]
            },
        },
        R7: {
            code: '13 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. พูดคุยด้วยท่าทีเป็นมิตร',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. สังเกตอาการผู้ป่วย',
                        subDetails: [
                            'ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร'
                        ]

                    },
                    {
                        detail: '3. ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้ อาจต้องใช้วิธีผูกมัด',
                        subDetails: [
                        ]

                    },
                ],
                notes: [
                    '1. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '2. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง'
                ]
            },
        },
        R8: {
            code: '13 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดสิ่งแวดล้อมให้ปลอดภัย',
                        subDetails: [
                            'ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง'
                        ]

                    },
                    {
                        detail: '2. ขอความช่วยเหลือจากตำรวจ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ',
                        subDetails: [
                            'เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น'
                        ]
                    },
                    {
                        detail: '5. พูดคุยด้วยท่าทีเป็นมิตร',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. สังเกตอาการผู้ป่วย ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '7. ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '8. หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้ อาจต้องใช้วิธีผูกมัด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '9. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    }
                ],
                notes: [

                ]
            },
        },
        Y1: {
            code: '13 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดสิ่งแวดล้อมให้ปลอดภัย',
                        subDetails: [
                            'ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง'
                        ]

                    },
                    {
                        detail: '2. ขอความช่วยเหลือจากตำรวจ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ',
                        subDetails: [
                            'เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น'
                        ]
                    },
                    {
                        detail: '5. พูดคุยด้วยท่าทีเป็นมิตร',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. สังเกตอาการผู้ป่วย ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '7. ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '8. หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้ อาจต้องใช้วิธีผูกมัด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '9. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    }
                ],
                notes: [
                    'หากมีบาดแผล ให้ใช้ผ้าสะอาดปิดแผล'
                ]
            },
        },
        Y4: {
            code: '13 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดสิ่งแวดล้อมให้ปลอดภัย',
                        subDetails: [
                            'ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง'
                        ]

                    },
                    {
                        detail: '2. ขอความช่วยเหลือจากตำรวจ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ',
                        subDetails: [
                            'เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น'
                        ]
                    },
                    {
                        detail: '5. พูดคุยด้วยท่าทีเป็นมิตร',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. สังเกตอาการผู้ป่วย ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '7. ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '8. หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้ อาจต้องใช้วิธีผูกมัด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '9. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    }
                ],
                notes: [
                ]
            },
        },
        Y5: {
            code: '13 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดสิ่งแวดล้อมให้ปลอดภัย',
                        subDetails: [
                            'ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง'
                        ]

                    },
                    {
                        detail: '2. ขอความช่วยเหลือจากตำรวจ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ',
                        subDetails: [
                            'เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น'
                        ]
                    },
                    {
                        detail: '5. พูดคุยด้วยท่าทีเป็นมิตร',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. สังเกตอาการผู้ป่วย ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '7. ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '8. หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้ อาจต้องใช้วิธีผูกมัด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '9. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    }
                ],
                notes: [
                ]
            },
        },
        Y8: {
            code: '13 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [
                ],
                notes: [
                ]
            },
        },
        Y9: {
            code: '13 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดสิ่งแวดล้อมให้ปลอดภัย',
                        subDetails: [
                            'ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง'
                        ]

                    },
                    {
                        detail: '2. ขอความช่วยเหลือจากตำรวจ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ',
                        subDetails: [
                            'เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น'
                        ]
                    },
                    {
                        detail: '5. พูดคุยด้วยท่าทีเป็นมิตร',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. สังเกตอาการผู้ป่วย ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '7. ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '8. หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้ อาจต้องใช้วิธีผูกมัด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '9. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    }
                ],
                notes: [
                ]
            },
        },
        G4: {
            code: '13 เขียว 4',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. หากทำตามคำแนะนำข้อ 3 แล้วไม่ดีขึ้น ให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G6: {
            code: '13 เขียว 6',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. จัดสิ่งแวดล้อมให้ปลอดภัย ',
                        subDetails: [
                            'ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง'
                        ],
                    },
                    {
                        detail: '2. ขอความช่วยเหลือจากตำรวจ',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. .  ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น ทำร้ายตัวเองหรือทรัพย์สิน',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ',
                        subDetails: [
                            ' เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G7: {
            code: '13 เขียว 7',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. จัดสิ่งแวดล้อมให้ปลอดภัย ',
                        subDetails: [
                            'ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง'
                        ],
                    },
                    {
                        detail: '2. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น ทำร้ายตัวเองหรือทรัพย์สิน',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ',
                        subDetails: [
                            ' เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G8: {
            code: '13 เขียว 8',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ล้างตาด้วยน้ำสะอาด ไม่แนะนำให้ใช้ยาหยอดตาหรือยาป้ายตา ',
                        subDetails: [
                            'ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง'
                        ],
                    },
                ],
                notes: [
                    'ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล  หากอาการยังไม่ดีขึ้นให้ญาตินำผู้ป่วยส่งโรงพยาบาลใกล้บ้าน'
                ]
            }
        },
        W1: {
            code: '13 ขาว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            'และให้ญาติสังเกตอาการผู้ป่วย หากไม่มีอาการผิดปกติ ให้มาพบแพทย์ในวันและเวลาราชการ'
                        ],
                    },
                ],
                notes: [
                    'จัดสิ่งแวดล้อมให้ปลอดภัย ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง',
                    'ขอความช่วยเหลือจากตำรวจ',
                    'ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน',
                    'ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก  เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น'
                ]
            }
        },


    },
    GROUP14: {
        R1: {
            code: '14 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: 'นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',

                ]
            }
        },
        R2: {
            code: '14 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',

                ]
            }
        },
        R3: {
            code: '14 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',

                ]
            }
        },
        R6: {
            code: '14 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'จัดพื้นที่ให้โล่ง ',
                        subDetails: [
                            'ไม่มีสิ่งกีดขวางขณะที่ผู้ป่วยชัก'
                        ]

                    },
                    {
                        detail: 'ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: 'จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. จัดท่านอนตะแคงซ้าย อยู่ในสถานที่อากาศถ่ายเท'

                ]
            }
        },
        R7: {
            code: '14 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'พูดคุยด้วยท่าทีเป็นมิตร ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: 'สังเกตอาการผู้ป่วย ',
                        subDetails: [
                            'ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร'
                        ]
                    },
                    {
                        detail: 'ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: 'หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้',
                        subDetails: [
                            'อาจต้องใช้วิธีผูกมัด'
                        ]
                    },
                ],
                notes: [
                    '1. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '2. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',

                ]
            }
        },
        R9: {
            code: '14 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'อย่าทำให้ผู้ป่วยอาเจียน ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '2. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',

                ]
            }
        },
        Y4: {
            code: '14 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย'
                ]
            }
        },
        Y8: {
            code: '14 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                            'เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '2. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        Y9: {
            code: '14 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย'
                ]
            }
        },
        G3: {
            code: '14 เขียว 3',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'พูดกับผู้ป่วยด้วยความนุ่มนวล ',
                        subDetails: [
                            'เกลี่ยกล่อมให้นอนพัก'
                        ]
                    },
                    {
                        detail: 'พยายามให้ผู้ป่วยอยู่ในบริเวณบ้าน ',
                        subDetails: [
                            'พื้นที่โล่งอากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: 'ระวังไม่ให้มีสิ่งของที่สามารถทำอันตรายต่อญาติและผู้ป่วยอยู่ใกล้ตัว ',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                ]
            }
        },
        G4: {
            code: '14 เขียว 4',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        G5: {
            code: '14 เขียว 5',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        G8: {
            code: '14 เขียว 8',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ล้างตาด้วยน้ำสะอาด ',
                        subDetails: [
                            'ไม่แนะนำให้ใช้ยาหยอดตาหรือยาป้ายตา'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล  หากอาการยังไม่ดีขึ้นให้ญาตินำผู้ป่วยส่งโรงพยาบาลใกล้บ้าน'
                ]
            }
        },
        W1: {
            code: '14 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            ' หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        }
    },
    GROUP15: {
        R1: {
            code: '15 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. หากมีผู้ช่วยเหลือคนเดียวให้หาผ้าห่มหนาๆไว้ใต้หลังเอวด้านขวาของผู้ป่วย เพื่อลดแรงดันและทำให้  เลือดไหลเวียนดีขึ้น  เนื่องจากหากผู้ป่วยนอนราบมดลูกจะกดลงบนหลอดเลือดใหญ่ในช่องท้อง หากมีผู้ช่วยเหลือหลายคนให้ผู้ช่วยเหลือ 1 คนทำการโกยมดลูกไปด้านซ้ายขณะปั๊มหัวใจ',
                ]
            },
        },
        R2: {
            code: '15 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยไปนั่งส้วม',
                    '3. ห่มผ้าให้ผู้ป่วย และจัดหาผ้าขนหนูสะอาดไว้',
                ]
            },
        },
        R3: {
            code: '15 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยไปนั่งส้วม',
                    '3. ห่มผ้าให้ผู้ป่วย และจัดหาผ้าขนหนูสะอาดไว้',
                ]
            },
        },
        R4: {
            code: '15 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยไปนั่งส้วม',
                    '3. ห่มผ้าให้ผู้ป่วย และจัดหาผ้าขนหนูสะอาดไว้',
                ]
            },
        },
        R5: {
            code: '15 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        R6: {
            code: '15 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ห้ามให้ผู้ป่วยดื่มกินสิ่งใด ',
                        subDetails: [
                            'และห้ามนำสิ่งของใดให้ผู้ป่วยกัด'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ไม่รู้สึกตัว แต่ยังหายใจ  ให้เปิดทางเดินหายใจ กดหน้าผากเชยคาง',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยไปนั่งส้วม',
                    '4. ห่มผ้าให้ผู้ป่วย และจัดหาผ้าขนหนูสะอาดไว้',
                ]
            },
        },
        R7: {
            code: '15 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้พบเห็นเหตุการณ์ให้ผ้าสะอาดรองรับตัวเด็ก',
                        subDetails: [
                            'และเช็ดตัวทารกให้แห้ง และ ห่มผ้าให้ความอบอุ่นแก่ทารกวางทารกไว้บนลำตัวมารดา  ระหว่างรอรถพยาบาล '
                        ]
                    },
                    {
                        detail: '2. บันทึกเวลาที่ทารกคลอด ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ไม่รู้สึกตัว แต่ยังหายใจ  ให้เปิดทางเดินหายใจ กดหน้าผากเชยคาง',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. หากบริเวณนั้นมีลูกสูบยางแดงให้ใช้ลูกสูบยางแดงดูดเสมหะในปากและจมูกของทารก',
                    '4. หากทารกไม่ตอบสนองให้กระตุ้น ด้วยการลูบหลัง หรือดีดฝ่าเท้า'
                ]
            },
        },
        R8: {
            code: '15 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ไม่รู้สึกตัว แต่ยังหายใจ  ให้เปิดทางเดินหายใจ กดหน้าผากเชยคาง',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยไปนั่งส้วม',
                    '4. ห่มผ้าให้ผู้ป่วย และจัดหาผ้าขนหนูสะอาดไว้'
                ]
            },
        },
        R9: {
            code: '15 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ไม่รู้สึกตัว แต่ยังหายใจ  ให้เปิดทางเดินหายใจ กดหน้าผากเชยคาง',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยไปนั่งส้วม',
                    '4. ห่มผ้าให้ผู้ป่วย และจัดหาผ้าขนหนูสะอาดไว้'
                ]
            },
        },
        R10: {
            code: '15 แดง 10',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ไม่รู้สึกตัว แต่ยังหายใจ  ให้เปิดทางเดินหายใจ กดหน้าผากเชยคาง',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยไปนั่งส้วม',
                    '4. ห่มผ้าให้ผู้ป่วย และจัดหาผ้าขนหนูสะอาดไว้'
                ]
            },
        },
        Y1: {
            code: '15 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยไปนั่งส้วม',
                    '4. ห่มผ้าให้ผู้ป่วย และจัดหาผ้าขนหนูสะอาดไว้'
                ]
            },
        },
        Y4: {
            code: '15 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยไปนั่งส้วม',
                    '4. ห่มผ้าให้ผู้ป่วย และจัดหาผ้าขนหนูสะอาดไว้'
                ]
            },
        },
        Y5: {
            code: '15 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยไปนั่งส้วม',
                    '4. ห่มผ้าให้ผู้ป่วย และจัดหาผ้าขนหนูสะอาดไว้'
                ]
            },
        },
        Y6: {
            code: '15 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยไปนั่งส้วม',
                    '4. ห่มผ้าให้ผู้ป่วย และจัดหาผ้าขนหนูสะอาดไว้'
                ]
            },
        },
        Y8: {
            code: '15 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [
                ]
            },
        },
        Y7: {
            code: '15 เหลือง 7',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยไปนั่งส้วม',
                    '4. ห่มผ้าให้ผู้ป่วย และจัดหาผ้าขนหนูสะอาดไว้'
                ]
            },
        },
        Y9: {
            code: '15 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยไปนั่งส้วม',
                    '4. ห่มผ้าให้ผู้ป่วย และจัดหาผ้าขนหนูสะอาดไว้'
                ]
            },
        },
        W1: {
            code: '15 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'หากมีอาการเลือดออกช่องคลอดมากผิดปกติ หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ],
                    },
                ],
                notes: [
                ]
            }
        },
        W2: {
            code: '15 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'หากมีอาการเลือดออกช่องคลอดมากผิดปกติ หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ],
                    },
                ],
                notes: [
                ]
            }
        },
        G1: {
            code: '15 เขียว 1',
            level: LEVEL.W,
            advise: {
                contents: [

                ],
                notes: [
                ]
            }
        },
        G2: {
            code: '15 เขียว 2',
            level: LEVEL.W,
            advise: {
                contents: [

                ],
                notes: [
                ]
            }
        },
        G4: {
            code: '15 เขียว 4',
            level: LEVEL.W,
            advise: {
                contents: [

                ],
                notes: [
                ]
            }
        },
        G6: {
            code: '15 เขียว 6',
            level: LEVEL.W,
            advise: {
                contents: [

                ],
                notes: [
                ]
            }
        },
    },
    GROUP16: {
        R1: {
            code: '16 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: 'นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และ ไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย',
                    '4. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย'

                ]
            },
        },
        R2: {
            code: '16 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และ ไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย',
                    '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
                ]
            },
        },
        R3: {
            code: '16 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และ ไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย',
                    '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
                ]
            },
        },
        R4: {
            code: '16 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
                        subDetails: [
                            'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย'
                        ]

                    },
                    {
                        detail: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย',
                ]
            },
        },
        R5: {
            code: '16 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
                        subDetails: [
                            'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย'
                        ]

                    },
                    {
                        detail: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย',
                ]
            },
        },
        R6: {
            code: '16 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
                        subDetails: [
                            'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย'
                        ]

                    },
                    {
                        detail: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย',
                ]
            },
        },
        R7: {
            code: '16 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
                        subDetails: [
                            'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย'
                        ]

                    },
                    {
                        detail: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย',
                ]
            },
        },
        R8: {
            code: '16 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
                        subDetails: [
                            'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย'
                        ]

                    },
                    {
                        detail: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย',
                ]
            },
        },
        R9: {
            code: '16 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
                        subDetails: [
                            'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย'
                        ]

                    },
                    {
                        detail: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย',
                ]
            },
        },
        R10: {
            code: '16 แดง 10',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
                        subDetails: [
                            'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย'
                        ]

                    },
                    {
                        detail: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย หากมีเครื่องตรวจน้ำตาลในเลือด ให้เจาะดูค่าน้ำตาลในเลือดและแจ้งผลแก่เจ้าหน้าที่ ระหว่างรอรถพยาบาลด้วย',
                ]
            },
        },
        Y1: {
            code: '16 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
                        subDetails: [
                            'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย'
                        ]

                    },
                    {
                        detail: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ ',
                ]
            },
        },
        Y2: {
            code: '16 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        Y4: {
            code: '16 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
                        subDetails: [
                            'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย'
                        ]

                    },
                    {
                        detail: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ ',
                ]
            },
        },
        Y5: {
            code: '16 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
                        subDetails: [
                            'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย'
                        ]

                    },
                    {
                        detail: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ ',
                ]
            },
        },
        Y8: {
            code: '16 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        Y9: {
            code: '16 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
                        subDetails: [
                            'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย'
                        ]

                    },
                    {
                        detail: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ ',
                ]
            },
        },
        G1: {
            code: '16 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [
                ]
            }
        },
        W1: {
            code: '16 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'หากมีอาการเลือดออกช่องคลอดมากผิดปกติ หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ],
                    },
                ],
                notes: [
                ]
            }
        },
    },
    GROUP17: {
        R1: {
            code: '17 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: 'นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '17 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวกอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และ ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                ]
            },
        },
        R3: {
            code: '17 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศีรษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และ ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                ]
            },
        },
        R4: {
            code: '17 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนตะแคงซ้าย',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และ ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                ]
            },
        },
        Y1: {
            code: '17 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        Y2: {
            code: '17 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        Y4: {
            code: '17 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนในท่าที่สบาย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y5: {
            code: '17 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนในท่าที่สบาย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y7: {
            code: '17 เหลือง 7',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนในท่าที่สบาย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y8: {
            code: '17 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนในท่าที่สบาย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y9: {
            code: '17 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนในท่าที่สบาย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y6: {
            code: '17 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        G1: {
            code: '17 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        G2: {
            code: '17 เขียว 2',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        G4: {
            code: '17 เขียว 4',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        G5: {
            code: '17 เขียว 5',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ให้เตรียมตัวรับโทรศัพท์ สายถัดไป',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            },
        },
        G6: {
            code: '17 เขียว 6',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            },
        },
        G7: {
            code: '17 เขียว 7',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            },
        },
        W1: {
            code: '17 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยรับประทานยา นอนพัก',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ '
                        ]
                    },
                ],
                notes: [

                ]
            },
        },
        W2: {
            code: '17 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ '
                        ]
                    },
                ],
                notes: [

                ]
            },
        },
        W3: {
            code: '17 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยรับประทานยาลดไข้ซ้ำได้ทุก4-6 ชั่วโมง เช็ดตัว นอนพัก',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ '
                        ]
                    },
                ],
                notes: [

                ]
            },
        },
        W4: {
            code: '17 ขาว 4',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วย นอนพัก',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ '
                        ]
                    },
                ],
                notes: [

                ]
            },
        },
    },
    GROUP18: {
        R1: {
            code: '18 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: 'นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '18 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวกอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                ]
            },
        },
        R3: {
            code: '18 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่าผู้ป่วยนอนราบศีรษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                ]
            },
        },
        R4: {
            code: '18 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่านอนตะแคงซ้าย',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                ]
            },
        },
        R5: {
            code: '18 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1.จัดผู้ป่วยให้นอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                ]
            },
        },
        R6: {
            code: '18 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1.จัดผู้ป่วยให้นอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                ]
            },
        },
        R7: {
            code: '18 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1.จัดผู้ป่วยให้นอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                ]
            },
        },
        R8: {
            code: '18 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        R9: {
            code: '18 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1.จัดผู้ป่วยให้นอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                ]
            },
        },
        Y1: {
            code: '18 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดผู้ป่วยให้นอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y2: {
            code: '18 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่านอนศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y3: {
            code: '18 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        Y6: {
            code: '18 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่าผู้ป่วยให้นอนอยู่ในท่าสบาย',
                        subDetails: [
                            'เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y7: {
            code: '18 เหลือง 7',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่านอนตะแคงซ้าย',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y8: {
            code: '18 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [
                ],
                notes: [

                ]
            },
        },
        Y9: {
            code: '18 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่าผู้ป่วยให้นอนอยู่ในท่าสบาย',
                        subDetails: [
                            'เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        G1: {
            code: '18 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                ],
                notes: [

                ]
            },
        },
        W1: {
            code: '18 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                ],
                notes: [

                ]
            },
        },
    },
    GROUP19: {
        R1: {
            code: '19 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: 'นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '19 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1.แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: 'ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    }
                ],
                notes: [
                    '1.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3.หากผู้ป่วยอาเจียน ให้จัดท่าผู้ป่วยนอนตะแคงซ้าย',
                ]
            },
        },
        R3: {
            code: '19 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่าผู้ป่วยนอนราบศีรษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    }
                ],
                notes: [
                    '1.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3.หากผู้ป่วยอาเจียน ให้จัดท่าผู้ป่วยนอนตะแคงซ้าย',
                ]
            },
        },
        R4: {
            code: '19 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่านอนตะแคงซ้าย',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    }
                ],
                notes: [
                    '1.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3.หากผู้ป่วยอาเจียน ให้จัดท่าผู้ป่วยนอนตะแคงซ้าย',
                ]
            },
        },
        R6: {
            code: '19 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1.จัดพื้นที่ให้โล่ง',
                        subDetails: [
                            'ไม่มีสิ่งกีดขวางขณะที่ผู้ป่วยชัก'
                        ]
                    },
                    {
                        detail: '2.ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3.จัดท่านอนตะแคงซ้าย',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท',
                        ]
                    },
                    {
                        detail: '4.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    },
                ],
                notes: [
                    '1.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3.หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            },
        },
        R7: {
            code: '19 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่าให้ผู้ป่วยนอนในท่าสบาย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    },
                ],
                notes: [
                    '1.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3.หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            },
        },
        R8: {
            code: '19 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่านอนตะแคงซ้าย',
                        subDetails: [
                            ' เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท',
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    },
                ],
                notes: [
                    '1.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3.หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            },
        },
        R9: {
            code: '19 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่าให้ผู้ป่วยนอนในท่าสบาย ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    },
                ],
                notes: [
                    '1.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3.หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            },
        },
        Y1: {
            code: '19 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่านอนตะแคงซ้าย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2.คลายเสื้อผ้าให้หลวม',
                        subDetails: [
                            '  อยู่ในที่อากาศถ่ายเท',
                        ]
                    },
                    {
                        detail: '3.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    },
                ],
                notes: [
                    '1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y2: {
            code: '19 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่านอนศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    },
                    {
                        detail: '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y3: {
            code: '19 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2.คลายเสื้อผ้าให้หลวม',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท',
                        ]
                    },
                    {
                        detail: '3.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    },
                ],
                notes: [
                    '1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y4: {
            code: '19 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2.คลายเสื้อผ้าให้หลวม',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท',
                        ]
                    },
                    {
                        detail: '3.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    },
                ],
                notes: [
                    '1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y5: {
            code: '19 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2.คลายเสื้อผ้าให้หลวม',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท',
                        ]
                    },
                    {
                        detail: '3.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    },
                ],
                notes: [
                    '1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y7: {
            code: '19 เหลือง 7',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2.คลายเสื้อผ้าให้หลวม',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท',
                        ]
                    },
                    {
                        detail: '3.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    },
                ],
                notes: [
                    '1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y6: {
            code: '19 เหลือง 6',
            level: LEVEL.W,
            advise: {
                contents: [

                ],
                notes: [
                ]
            },
        },
        Y8: {
            code: '19 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2.คลายเสื้อผ้าให้หลวม',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท',
                        ]
                    },
                    {
                        detail: '3.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    },
                ],
                notes: [
                    '1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y9: {
            code: '19 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2.คลายเสื้อผ้าให้หลวม',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท',
                        ]
                    },
                    {
                        detail: '3.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                        ]
                    },
                ],
                notes: [
                    '1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        G1: {
            code: '19 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'เกลี่ยกล่อมให้กลับบ้านนอนพัก หรือนอนในสถานที่ปลอดภัยพื้นที่โล่งอากาศถ่ายเท',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    'ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล  หากอาการยังไม่ดีขึ้นให้ญาตินำผู้ป่วยส่งโรงพยาบาลใกล้บ้าน',
                ]
            },
        },
        G2: {
            code: '19 เขียว 2',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'เกลี่ยกล่อมให้กลับบ้านนอนพัก หรือนอนในสถานที่ปลอดภัยพื้นที่โล่งอากาศถ่ายเท',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    'ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล  หากอาการยังไม่ดีขึ้นให้ญาตินำผู้ป่วยส่งโรงพยาบาลใกล้บ้าน',
                ]
            },
        },
        W1: {
            code: '19 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ',
                        ]
                    },
                ],
                notes: [
                ]
            },
        },
        W2: {
            code: '19 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ',
                        ]
                    },
                ],
                notes: [
                ]
            },
        },
        W6: {
            code: '19 ขาว 6',
            level: LEVEL.W,
            advise: {
                contents: [

                ],
                notes: [
                ]
            },
        },
        G3: {
            code: '19 เขียว 3',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [
                ]
            },
        },
        G5: {
            code: '19 เขียว 5',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [
                ]
            },
        },
    },
    GROUP20: {
        R1: {
            code: '20 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากเด็กเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการเด็กและประเมินซ้ำทุก 2 นาที หากเด็กไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '20 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้เด็กนอนราบใช้ผ้าหนุนบริเวณไหล่เด็ก ',
                        subDetails: [
                            'เพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากเด็กอาเจียน ให้จัดท่าผู้ป่วยนอนตะแคงซ้าย',
                ]
            },
        },
        R3: {
            code: '20 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าเด็กนอนราบใช้ผ้าหนุนบริเวณไหล่เด็ก',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากเด็กอาเจียน ให้จัดท่าผู้ป่วยนอนตะแคงซ้าย',
                ]
            },
        },
        R4: {
            code: '20 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าเด็กนอนราบใช้ผ้าหนุนบริเวณไหล่เด็ก',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากเด็กอาเจียน ให้จัดท่าผู้ป่วยนอนตะแคงซ้าย',
                ]
            },
        },
        R5: {
            code: '20 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ใช้ผ้าซุปน้ำอุณหภูมิห้อง เปียกหมาดๆ เช็ดตัวเด็ก 15 นาที',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากเด็กอาเจียน ให้จัดท่าผู้ป่วยนอนตะแคงซ้าย',
                ]
            },
        },
        R6: {
            code: '20 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดพื้นที่ให้โล่ง ไม่มีสิ่งกีดขวางขณะที่เด็กชัก',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ไม่งัดหรือใส่ของแข็งเข้าไปในปากเด็ก',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. จัดท่าเด็กนอนราบใช้ผ้าหนุนบริเวณไหล่เด็ก',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากเด็กอาเจียน ให้จัดท่าผู้ป่วยนอนตะแคงซ้าย',
                ]
            },
        },
        R8: {
            code: '20 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าเด็กนอนราบใช้ผ้าหนุนบริเวณไหล่เด็ก อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ให้นำภาชนะของสารที่เด็กรับประทานนำไป โรงพยาบาลด้วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ห้ามล้วงคอเด็ก หรือทำให้เด็กอาเจียนเด็ดขาด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากเด็กอาเจียนให้พลิกด้านตะแคงหน้าเด็กไปด้านใดด้านหนึ่ง',
                ]
            },
        },
        R7: {
            code: '20 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าเด็กนอนราบใช้ผ้าหนุนบริเวณไหล่เด็ก อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ให้นำภาชนะของสารที่เด็กรับประทานนำไป โรงพยาบาลด้วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ห้ามล้วงคอเด็ก หรือทำให้เด็กอาเจียนเด็ดขาด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากเด็กอาเจียนให้พลิกด้านตะแคงหน้าเด็กไปด้านใดด้านหนึ่ง',
                ]
            },
        },
        R9: {
            code: '20 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าเด็กนอนราบใช้ผ้าหนุนบริเวณไหล่เด็ก อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากเด็กอาเจียนให้พลิกด้านตะแคงหน้าเด็กไปด้านใดด้านหนึ่ง',
                ]
            },
        },
        Y1: {
            code: '20 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าเด็กนอนราบใช้ผ้าหนุนบริเวณไหล่เด็ก อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากเด็กอาเจียนให้พลิกด้านตะแคงหน้าเด็กไปด้านใดด้านหนึ่ง',
                ]
            },
        },
        Y2: {
            code: '20 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าเด็กนอนราบใช้ผ้าหนุนบริเวณไหล่เด็ก อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากเด็กอาเจียนให้พลิกด้านตะแคงหน้าเด็กไปด้านใดด้านหนึ่ง',
                ]
            },
        },
        Y5: {
            code: '20 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าเด็กนอนราบใช้ผ้าหนุนบริเวณไหล่เด็ก อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากเด็กอาเจียนให้พลิกด้านตะแคงหน้าเด็กไปด้านใดด้านหนึ่ง',
                ]
            },
        },
        Y6: {
            code: '20 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ใช้ผ้าซุปน้ำอุณหภูมิห้อง เปียกหมาดๆ เช็ดตัวเด็ก 15 นาที',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากผู้เด็กอาเจียน ให้จัดท่าผู้ป่วยนอนตะแคงซ้าย',
                ]
            },
        },
        Y7: {
            code: '20 เหลือง 7',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าเด็กนอนราบใช้ผ้าหนุนบริเวณไหล่เด็ก อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ให้นำภาชนะของสารที่เด็กรับประทานนำไป โรงพยาบาลด้วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ห้ามล้วงคอเด็ก หรือทำให้เด็กอาเจียนเด็ดขาด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากเด็กอาเจียนให้พลิกด้านตะแคงหน้าเด็กไปด้านใดด้านหนึ่ง',
                ]
            },
        },
        Y8: {
            code: '20 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าเด็กนอนราบใช้ผ้าหนุนบริเวณไหล่เด็ก อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ให้นำภาชนะของสารที่เด็กรับประทานนำไป โรงพยาบาลด้วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ห้ามล้วงคอเด็ก หรือทำให้เด็กอาเจียนเด็ดขาด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการเด็กอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวเด็กและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับเด็กด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้เด็กดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวเด็ก',
                    '3. หากเด็กอาเจียนให้พลิกด้านตะแคงหน้าเด็กไปด้านใดด้านหนึ่ง',
                ]
            },
        },
        Y9: {
            code: '20 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        G1: {
            code: '20 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. เกลี่ยกล่อมให้เด็กสงบ ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. หากเด็กมีไข้ ให้เช็ดตัวด้วยน้ำอุณหภูมิห้อง ',
                        subDetails: [
                            'เปียกหมาดๆ เช็คย้อนรูขุมขน ประมาน 15 นาที หรือรับประทานยาลดไข้ ซ้ำได้ทุก 4-6 ชั่วโมง'
                        ]
                    },
                ],
                notes: [
                    'ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล  หากอาการยังไม่ดีขึ้นให้ญาตินำผู้ป่วยส่งโรงพยาบาลใกล้บ้าน',
                ]
            },
        },
        G2: {
            code: '20 เขียว 2',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [
                ]
            },
        },
        G3: {
            code: '20 เขียว 3',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [
                ]
            },
        },
        W1: {
            code: '20 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ญาติเกลี่ยกล่อมเด็กนอนพัก',
                        subDetails: [
                            'และสังเกตอาการของเด็กอย่างใกล้ชิด หากมีอาการซึมลง ไข้สูง หายใจติดขัด เหงื่อออกตัวเย็น  ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ '
                        ]
                    },
                ],
                notes: [
                ]
            },
        },
        W2: {
            code: '20 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ญาติเกลี่ยกล่อมเด็กนอนพัก',
                        subDetails: [
                            'และสังเกตอาการของเด็กอย่างใกล้ชิด หากมีอาการซึมลง ไข้สูง หายใจติดขัด เหงื่อออกตัวเย็น  ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ '
                        ]
                    },
                ],
                notes: [
                ]
            },
        },
        W3: {
            code: '20 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ญาติเกลี่ยกล่อมเด็กนอนพัก',
                        subDetails: [
                            'และสังเกตอาการของเด็กอย่างใกล้ชิด หากมีอาการซึมลง ไข้สูง หายใจติดขัด เหงื่อออกตัวเย็น  ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ '
                        ]
                    },
                ],
                notes: [
                ]
            },
        },
        W4: {
            code: '20 ขาว 4',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ญาติเกลี่ยกล่อมเด็กนอนพัก',
                        subDetails: [
                            'และสังเกตอาการของเด็กอย่างใกล้ชิด หากมีอาการซึมลง ไข้สูง หายใจติดขัด เหงื่อออกตัวเย็น  ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ '
                        ]
                    },
                ],
                notes: [
                ]
            },
        },
        W5: {
            code: '20 ขาว 5',
            level: LEVEL.W,
            advise: {
                contents: [

                ],
                notes: [
                ]
            },
        },
        W6: {
            code: '20 ขาว 6',
            level: LEVEL.W,
            advise: {
                contents: [

                ],
                notes: [
                ]
            },
        },
        W7: {
            code: '20 ขาว 7',
            level: LEVEL.W,
            advise: {
                contents: [

                ],
                notes: [
                ]
            },
        },
    },
    GROUP21: {
        R1: {
            code: '21 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                    '4. ถ้ามีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                ]
            },
        },
        R2: {
            code: '21 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้ามีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R3: {
            code: '21 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศีรษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท '
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้ามีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R4: {
            code: '21 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนตะแคงซ้าย',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้ามีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R5: {
            code: '21 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ',
                        subDetails: [
                            'จัดท่าผู้ป่วยให้อยู่ในท่าที่สบาย อยู่ในพื้นที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. หากกดห้ามเลือดไม่หยุด',
                        subDetails: [
                            'ให้ทำการขันชะเนาะ โดยใช้ผ้าที่หนาประมาณ 1 .5 นิ้ว รัดเหนือบาดแผลประมาณ 5-10 ซม. รัดจนกว่าเลือดจนจะหยุด หรือจนคลำชีพจรไม่ได้  พร้อมบันทึกเวลาที่ทำการขันชะเนาะไว้ด้วย'
                        ]

                    },
                    {
                        detail: '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากทำการขันชะเนาะเส้นแรกแล้วเลือดยังไม่หยุด สามารถรัดเพิ่มได้อีก 1 เส้น โดยรัดเหนือเส้นแรก 5-10 ซม. หลีกเลี่ยงบริเวณข้อต่อ เนื่องจากจะทำให้การขันชะเนาะมีประสิทธิภาพลดลง'
                ]
            },
        },
        R6: {
            code: '21 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        R7: {
            code: '21 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        R8: {
            code: '21 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนในท่าที่สบาย',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้ามีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R9: {
            code: '21 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้พบเห็นเหตุการณ์ ตั้งสติ อย่าเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้ามีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    'อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y1: {
            code: '21 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนในท่าที่สบาย  อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้ามีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        Y2: {
            code: '21 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้ามีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        Y3: {
            code: '21 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนในท่าที่สบาย',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้ามีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        Y4: {
            code: '21 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'หากมีอุปกรณ์ดาม ให้ดามส่วนที่ผิดรูประหว่างรอรถพยาบาล'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้ามีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        Y5: {
            code: '21 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยให้นอนอยู่ในท่าที่สบาย อากาศถ่ายเท',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้ามีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        Y6: {
            code: '21 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        Y8: {
            code: '21 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'หากมีอุปกรณ์ดาม ให้ดามส่วนที่ผิดรูประหว่างรอรถพยาบาล'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้ามีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        Y9: {
            code: '21 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'หากมีอุปกรณ์ดาม ให้ดามส่วนที่ผิดรูประหว่างรอรถพยาบาล'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ไม่แตะต้องอาวุธในที่เกิดเหตุ สงวนพยานหลักฐาน',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้ามีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        G1: {
            code: '21 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ปิดแผลด้วยผ้าสะอาด',
                        subDetails: [
                            'และให้ญาติพาผู้ป่วยไปรับการตรวจรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        G2: {
            code: '21 เขียว 2',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ญาติพาพาผู้ป่วยไปรับการตรวจรักษาที่โรงพยาบาลใกล้บ้าน',
                        subDetails: [

                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        G4: {
            code: '21 เขียว 4',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ทำการดามบริเวณที่บาดเจ็บ',
                        subDetails: [
                            'แนะนำให้ญาติพาพาผู้ป่วยไปรับการตรวจรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        G5: {
            code: '21 เขียว 5',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ญาติพาพาผู้ป่วยไปแจ้งความที่โรงพัก',
                        subDetails: [
                            'และไปรับการตรวจรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        G7: {
            code: '21 เขียว 7',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'หากบาดเจ็บเล็กน้อยแนะนำให้ญาติพาไปรับการตรวจรักษาที่โรงพยาบาลใกล้บ้าน',
                        subDetails: [
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        G8: {
            code: '21 เขียว 8',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ล้างตา ผ่านน้ำสะอาดแบบไหลผ่าน',
                        subDetails: [
                            'หากอาการไม่ดีขึ้น แนะนำให้ญาติพาไปรับการตรวจรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        W1: {
            code: '21 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยประคบเย็นใน 24 ชั่วโมงแรก',
                        subDetails: [
                            'และประคบร้อน 24 ชั่วโมงหลัง  หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        W2: {
            code: '21 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ญาติเกลี่ยกล่อมให้นอนพัก ',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        W3: {
            code: '21 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ญาติเกลี่ยกล่อมให้นอนพัก ',
                        subDetails: [
                            'รับประทานยาแก้ปวด หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ '
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        W4: {
            code: '21 ขาว 4',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'ทำการดามบริเวณที่บาดเจ็บ',
                        subDetails: [
                            'แนะนำให้ญาติพาไปรับการตรวจรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        W5: {
            code: '21 ขาว 5',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'ทำการล้างแผลด้วยน้ำสบู่',
                        subDetails: [
                            'เช็คให้แห้งป้ายยาฆ่าเชื้อ หากแผลบวมแดง หรือมีน้ำเหลืองซ้ำ  แนะนำให้ญาติพาไปรับการตรวจรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
    },
    GROUP22: {
        R1: {
            code: '22 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        R2: {
            code: '22 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีกระแสไฟฟ้ารั่วไหลให้ตัดกระแสไฟฟ้า ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            ' หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4.กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R3: {
            code: '22 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีกระแสไฟฟ้ารั่วไหลให้ตัดกระแสไฟฟ้า ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. จัดท่าผู้ป่วยนอนราบศีรษะต่ำ',
                        subDetails: [
                            ' ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4.กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R4: {
            code: '22 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีกระแสไฟฟ้ารั่วไหลให้ตัดกระแสไฟฟ้า ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. จัดท่านอนตะแคงซ้าย',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '3. หากผู้ป่วยชัก ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด  ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R5: {
            code: '22 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีกระแสไฟฟ้ารั่วไหลให้ตัดกระแสไฟฟ้า ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ  ',
                        subDetails: [
                            'จัดท่าผู้ป่วยให้อยู่ในท่าที่สบาย'
                        ]
                    },
                    {
                        detail: '3. หากกดห้ามเลือดไม่หยุด ให้ทำการขันชะเนาะ',
                        subDetails: [
                            'โดยใช้ผ้าที่หนาประมาณ 1 .5 นิ้ว รัดเหนือบาดแผลประมาณ 5-10 ซม. รัดจนกว่าเลือดจนจะหยุด หรือจนคลำชีพจรไม่ได้  พร้อมบันทึกเวลาที่ทำการขันชะเนาะไว้ด้วย'
                        ]
                    },
                    {
                        detail: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด  ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R6: {
            code: '22 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีกระแสไฟฟ้ารั่วไหลให้ตัดกระแสไฟฟ้า ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศ'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R7: {
            code: '22 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีกระแสไฟฟ้ารั่วไหลให้ตัดกระแสไฟฟ้า ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศ'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R8: {
            code: '22 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. จัดท่านอนตะแคงซ้าย',
                        subDetails: [
                            'เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R9: {
            code: '22 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. จัดท่านอนตะแคงซ้าย',
                        subDetails: [
                            'เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y1: {
            code: '22 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. ใช้น้ำล้างบริเวณที่ถูกราด และปิดแผลด้วยผ้าสะอาด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y2: {
            code: '22 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. จัดท่านอนศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y3: {
            code: '22 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. จัดท่านอนตะแคงซ้าย',
                        subDetails: [
                            'เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y4: {
            code: '22 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        Y5: {
            code: '22 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. ใช้น้ำล้างตาแบบไหลผ่าน',
                        subDetails: [
                            'ล้างด้วยน้ำจำนวนมาก และปิดตาด้วยผ้าสะอาด'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y6: {
            code: '22 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. ใช้น้ำล้างตาแบบไหลผ่าน',
                        subDetails: [
                            'ล้างด้วยน้ำจำนวนมาก และปิดตาด้วยผ้าสะอาด'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y7: {
            code: '22 เหลือง 7',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. จัดท่าผู้ป่วยให้นอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y8: {
            code: '22 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. ใช้น้ำล้างบริเวณที่ถูกลวก และปิดแผลด้วยผ้าสะอาด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y9: {
            code: '22 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
                        subDetails: [
                            'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
                        subDetails: [
                            'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง'
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        G3: {
            code: '22 เขียว 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้งดใช้อุปกรณ์ที่ถูกช็อค',
                        subDetails: [
                            'และให้ญาตินำผู้ป่วยไปรับรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        G5: {
            code: '22 เขียว 5',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        G6: {
            code: '22 เขียว 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'ให้ล้างแผลด้วยน้ำเย็นสะอาด',
                        subDetails: [
                            'ปิดแผลด้วยผ้าสะอาดและให้ญาตินำผู้ป่วยไปรับรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        G7: {
            code: '22 เขียว 7',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        G8: {
            code: '22 เขียว 8',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'ให้ล้างตาด้วยน้ำสะอาดจำนวนมาก',
                        subDetails: [
                            'ปิดตาด้วยผ้าสะอาด  หากอาการไม่ดีขึ้น และให้ญาตินำผู้ป่วยไปรับรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        W1: {
            code: '22 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยล้างแผลด้วยน้ำสบู่',
                        subDetails: [
                            'ปิดแผลด้วยผ้าสะอาด  หากมีแผลบวมแดง น้ำเหลืองซึมมีไข้ หายใจเหนื่อย ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        W2: {
            code: '22 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            'ให้ความอบอุ่นแก่ร่างกาย หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        W3: {
            code: '22 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยแช่น้ำเย็น 5-10 นาที แล้วเช็ดให้แห้ง ปิดแผลด้วยผ้าสะอาด ',
                        subDetails: [
                            'ให้ความอบอุ่นแก่ร่างกาย หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
    },
    GROUP23: {
        R1: {
            code: '23 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '4. เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย ',
                ]
            },
        },
        R2: {
            code: '23 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            ' หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '3. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R3: {
            code: '23 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. จัดท่าผู้ป่วยนอนราบศีรษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R4: {
            code: '23 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. จัดท่านอนตะแคงซ้าย  อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R5: {
            code: '23 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. หากกดห้ามเลือดไม่หยุด ให้ทำการขันชะเนาะ ',
                        subDetails: [
                            'โดยใช้ผ้าที่หนาประมาณ 1 .5 นิ้ว รัดเหนือบาดแผลประมาณ 5-10 ซม. รัดจนกว่าเลือดจนจะหยุด หรือจนคลำชีพจรไม่ได้  พร้อมบันทึกเวลาที่ทำการขันชะเนาะไว้ด้วย'
                        ]
                    },
                    {
                        detail: '3. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ ',
                        subDetails: [
                            'จัดท่านอนตะแคงซ้าย อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R6: {
            code: '23 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [

                ],
                notes: [
                ]
            },
        },
        R7: {
            code: '23 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ผู้พบเห็น หรือพลเมืองดี หากมีชูชีพ/ทุ่นลอยน้ำให้โยนให้ผู้ป่วยเกาะ ห้ามลงน้ำ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. หากผู้ป่วยขึ้นมาจากน้ำได้  ให้เช็ดตัวให้แห้ง',
                        subDetails: [
                            'และให้ความอบอุ่นแก่ผู้ป่วย ผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และ เจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R9: {
            code: '23 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ผู้พบเห็น หรือพลเมืองดี หากมีชูชีพ/ทุ่นลอยน้ำให้โยนให้ผู้ป่วยเกาะ ห้ามลงน้ำ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. หากผู้ป่วยขึ้นมาจากน้ำได้  ให้เช็ดตัวให้แห้ง',
                        subDetails: [
                            'และให้ความอบอุ่นแก่ผู้ป่วย ผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และ เจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y1: {
            code: '23 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ผู้พบเห็น หรือพลเมืองดี หากมีชูชีพ/ทุ่นลอยน้ำให้โยนให้ผู้ป่วยเกาะ ห้ามลงน้ำ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. หากผู้ป่วยขึ้นมาจากน้ำได้  ให้เช็ดตัวให้แห้ง',
                        subDetails: [
                            'และให้ความอบอุ่นแก่ผู้ป่วย ผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และ เจ้าหน้าที่พยาบาล '
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        Y2: {
            code: '23 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ให้เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. จัดท่านอนศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง ',
                        subDetails: [
                            'และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        Y3: {
            code: '23 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ให้เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. จัดท่านอนศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง ',
                        subDetails: [
                            'และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        Y4: {
            code: '23 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ให้เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าเคลื่อนย้ายผู้ป่วย ',
                        subDetails: [
                            'หากมีอุปกรณ์ดามให้ดามส่วนที่ผิดรูปให้อยู่นิ่ง'
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง ',
                        subDetails: [
                            'และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        Y5: {
            code: '23 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ให้เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าเคลื่อนย้ายผู้ป่วย ',
                        subDetails: [
                            'หากมีอุปกรณ์ดามให้ดามส่วนที่ผิดรูปให้อยู่นิ่ง'
                        ]
                    },
                    {
                        detail: '3. ให้ผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง ',
                        subDetails: [
                            'และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        Y6: {
            code: '23 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ให้เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. จัดท่าผู้ป่วยให้นอนอยู่ในท่าที่สบาย อากาศถ่ายเท ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง ',
                        subDetails: [
                            'และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        Y7: {
            code: '23 เหลือง 7',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        Y9: {
            code: '23 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ให้เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. จัดท่าผู้ป่วยให้นอนอยู่ในท่าที่สบาย อากาศถ่ายเท ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง ',
                        subDetails: [
                            'และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ'
                ]
            },
        },
        G1: {
            code: '23 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. ให้เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. ล้างแผลด้วยน้ำสะอาด หรือน้ำสบู่',
                        subDetails: [
                            'ปิดแผลด้วยผ้าสะอาด แนะนำให้ญาติพาผู้ป่วยไปรับการรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]
                    },
                ],
                notes: [

                ]
            },
        },
        G3: {
            code: '23 เขียว 3',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        G4: {
            code: '23 เขียว 4',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. ให้เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'หากมีอุปกรณ์ดามให้ดามส่วนที่ผิดรูปให้อยู่นิ่ง แนะนำให้ญาติพาผู้ป่วยไปรับการรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]
                    },
                ],
                notes: [

                ]
            },
        },
        G5: {
            code: '23 เขียว 5',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        W1: {
            code: '23 ขาว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. ให้เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. ล้างแผลด้วยน้ำสะอาด หรือน้ำสบู่',
                        subDetails: [
                            'ปิดแผลด้วยผ้าสะอาด แผลฟกช้ำให้ประคบเย็นใน 24 ชั่วโมงแรก และประคบร้อน 24 ชั่วโมงหลัง หากแผลบวมแดง มีน้ำเหลือง หรือ อาการไม่ดีขึ้น แนะนำให้ญาติพาผู้ป่วยไปรับการรักษาที่โรงพยาบาลใกล้บ้าน หรือในวันวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            },
        },
        W4: {
            code: '23 ขาว 4',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. ให้เช็ดตัวให้แห้ง และให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. อย่าเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'หากมีอุปกรณ์ดามให้ดามส่วนที่ผิดรูปให้อยู่นิ่ง แนะนำให้ญาติพาผู้ป่วยไปรับการรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]
                    },
                ],
                notes: [

                ]
            },
        },
    },
    GROUP24: {
        R1: {
            code: '24 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        R2: {
            code: '23 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R3: {
            code: '24 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศีรษะต่ำ  ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R4: {
            code: '24 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนตะแคงซ้าย  อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R5: {
            code: '24 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ',
                        subDetails: [
                            'จัดท่าผู้ป่วยให้อยู่ในท่าที่สบาย อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. หากกดห้ามเลือดไม่หยุด ให้ทำการขันชะเนาะ',
                        subDetails: [
                            'โดยใช้ผ้าที่หนาประมาณ 1 .5 นิ้ว รัดเหนือบาดแผลประมาณ 5-10 ซม. รัดจนกว่าเลือดจนจะหยุด หรือจนคลำชีพจรไม่ได้  พร้อมบันทึกเวลาที่ทำการขันชะเนาะไว้ด้วย'
                        ]
                    },
                    {
                        detail: '3. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากทำการขันชะเนาะเส้นแรกแล้วเลือดยังไม่หยุด สามารถรัดเพิ่มได้อีก 1 เส้น โดยรัดเหนือเส้นแรก 5-10 ซม. หลีกเลี่ยงบริเวณข้อต่อ เนื่องจากจะทำให้การขันชะเนาะมีประสิทธิภาพลดลง'
                ]
            },
        },
        R6: {
            code: '24 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ',
                        subDetails: [
                            'จัดท่าผู้ป่วยให้อยู่ในท่าที่สบาย อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. หากกดห้ามเลือดไม่หยุด ให้ทำการขันชะเนาะ',
                        subDetails: [
                            'โดยใช้ผ้าที่หนาประมาณ 1 .5 นิ้ว รัดเหนือบาดแผลประมาณ 5-10 ซม. รัดจนกว่าเลือดจนจะหยุด หรือจนคลำชีพจรไม่ได้  พร้อมบันทึกเวลาที่ทำการขันชะเนาะไว้ด้วย'
                        ]
                    },
                    {
                        detail: '3. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากทำการขันชะเนาะเส้นแรกแล้วเลือดยังไม่หยุด สามารถรัดเพิ่มได้อีก 1 เส้น โดยรัดเหนือเส้นแรก 5-10 ซม. หลีกเลี่ยงบริเวณข้อต่อ เนื่องจากจะทำให้การขันชะเนาะมีประสิทธิภาพลดลง'
                ]
            },
        },
        R7: {
            code: '24 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ',
                        subDetails: [
                            'จัดท่าผู้ป่วยให้อยู่ในท่าที่สบาย อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ล้างแผลด้วยน้ำสะอาด หรือน้ำสบู่',
                        subDetails: [
                            'ปิดแผลด้วยผ้าสะอาด ส่วนอวัยวะที่ถูกตัดขาดให้เก็บใส่ถุงมัดปากถุงให้แน่น นำไปแช่ในกระติกน้ำแข็งที่มีน้ำผสมอยู่ด้วย ไม่แช่ในน้ำแข็งโดยตรง'
                        ]
                    },
                    {
                        detail: '3. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R8: {
            code: '24 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ',
                        subDetails: [
                            'จัดท่าผู้ป่วยให้อยู่ในท่าที่สบาย อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R9: {
            code: '24 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ',
                        subDetails: [
                            'จัดท่าผู้ป่วยให้อยู่ในท่าที่สบาย อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y1: {
            code: '24 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนตะแคงซ้าย  อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y2: {
            code: '24 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y3: {
            code: '24 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ',
                        subDetails: [
                            'จัดท่าผู้ป่วยให้อยู่ในท่าที่สบาย อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ล้างแผลด้วยน้ำสะอาด หรือน้ำสบู่',
                        subDetails: [
                            'ปิดแผลด้วยผ้าสะอาด ส่วนอวัยวะที่ถูกตัดขาดให้เก็บใส่ถุงมัดปากถุงให้แน่น นำไปแช่ในกระติกน้ำแข็งที่มีน้ำผสมอยู่ด้วย ไม่แช่ในน้ำแข็งโดยตรง'
                        ]
                    },
                    {
                        detail: '3. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y4: {
            code: '24 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. อย่าเคลื่อนย้ายผู้ป่วย หากมีอุปกรณ์ดามให้ดามส่วนที่ผิดรูปให้อยู่นิ่ง',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y5: {
            code: '24 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ',
                        subDetails: [
                            'จัดท่าผู้ป่วยให้อยู่ในท่าที่สบาย อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y6: {
            code: '24 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ',
                        subDetails: [
                            'จัดท่าผู้ป่วยให้อยู่ในท่าที่สบาย อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y7: {
            code: '24 เหลือง 7',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ',
                        subDetails: [
                            'จัดท่าผู้ป่วยให้อยู่ในท่าที่สบาย อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y9: {
            code: '24 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ',
                        subDetails: [
                            'จัดท่าผู้ป่วยให้อยู่ในท่าที่สบาย อยู่ในพื้นที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        G1: {
            code: '24 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ล้างแผลด้วยน้ำสะอาด หรือน้ำสบู่ ปิดแผลด้วยผ้าสะอาด แนะนำให้ญาติพาผู้ป่วยไปรับการรักษาที่โรงพยาบาลใกล้บ้าน',
                        subDetails: [
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        G2: {
            code: '24 เขียว 2',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'พยายามอย่าเคลื่อนไหวผู้ป่วยมาก',
                        subDetails: [
                            'หากมีอุปกรณ์ดามให้ดามส่วนที่ผิดรูปให้อยู่นิ่ง แนะนำให้ญาติพาผู้ป่วยไปรับการรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        G3: {
            code: '24 เขียว 3',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'พยายามอย่าเคลื่อนไหวผู้ป่วยมาก',
                        subDetails: [
                            'หากมีอุปกรณ์ดามให้ดามส่วนที่ผิดรูปให้อยู่นิ่ง แนะนำให้ญาติพาผู้ป่วยไปรับการรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        G4: {
            code: '24 เขียว 4',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'พยายามอย่าเคลื่อนไหวผู้ป่วยมาก',
                        subDetails: [
                            'หากมีอุปกรณ์ดามให้ดามส่วนที่ผิดรูปให้อยู่นิ่ง แนะนำให้ญาติพาผู้ป่วยไปรับการรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        G6: {
            code: '24 เขียว 6',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        G9: {
            code: '24 เขียว 9',
            level: LEVEL.G,
            advise: {
                contents: [


                ],
                notes: [

                ]
            },
        },
        W1: {
            code: '24 ขาว 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'ล้างแผลด้วยน้ำสะอาด หรือน้ำสบู่',
                        subDetails: [
                            'ปิดแผลด้วยผ้าสะอาด แผลฟกช้ำให้ประคบเย็นใน 24 ชั่วโมงแรก และประคบร้อน 24 ชั่วโมงหลัง หากแผลบวมแดง มีน้ำเหลือง หรือ อาการไม่ดีขึ้น แนะนำให้ญาติพาผู้ป่วยไปรับการรักษาที่โรงพยาบาลใกล้บ้าน หรือในวันวันเวลาราชการ'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        W2: {
            code: '24 ขาว 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้สังเกตอาการ ',
                        subDetails: [
                            'หากมีอาการเจ็บแน่นหน้าอก หายใจติดขัด อาเจียนพุ่ง ซึมลง ให้มาพบแพทย์ทันที หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        W3: {
            code: '24 ขาว 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้สังเกตอาการ ',
                        subDetails: [
                            'หากมีอาการเจ็บแน่นหน้าอก หายใจติดขัด อาเจียนพุ่ง ซึมลง ให้มาพบแพทย์ทันที หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
        W4: {
            code: '24 ขาว 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'พยายามอย่าเคลื่อนไหวผู้ป่วยมาก ',
                        subDetails: [
                            'หากมีอุปกรณ์ดามให้ดามส่วนที่ผิดรูปให้อยู่นิ่ง แนะนำให้ญาติพาผู้ป่วยไปรับการรักษาที่โรงพยาบาลใกล้บ้าน'
                        ]

                    },
                ],
                notes: [

                ]
            },
        },
    },
    GROUP25: {
        R1: {
            code: '25 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                ]
            },
        },
        R2: {
            code: '25 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีผู้ป่วยมีการบาดเจ็บของกระดูกต้นคอหรือไขสันหลัง ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'ถ้าหากผู้ป่วยไม่มีอาการดังกล่าว แนะนำให้ผู้ป่วยนอนราบศีรษะสูง หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. หากมีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R3: {
            code: '25 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีผู้ป่วยมีการบาดเจ็บของกระดูกต้นคอหรือไขสันหลัง ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'ถ้าหากผู้ป่วยไม่มีอาการดังกล่าว แนะนำให้ผู้ป่วยนอนราบศีรษะสูง หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. หากมีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R4: {
            code: '25 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีผู้ป่วยมีการบาดเจ็บของกระดูกต้นคอหรือไขสันหลัง ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'ถ้าหากผู้ป่วยไม่มีอาการดังกล่าว แนะนำให้ผู้ป่วยนอนราบศีรษะสูง หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. หากมีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R5: {
            code: '25 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีผู้ป่วยมีการบาดเจ็บของกระดูกต้นคอหรือไขสันหลัง ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'ถ้าหากผู้ป่วยไม่มีอาการดังกล่าว แนะนำให้ผู้ป่วยนอนราบศีรษะสูง หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. หากกดห้ามเลือดไม่หยุด ให้ทำการขันชะเนาะ',
                        subDetails: [
                            'โดยใช้ผ้าที่หนาประมาณ 1 .5 นิ้ว รัดเหนือบาดแผลประมาณ 5-10 ซม. รัดจนกว่าเลือดจนจะหยุด หรือจนคลำชีพจรไม่ได้  พร้อมบันทึกเวลาที่ทำการขันชะเนาะไว้ด้วย'
                        ]
                    },
                    {
                        detail: '3. ห่มผ้าให้ความอบอุ่นแก่ผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำบนตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากทำการขันชะเนาะเส้นแรกแล้วเลือดยังไม่หยุด สามารถรัดเพิ่มได้อีก 1 เส้น โดยรัดเหนือเส้นแรก 5-10 ซม. หลีกเลี่ยงบริเวณข้อต่อ เนื่องจากจะทำให้การขันชะเนาะมีประสิทธิภาพลดลง',
                ]
            },
        },
        R6: {
            code: '25 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [

                ],
                notes: [
                ]
            },
        },
        R7: {
            code: '25 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีผู้ป่วยมีการบาดเจ็บของกระดูกต้นคอหรือไขสันหลัง ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'ถ้าหากผู้ป่วยไม่มีอาการดังกล่าว แนะนำให้ผู้ป่วยนอนราบศีรษะสูง หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. หากมีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3 .อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำบนตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R8: {
            code: '25 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีผู้ป่วยมีการบาดเจ็บของกระดูกต้นคอหรือไขสันหลัง ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'ถ้าหากผู้ป่วยไม่มีอาการดังกล่าว แนะนำให้ผู้ป่วยนอนราบศีรษะสูง หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. หากมีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำบนตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R9: {
            code: '25 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีผู้ป่วยมีการบาดเจ็บของกระดูกต้นคอหรือไขสันหลัง ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'ถ้าหากผู้ป่วยไม่มีอาการดังกล่าว แนะนำให้ผู้ป่วยนอนราบศีรษะสูง หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. หากมีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำบนตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y1: {
            code: '25 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีผู้ป่วยมีการบาดเจ็บของกระดูกต้นคอหรือไขสันหลัง ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'ถ้าหากผู้ป่วยไม่มีอาการดังกล่าว แนะนำให้ผู้ป่วยนอนราบศีรษะสูง หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. หากมีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำบนตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y2: {
            code: '25 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีผู้ป่วยมีการบาดเจ็บของกระดูกต้นคอหรือไขสันหลัง ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'ถ้าหากผู้ป่วยไม่มีอาการดังกล่าว แนะนำให้ผู้ป่วยนอนราบศีรษะสูง หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. หากมีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำบนตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y3: {
            code: '25 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        Y4: {
            code: '25 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีผู้ป่วยมีการบาดเจ็บของกระดูกต้นคอหรือไขสันหลัง ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'ถ้าหากผู้ป่วยไม่มีอาการดังกล่าว แนะนำให้ผู้ป่วยนอนราบศีรษะสูง หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. หากมีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำบนตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        Y5: {
            code: '25 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        Y8: {
            code: '25 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        Y9: {
            code: '25 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. กรณีผู้ป่วยมีการบาดเจ็บของกระดูกต้นคอหรือไขสันหลัง ห้ามเคลื่อนย้ายผู้ป่วย',
                        subDetails: [
                            'ถ้าหากผู้ป่วยไม่มีอาการดังกล่าว แนะนำให้ผู้ป่วยนอนราบศีรษะสูง หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. หากมีเลือดออก ให้ใช้ผ้าสะอาดกดห้ามเลือด',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำบนตัวผู้ป่วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
                        subDetails: [
                            'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        G1: {
            code: '25 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        G6: {
            code: '25 เขียว 6',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        G7: {
            code: '25 เขียว 7',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'หากบาดเจ็บเล็กน้อย แนะนำให้ญาตินำผู้ป่วยรับการรักษาโรงพยาบาลใกล้บ้าน',
                        subDetails: [
                        ]
                    },
                ],
                notes: [

                ]
            },
        },
        G8: {
            code: '25 เขียว 8',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        G9: {
            code: '25 เขียว 9',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        W1: {
            code: '25 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
        W2: {
            code: '25 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [

                ],
                notes: [

                ]
            },
        },
    }
}

export const QUESTIONS = [
    {
        name: 'ปวดท้อง',
        description: 'ปวดท้อง, หลัง, เชิงกรานและขาหนีบ',
        module: 1,
        image: 'assets/imgs/stomach-ache.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y9.code,
                            advise: RESULT.GROUP1.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R1.code,
                            advise: RESULT.GROUP1.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y8.code,
                            advise: RESULT.GROUP1.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 21,
                criteria: {
                    minimumChecked: 1,
                    to: 6,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยปวดท้องส่วนใด',
                from: 6,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ปวด/จุกเสียด/แน่นยอดอก/ลิ้นปี่/ท้องส่วนบน (เหนือสะดือ)',
                        to: 7
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ปวดท้องน้อย/หลัง/บั้นเอว/สีข้าง',
                        to: 8
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ปวดไม่จำเพาะเจาะจง/อื่นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y3.code,
                            advise: RESULT.GROUP1.Y3.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุมากกว่า 50 ปี หรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อายุมากกว่า 50 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R9.code,
                            advise: RESULT.GROUP1.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อายุน้อยกว่า 50 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y3.code,
                            advise: RESULT.GROUP1.Y3.advise,
                        }
                    },
                ]
            },
            {
                question: 'อาการปวดเกิดจากการบาดเจ็บหรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่เกิดอาการบาดเจ็บ',
                        to: 9
                    },
                    {
                        type: TYPE.MODULE,
                        name: 'เกิดอาการบาดเจ็บ',
                        module: 21,
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าใด',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อายุมากกว่า 65 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R8.code,
                            advise: RESULT.GROUP1.R8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อายุ 50 - 65 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y4.code,
                            advise: RESULT.GROUP1.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อายุน้อยกว่า 50 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y3.code,
                            advise: RESULT.GROUP1.Y3.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอาเจียนหรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'อาเจียน',
                        to: 11
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่อาเจียน',
                        to: 12,
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีเลือดออกหรือไม่ ที่ใดบ้าง',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อาเจียนเป็นเลือด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R5.code,
                            advise: RESULT.GROUP1.R5.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ถ่ายอุจจาระดำ / แดงคล้ำ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R6.code,
                            advise: RESULT.GROUP1.R6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: '(กรณีเป็นผู้หญิง)มีเลือดออกทางช่องคลอด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R7.code,
                            advise: RESULT.GROUP1.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่เห็นมีเลือดออก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP1.G1.code,
                            advise: RESULT.GROUP1.G1.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยปวดท้องส่วนใด บนเหนือสะดือหรือส่่วนอื่น',
                from: 12,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ท้องส่วนบน เหนือสะดือ',
                        to: 13
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ท้องน้อย',
                        to: 14
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หลัง',
                        to: 16
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'บั้นเอว/สีข้าง',
                        to: 19
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ขาหนีบ',
                        to: 20
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ระบุบริเวณที่ปวดชัดเจนไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W1.code,
                            advise: RESULT.GROUP1.W1.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุมากกว่า 50 ปีหรือไม่',
                from: 13,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อายุมากกว่า 50 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y6.code,
                            advise: RESULT.GROUP1.Y6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อายุน้อยกว่า 50 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W2.code,
                            advise: RESULT.GROUP1.W2.advise,
                        }
                    },

                ]
            },
            {
                question: 'อาการปวดเกิดจากการบาดเจ็บหรือไม่',
                from: 14,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 15
                    },
                    {
                        type: TYPE.MODULE,
                        name: 'ใช่',
                        module: 21,
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุมากกว่า 50 ปีหรือไม่',
                from: 15,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อายุมากกว่า 50 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y4.code,
                            advise: RESULT.GROUP1.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อายุน้อยกว่า 50 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W2.code,
                            advise: RESULT.GROUP1.W2.advise,
                        }
                    },

                ]
            },
            {
                question: 'อาการปวดเกิดจากการบาดเจ็บ/ยกของหนักใช่หรือไม่',
                from: 16,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 17
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W6.code,
                            advise: RESULT.GROUP1.W6.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอายุมากกว่า 50 ปีหรือไม่',
                from: 17,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'อายุมากกว่า 50 ปี',
                        to: 18
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'อายุน้อยกว่า 50 ปี',
                        to: 19
                    },
                ]
            },
            {
                question: 'ผู้ป่วยเริ่มมีอาการปวดรุนแรงขึ้นมาอย่างเฉียบพลันหรือไม่',
                from: 18,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y4.code,
                            advise: RESULT.GROUP1.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W3.code,
                            advise: RESULT.GROUP1.W3.advise,
                        }
                    },
                ]
            },

            {
                question: 'ปวดบีบอย่างรุนแรงเป็นช่วงๆหรือไม่',
                from: 19,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y5.code,
                            advise: RESULT.GROUP1.Y5.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W4.code,
                            advise: RESULT.GROUP1.W4.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยเริ่มมีอาการปวดรุนแรงขึ้นมาอย่างเฉียบพลันหรือไม่',
                from: 20,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP1.G1.code,
                            advise: RESULT.GROUP1.G1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W5.code,
                            advise: RESULT.GROUP1.W5.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีปัญหาสายสวนหรือไม่',
                from: 21,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'มี',
                        to: 22
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 10
                    },
                ]
            },
            {
                question: 'เป็นสายสวนอะไร',
                from: 22,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'สายสวนปัสสาวะ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W7.code,
                            advise: RESULT.GROUP1.W7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'สายสวนอื่นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP1.G2.code,
                            advise: RESULT.GROUP1.G2.advise,
                        }
                    },
                ]
            },

        ]
    },
    {
        name: 'แพ้ยา',
        description: 'แพ้อาหาร , สัตว์ต่อย , ภูมิแพ้ ',
        module: 2,
        image: 'assets/imgs/pill.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP2.Y9.code,
                            advise: RESULT.GROUP2.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R1.code,
                            advise: RESULT.GROUP2.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบาน ไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP2.Y8.code,
                            advise: RESULT.GROUP2.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP2.R3.code,
                    advise: RESULT.GROUP2.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลม',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อาการซึมลง',
                        checked: false,
                    },
                ]
            },
            {
                question: 'ผุ้ป่วยเคยมีประวัติแพ้รุนแรงต่อสิ่งใดหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'เคย',
                        to: 7
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่เคย',
                        to: 8
                    },
                ]
            },
            {
                question: 'เคยมีอาการเกิดขึ้นหลังจากได้รับสิ่งที่แพ้ภายใน 30 นาทีหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP2.Y1.code,
                            advise: RESULT.GROUP2.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 8
                    },
                ]
            },
            {
                question: 'ผุ้ป่วยเคยแพ้ยา / ช่วงนี้ผู้ป่วยกิน / ได้รับยาแล้วมีอาการแพ้หรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP2.Y4.code,
                            advise: RESULT.GROUP2.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 9
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการผิดปกติอย่างไรบ้าง',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นผื่นคัน / ลมพิษ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP2.W3.code,
                            advise: RESULT.GROUP2.W3.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อาการอื่นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP2.W2.code,
                            advise: RESULT.GROUP2.W2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีอาการผิดปกติ',
                        to: 11
                    },
                ]
            },
            {
                question: 'ผู้ป่วยเคยมีประวัติการแพ้หรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เคย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP2.W4.code,
                            advise: RESULT.GROUP2.W4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่เคย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP2.W1.code,
                            advise: RESULT.GROUP2.W1.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'สัตว์กัด',
        description: 'สัตว์กัด',
        module: 3,

        image: 'assets/imgs/cobra.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP3.Y9.code,
                            advise: RESULT.GROUP3.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R1.code,
                            advise: RESULT.GROUP3.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP3.Y8.code,
                            advise: RESULT.GROUP3.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP3.R3.code,
                    advise: RESULT.GROUP3.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },

                ]
            },
            {
                question: 'ผู้ป่วยถูกสัตว์ชนิดใดกัดหรือต่อย',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'งูพิษ/งูที่ไม่แน่ใจว่ามีพิษ/สัตว์มีพิษ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R6.code,
                            advise: RESULT.GROUP3.R6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หอยเต้าปูน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R6.code,
                            advise: RESULT.GROUP3.R6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผึ้ง/แตน/ต่อ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP3.G1.code,
                            advise: RESULT.GROUP3.G1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'สัตว์อื่นๆ',
                        to: 7
                    },
                ]
            },
            {
                question: 'มีอาการบวม/ฟกช้ำรอบตำแหน่งที่ถูกกัด/เสีย/สัมผัสบ้างหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP3.W1.code,
                            advise: RESULT.GROUP3.W1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP3.W3.code,
                            advise: RESULT.GROUP3.W3.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'เลือดออก',
        description: 'ไม่มีสาเหตุจากการบาดเจ็บ',
        module: 4,
        image: 'assets/imgs/broken-heart-bleeding.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y9.code,
                            advise: RESULT.GROUP4.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่รู้สึกตัวเพิ่มขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R1.code,
                            advise: RESULT.GROUP4.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },

                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y8.code,
                            advise: RESULT.GROUP4.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                criteria: {
                    minimumChecked: 1,
                    to: 6,
                    payload: {
                        level: LEVEL.R.text,
                        color: LEVEL.R.color,
                        code: RESULT.GROUP4.R3.code,
                        advise: RESULT.GROUP4.R3.advise,
                    }
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มีอาการหมดสติชั่ววูบหลายครั้งในวันนั้น',
                        checked: false,
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีเลือดออกที่ใดบ้าง',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อาเจียนเป็นเลือด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y1.code,
                            advise: RESULT.GROUP4.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ถ่ายอุจจาระดำ / แดงคล้ำ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y1.code,
                            advise: RESULT.GROUP4.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไอเป็นเลือด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y1.code,
                            advise: RESULT.GROUP4.Y1.advise,
                        }
                    },

                    {
                        type: TYPE.QUESTION,
                        name: 'เลือดกำเดา',
                        to: 7
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'กรณีเป็นผู้หญิงมีเลือดออกทางช่องคลอด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y1.code,
                            advise: RESULT.GROUP4.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เลือดในปัสสาวะ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP4.G2.code,
                            advise: RESULT.GROUP4.G2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ที่อื่น นอกจากทวารดังกล่าวข้างต้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y1.code,
                            advise: RESULT.GROUP4.Y1.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยยอมที่จะลองหยุดเลือดด้วยตัวเองหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยินยอม',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP4.W2.code,
                            advise: RESULT.GROUP4.W2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ยินยอม',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP4.G1.code,
                            advise: RESULT.GROUP4.G1.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'หายใจลำบาก',
        description: 'ติดขัด',
        module: 5,
        image: 'assets/imgs/nose.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP5.Y9.code,
                            advise: RESULT.GROUP5.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R1.code,
                            advise: RESULT.GROUP5.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP5.Y8.code,
                            advise: RESULT.GROUP5.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP5.R3.code,
                    advise: RESULT.GROUP5.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },

                ]
            },
            {
                question: 'ผู้ป่วยเจ็บแน่นทรวงอกหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 7
                    },
                ]
            },
            {
                question: 'ผู้เคยมีการใช้อ๊อกซิเจนที่บ้านและหมดถังใช่หรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP5.Y7.code,
                            advise: RESULT.GROUP5.Y7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 8
                    },
                ]
            },
            {
                question: 'ผู้ป่วยถูกการป้องกันตัว เช่น แก๊สน้ำตา สเปรย์พริกไทยหรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP14.G8.code,
                            advise: RESULT.GROUP14.G8.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 9
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการใดต่อไปนี้',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นหวัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP5.W1.code,
                            advise: RESULT.GROUP5.W1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยหรือผู้แจ้งยืนยันการขอความช่วยเหลือ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP5.G6.code,
                            advise: RESULT.GROUP5.G6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อื่นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP5.G7.code,
                            advise: RESULT.GROUP5.G7.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'หัวใจหยุดเต้น',
        description: 'หัวใจหยุดเต้น',
        module: 6,
        image: 'assets/imgs/heartbeat.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'พิจารณาไม่ใช้เนื่องจากอย่างไรก็ตาม ก็จะส่งหน่วยแน่นอน',
                from: 0,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ส่งหน่วย ALS',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP6.R1.code,
                            advise: RESULT.GROUP6.R1.advise,
                        }
                    }
                ]
            },
        ],
    },
    {
        name: 'เจ็บแน่นทรวงอก',
        description: 'หัวใจ, มีปัญหาทางด้านหัวใจ',
        module: 7,
        image: 'assets/imgs/female-trunk.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP7.Y9.code,
                            advise: RESULT.GROUP7.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R1.code,
                            advise: RESULT.GROUP7.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไห ปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP7.Y8.code,
                            advise: RESULT.GROUP7.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                criteria: {
                    minimumChecked: 1,
                    to: 6,
                    payload: {
                        level: LEVEL.R.text,
                        color: LEVEL.R.color,
                        code: RESULT.GROUP7.R3.code,
                        advise: RESULT.GROUP7.R3.advise,
                    }
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หัวใจเต้นเร็ว/ใจสั่น',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคประจำตัวหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'โรคปอด/หลอดเลือดปอด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R9.code,
                            advise: RESULT.GROUP7.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'โรคหลอดเลือด/ลิ้น/กล้ามเนื้อหัวใจ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R9.code,
                            advise: RESULT.GROUP7.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'โรคเบาหวาน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R9.code,
                            advise: RESULT.GROUP7.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'โรคความดันเลือดสูง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R9.code,
                            advise: RESULT.GROUP7.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ฝังเครื่องกระตุกหัวใจอัติโนมัติไว้ แล้วเครื่องกระตุกขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R8.code,
                            advise: RESULT.GROUP7.R8.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี/อื่นๆ',
                        to: 7
                    },
                ]
            },
            {
                question: 'ผู้ป่วยเป็นชายหรือหญิง อายุเท่าไหร่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ชาย อายุมากกว่าหรือเท่ากับ 40 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP7.Y6.code,
                            advise: RESULT.GROUP7.Y6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ชาย อายุน้อยกว่า 40 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP7.G6.code,
                            advise: RESULT.GROUP7.G6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หญิง อายุมากกว่าหรือเท่ากับ 45 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP7.Y6.code,
                            advise: RESULT.GROUP7.Y6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หญิง อายุน้อยกว่า 45 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP7.G6.code,
                            advise: RESULT.GROUP7.G6.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'สำลัก',
        description: 'อุดกั้นทางเดินหายใจ',
        module: 8,
        image: 'assets/imgs/respiratory-system.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP8.Y9.code,
                            advise: RESULT.GROUP8.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R1.code,
                            advise: RESULT.GROUP8.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                ]
            },
            {
                question: 'ผู้ป่วยพูดหรือมีเสียงร้องออกมาหรือไม่',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มีเสียงออกมา',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R2.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'มีเสียงออกมา',
                        to: 3
                    },
                ]
            },
            {
                question: 'หายใจโล่งแล้วหรือยัง',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังไม่โล่ง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R2.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'โล่งแล้ว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP8.Y2.code,
                            advise: RESULT.GROUP8.Y2.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'เบาหวาน',
        description: 'เบาหวาน',
        module: 9,
        image: 'assets/imgs/sugar-blood-level.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP9.Y9.code,
                            advise: RESULT.GROUP9.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP9.R1.code,
                            advise: RESULT.GROUP9.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการซึมๆ สับสนหรือไม่',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มีอาการดังกล่าง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP9.R7.code,
                            advise: RESULT.GROUP9.R7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีอาการดังกล่าว',
                        to: 3
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP9.R2.code,
                            advise: RESULT.GROUP9.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP9.R2.code,
                            advise: RESULT.GROUP9.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP9.R2.code,
                            advise: RESULT.GROUP9.R2.advise,
                        }
                    },

                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 4
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP9.R2.code,
                            advise: RESULT.GROUP9.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 6
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP9.R2.code,
                            advise: RESULT.GROUP9.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP9.R2.code,
                            advise: RESULT.GROUP9.R2.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP9.R2.code,
                            advise: RESULT.GROUP9.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 5,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP9.R2.code,
                            advise: RESULT.GROUP9.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP9.Y8.code,
                            advise: RESULT.GROUP9.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 6,
                to: 7,
                criteria: {
                    minimumChecked: 2,
                    to: 7,
                    payload: {
                        level: LEVEL.R.text,
                        color: LEVEL.R.color,
                        code: RESULT.GROUP9.R3.code,
                        advise: RESULT.GROUP9.R3.advise,
                    }
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยเจ็บแน่นทรวงอกหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP9.R5.code,
                            advise: RESULT.GROUP9.R5.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 8
                    },
                ]
            },
            {
                question: 'ผู้ป่วยชักหรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP9.R6.code,
                            advise: RESULT.GROUP9.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 9
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการอย่างไร',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อ่อนเพลีย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP9.W2.code,
                            advise: RESULT.GROUP9.W2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'รู้สึกตัวดี พูดคุยรู้เรื่อง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP9.W1.code,
                            advise: RESULT.GROUP9.W1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'รู้สึกไม่สบายอย่างมาก แต่ไม่เฉพาะเจาะจง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP9.Y3.code,
                            advise: RESULT.GROUP9.Y3.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'ภาวะฉุกเฉินเหตุสิ่งแวดล้อม',
        description: 'ภาวะฉุกเฉินเหตุสิ่งแวดล้อม',
        module: 10,
        image: 'assets/imgs/erupting-volcano.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'พิจารณาไม่ใช้เนื่องจากซ้ำซ้อนกับกลุ่มอาการที่ 17',
                from: 0,
                choices: [
                    {
                        type: TYPE.MODULE,
                        name: 'ใช้กลุ่มอาการที่ 17',
                        module: 17,
                    },
                ]
            },
        ],
    },
    {
        name: 'ปวดศีรษะ',
        description: 'ภาวะผิดปกติทางตา/หู/คอ/จมูก',
        module: 12,
        image: 'assets/imgs/headache.png',
        color: '#FF85A7',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP12.Y9.code,
                            advise: RESULT.GROUP12.Y9.advise,
                        }
                    },
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่รู้สึกตัวเพิ่มขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP12.R1.code,
                            advise: RESULT.GROUP12.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่สั้นๆ / พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP12.R2.code,
                            advise: RESULT.GROUP12.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP12.R2.code,
                            advise: RESULT.GROUP12.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP12.R2.code,
                            advise: RESULT.GROUP12.R2.advise,
                        }
                    },

                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP12.R2.code,
                            advise: RESULT.GROUP12.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP12.R2.code,
                            advise: RESULT.GROUP12.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP12.R2.code,
                            advise: RESULT.GROUP12.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP12.R2.code,
                            advise: RESULT.GROUP12.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP12.R2.code,
                            advise: RESULT.GROUP12.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP12.Y8.code,
                            advise: RESULT.GROUP12.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP12.R3.code,
                    advise: RESULT.GROUP12.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        from: 5,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 5,
                        name: 'ซีดและผิวซีดเย็ด',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 5,
                        name: 'เป็นลมหรือเกือบเป็นลม',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 6,
                to: 7,
                criteria: {
                    minimumChecked: 1,
                    to: 7,
                    payload: {
                        level: LEVEL.R.text,
                        color: LEVEL.R.color,
                        code: RESULT.GROUP12.R5.code,
                        advise: RESULT.GROUP12.R5.advise,
                    }
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        from: 6,
                        name: 'พูดเสียงพร่า',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 6,
                        name: 'เห็นภาพมัว/ภาพซ่อน',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 6,
                        name: 'อ่อนแรง/อัมพาต',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 6,
                        name: 'อาเจียน',
                        checked: false,
                    },
                ]
            },
            {
                question: 'ผู้ป่วยเพิ่งได้รับบาดเจ็บมาหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP12.G1.code,
                            advise: RESULT.GROUP12.G1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 8
                    },
                ]
            },
            {
                question: 'ผู้ป่วยเวียนศรีษะหรือทรงตัวผิดปกติหรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP12.Y5.code,
                            advise: RESULT.GROUP12.Y5.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 9
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมองเห็นภาพผิดไปจากปกติหรือไม่',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP12.Y4.code,
                            advise: RESULT.GROUP12.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 10
                    },
                ]
            },
            {
                question: 'กรณีปวดศรีษะ ผู้ป่วยเคยได้รับการวินิจฉัยว่าเป็นไมเกรนใช่หรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP12.W2.code,
                            advise: RESULT.GROUP12.W2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP12.W1.code,
                            advise: RESULT.GROUP12.W1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'เจ็บปวดบริเวณอื่น',
                        to: 11
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการเจ็บปวดที่ใด',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ศึรษะ / ใบหน้า / คอ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP12.W3.code,
                            advise: RESULT.GROUP12.W3.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตา / หู / จมูก / ปาก / ฟัน / คอหอย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP12.W4.code,
                            advise: RESULT.GROUP12.W4.advise,
                        }
                    },
                ]
            },

        ]
    },
    {
        name: 'ได้รับสารพิษ',
        description: 'ยาเกินขนาด',
        module: 14,
        image: 'assets/imgs/poison.png',
        color: '#FF85A7',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP14.Y9.code,
                            advise: RESULT.GROUP14.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R1.code,
                            advise: RESULT.GROUP14.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ / พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไห ปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                            color: LEVEL.R.color,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                            color: LEVEL.R.color,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },

                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            code: RESULT.GROUP14.Y8.code,
                            advise: RESULT.GROUP14.Y8.advise,
                            color: LEVEL.Y.color,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP14.R3.code,
                    advise: RESULT.GROUP14.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        from: 5,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 5,
                        name: 'ซีดและผิวซีดเย็ด',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 5,
                        name: 'เป็นลมหรือเกือบเป็นลม',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการชักหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ชัก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R6.code,
                            advise: RESULT.GROUP14.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 7
                    },
                ]
            },
            {
                question: 'เจ้าหน้าที่ร้องขอการเตรียมพร้อมเนื่องจากผู้ป่วยมีภาวะคุกคาม อันจะเป็นอัตรายต่อตนเองและผู้อื่นหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,

                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R7.code,
                            advise: RESULT.GROUP14.R7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 8
                    },
                ]
            },
            {
                question: 'ผู้ป่วยได้รับ/สารอะไรเข้าสู่ร่างกาย',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยา',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP14.G4.code,
                            advise: RESULT.GROUP14.G4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'สารเคมีที่ใช้ในการเกษตร',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R9.code,
                            advise: RESULT.GROUP14.R9.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'สารกัดกร่อน / สารเคมีอื่น (ที่ไม่ใช่อาหารยา)',
                        to: 9,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'สารเสพติด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP14.G3.code,
                            advise: RESULT.GROUP14.G3.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'สารป้องกันตัว เช่น แก๊สน้ำตา สเปรย์พริกไทย',
                        to: 11,
                    },
                ]
            },
            {
                question: 'ผู้ป่วยกลืน น้ำลาย น้ำ และอากหาร ลำบากหรือไม่่',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'กลืนลำบาก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R9.code,
                            advise: RESULT.GROUP14.R9.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'กลืนได้ปกติ',
                        to: 10
                    },
                ]
            },
            {
                question: 'มีอาการผิดปกติอื่นเช่น เจ็บคอ ปวดท้อง ปวดศรีษะ คัน วิงเวียน',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP14.Y4.code,
                            advise: RESULT.GROUP14.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP14.G5.code,
                            advise: RESULT.GROUP14.G5.advise,
                        }
                    },
                ]
            },
            {
                question: 'มีอาการผิดปกติหรือไม่ เช่น ปวดท้อง ปวดศรีษะ คัน วิงเวียน',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            code: RESULT.GROUP14.G8.code,
                            advise: RESULT.GROUP14.G8.advise,
                            color: LEVEL.G.color,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            code: RESULT.GROUP14.W1.code,
                            advise: RESULT.GROUP14.W1.advise,
                            color: LEVEL.W.color,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'มีครรภ์',
        description: 'คลอด, นรีเวช',
        module: 15,
        image: 'assets/imgs/pregnancy-with-hearts.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP15.Y9.code,
                            advise: RESULT.GROUP15.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R1.code,
                            advise: RESULT.GROUP15.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R2.code,
                            advise: RESULT.GROUP15.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบาน ไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R2.code,
                            advise: RESULT.GROUP15.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R2.code,
                            advise: RESULT.GROUP15.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R2.code,
                            advise: RESULT.GROUP15.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R2.code,
                            advise: RESULT.GROUP15.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R2.code,
                            advise: RESULT.GROUP15.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R2.code,
                            advise: RESULT.GROUP15.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R2.code,
                            advise: RESULT.GROUP15.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP15.Y8.code,
                            advise: RESULT.GROUP15.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP15.R3.code,
                    advise: RESULT.GROUP15.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีครรภ์หรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ใช่',
                        to: 7
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 16
                    },
                ]
            },
            {
                question: 'อายุครรภ์มากกว่า 20 สัปดาห์ (4.5 เดือน) หรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'มากกว่า 20 สัปดาห์',
                        to: 8
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'น้อยกว่า 20 สัปดาห์',
                        to: 14
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการอย่างไร',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ชัก / ปวดศรีษะ / เห็นภาพซ้อน / แน่นหน้าอก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R6.code,
                            advise: RESULT.GROUP15.R6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เลือดออกทางช่องคลอด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R5.code,
                            advise: RESULT.GROUP15.R5.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'เจ็บท้องคลอด',
                        to: 9
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ทารกกำลังคลอดออกมา',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R7.code,
                            advise: RESULT.GROUP15.R7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ได้รับบาดเจ็บช่องท้อง',
                        to: 10
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ถุงน้ำคร่ำแตก (น้ำเดิน)',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R8.code,
                            advise: RESULT.GROUP15.R8.advise,
                        }
                    },
                ]
            },
            {
                question: 'มีน้ำเดิน หรือ มูกเลือดออกทางช่องคลอดหรือไม่',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R8.code,
                            advise: RESULT.GROUP15.R8.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 11
                    },                  
                ]
            },
            {
                question: 'ปวดท้องหรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ปวด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP15.G4.code,
                            advise: RESULT.GROUP15.G4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ปวด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP15.Y4.code,
                            advise: RESULT.GROUP15.Y4.advise,
                        }
                    },
                ]
            },
            {
                question: 'เป็นท้องที่เท่าไหร่',
                from: 11,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ท้องแรก',
                        to: 12
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ท้องที่ 2 ขึ้นไป',
                        to: 13
                    },
                ]
            },
            {
                question: 'ปวดมานานเท่าไหร่แล้ว',
                from: 12,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 24 ชั่วโมง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP15.G6.code,
                            advise: RESULT.GROUP15.G6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 24 ชั่วโมง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP15.Y6.code,
                            advise: RESULT.GROUP15.Y6.advise,
                        }
                    },
                ]
            },
            {
                question: 'อายุครรภ์เท่าไหร่',
                from: 13,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 8 เดือน (37 สัปดาห์)',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP15.Y7.code,
                            advise: RESULT.GROUP15.Y7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เท่ากับหรือมากกว่า 8 เดือน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R8.code,
                            advise: RESULT.GROUP15.R8.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการอย่างไร',
                from: 14,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ปวดท้อง',
                        to: 15
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นตะคริว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP15.W1.code,
                            advise: RESULT.GROUP15.W1.advise,
                        }
                    },
                    {
                        type: TYPE.MODULE,
                        name: 'ชัก',
                        module: 16,
                    },
                ]
            },
            {
                question: 'มีเลือดออกทางช่องคลอดหรือไม่',
                from: 15,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มีเลือดออก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP15.R5.code,
                            advise: RESULT.GROUP15.R5.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มีเลือดออก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP15.G1.code,
                            advise: RESULT.GROUP15.G1.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการอย่างไร',
                from: 16,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ปวดท้อง',
                        to: 17
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นตะคริว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP15.W1.code,
                            advise: RESULT.GROUP15.W1.advise,
                        }
                    },
                    {
                        type: TYPE.MODULE,
                        name: 'ชัก',
                        module: 16,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มีเลือดออกทางช่องท้อง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP15.G2.code,
                            advise: RESULT.GROUP15.G2.advise,
                        }
                    },
                ]
            },
            {
                question: 'มีเลือดออกทางช่องคลอดหรือไม่',
                from: 17,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มีเลือดออก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP15.G1.code,
                            advise: RESULT.GROUP15.G1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มีเลือดออก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP15.W1.code,
                            advise: RESULT.GROUP15.W1.advise,
                        }
                    },
                ]
            },
        ],
    },
    {
        name: 'ชัก',
        description: 'มีสัญญาณบอกเหตุการชัก',
        module: 16,
        image: 'assets/imgs/respiratory-system.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ขณะนี้คนไข้กำลังชัก/กระตุกอยุ่หรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP16.R4.code,
                            advise: RESULT.GROUP16.R4.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่ / หยุดชักแล้ว',
                        to: 1
                    },
                ]
            },
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือยัง',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ยังไม่รู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 3,
                    },                  
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP16.Y9.code,
                            advise: RESULT.GROUP16.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 2,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP16.R1.code,
                            advise: RESULT.GROUP16.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ผู้ป่วยพูดหรือมีเสียงร้องออกมาหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีเสียงออกมา',
                        to: 4,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'มีเสียงออกมา',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยตัวเขียวคล้ำหรือไม่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R3.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R2.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 5,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP16.R2.code,
                            advise: RESULT.GROUP16.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP16.R2.code,
                            advise: RESULT.GROUP16.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP16.R2.code,
                            advise: RESULT.GROUP16.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP16.R2.code,
                            advise: RESULT.GROUP16.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP16.R2.code,
                            advise: RESULT.GROUP16.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 6
                    },                  
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP16.R2.code,
                            advise: RESULT.GROUP16.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 8
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP16.R2.code,
                            advise: RESULT.GROUP16.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 7
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP16.R2.code,
                            advise: RESULT.GROUP16.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP16.Y8.code,
                            advise: RESULT.GROUP16.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 8,
                to: 9,
                criteria: {
                    minimumChecked: 1,
                    to: 9,
                    payload: {
                        level: LEVEL.R.text,
                        color: LEVEL.R.color,
                        code: RESULT.GROUP16.R3.code,
                        advise: RESULT.GROUP16.R3.advise,
                    }
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },
                ]
            },
            {
                question: 'เคยมีประวัติการชักมาก่อนหน้านี้หรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่เคย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP16.Y1.code,
                            advise: RESULT.GROUP16.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เคย',
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP16.Y4.code,
                            advise: RESULT.GROUP16.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มีอาการชัก แต่สัญญาณบอกเหตุการชัก',
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP16.W1.code,
                            advise: RESULT.GROUP16.W1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ทราบ',
                        to: 11
                    },
                ]
            },
            {
                question: 'เคยมีอาการจากภาวะเครียด/ถูกขัดใจ/ตื่นตระหนก/หายใจมากเกิน ในลักษณะเดียวกันนี้มาก่อนบ้างหรือไม่',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เคย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP16.G1.code,
                            advise: RESULT.GROUP16.G1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่เคย',
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP16.Y2.code,
                            advise: RESULT.GROUP16.Y2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ทราบ',
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP16.Y5.code,
                            advise: RESULT.GROUP16.Y5.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'ป่วย, อ่อนเพลีย, อัมพาตเรื้อรัง',
        description: 'ไม่ทราบ, อื่นๆ',
        module: 17,
        image: 'assets/imgs/exhausted-man.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },                  
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP17.Y9.code,
                            advise: RESULT.GROUP17.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP17.R1.code,
                            advise: RESULT.GROUP17.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },                  
                ]
            },
            {
                question: 'ผู้ป่วยพูดหรือมีเสียงร้องออกมาหรือไม่',
                from: 2,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีเสียงออกมา',
                        to: 7
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'มีเสียงออกมา',
                        to: 3
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP17.R2.code,
                            advise: RESULT.GROUP17.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP17.R2.code,
                            advise: RESULT.GROUP17.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP17.R2.code,
                            advise: RESULT.GROUP17.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP17.R2.code,
                            advise: RESULT.GROUP17.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP17.R2.code,
                            advise: RESULT.GROUP17.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 5
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP17.R2.code,
                            advise: RESULT.GROUP17.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 6
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP17.R2.code,
                            advise: RESULT.GROUP17.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 6
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 5,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP17.R2.code,
                            advise: RESULT.GROUP17.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP17.Y8.code,
                            advise: RESULT.GROUP17.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 6,
                to: 8,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP17.R3.code,
                    advise: RESULT.GROUP17.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },

                ]
            },
            {
                question: 'ผู้ป่วยตัวเขียวคล้ำหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R3.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R2.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยร่วมมือทำตามคำสั่งง่ายๆ เช่น ยกแขน แบมือ กำมือ',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ทำไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP17.Y1.code,
                            advise: RESULT.GROUP17.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่อยากทำ',
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP17.Y2.code,
                            advise: RESULT.GROUP17.Y2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ทำได้',
                        to: 9
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีหัวใจเต้นเร็ว / ใจสั่น / เจ็บแน่นทรวงอกหรือไม่',
                from: 9,
                choices: [
                    {
                        type: TYPE.MODULE,
                        name: 'ใช่',
                        module: 7,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่่ใช่',
                        to: 10
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เวียนศรีษะ/การทรงตัวผิดปกติ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP17.G4.code,
                            advise: RESULT.GROUP17.G4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อ่อนแอทั่วร่างกาย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP17.G1.code,
                            advise: RESULT.GROUP17.G1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เจ็บปวดทั่วร่างกาย ไม่มีตำแหน่งจำเพาะเจาะจง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP17.G2.code,
                            advise: RESULT.GROUP17.G2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'องค์กรหรือผู้เฝ้าระวัง ยิืนยันภาะวฉุกเฉินการแพทย์',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP17.G7.code,
                            advise: RESULT.GROUP17.G7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'อื่นๆ ที่เห็นว่าไม่ฉุกเฉิน',
                        to: 11
                    },
                ]
            },
            {
                question: 'กรณีผู้ป่วยไม่มีภาวะฉุกเฉินอื่นร่วมด้วย ผู้ป่วยมีอาการอย่างไร',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยหรือผู้แจ้งยืนยันขอให้ช่วยเหลือ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP17.G6.code,
                            advise: RESULT.GROUP17.G6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่สามารถติดต่อกลับได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP17.G5.code,
                            advise: RESULT.GROUP17.G5.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'คลื่นไส้/อาเจียน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP17.W1.code,
                            advise: RESULT.GROUP17.W1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เจ็บคอหอย/ไอ/คัดจมูก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP17.W1.code,
                            advise: RESULT.GROUP17.W1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ปวดศรีษะ/ปวดเมื่อยตามตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP17.W1.code,
                            advise: RESULT.GROUP17.W1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หนาวสั่น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP17.W1.code,
                            advise: RESULT.GROUP17.W1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ความดันเลือดสูง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP17.W2.code,
                            advise: RESULT.GROUP17.W2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มีไข้/อุณหภูมิกายสูง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP17.W3.code,
                            advise: RESULT.GROUP17.W3.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อื่นๆ ที่เห็นว่าไม่ฉุกเฉิน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP17.W4.code,
                            advise: RESULT.GROUP17.W4.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'อัมพาต',
        description: 'กล้ามเนื้ออ่อนแรง, สูญเสียการรับความรู้สึก, ยืนหรือเดินไม่ได้',
        module: 18,
        image: 'assets/imgs/patient.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ก่อนเกิดอาการนี้ผู้ป่วยเป็นอัมพาตอยู่เดิมหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.MODULE,
                        name: 'ใช่',
                        module: 17,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 1,
                    },
                ]
            },

            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 3,
                    },                 
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP18.Y9.code,
                            advise: RESULT.GROUP18.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP18.R1.code,
                            advise: RESULT.GROUP18.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 3
                    },                 
                ]
            },
            {
                question: 'ผู้ป่วยพูดหรือมีเสียงร้องออกมาหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีเสียงออกมา',
                        to: 8
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'มีเสียงออกมา',
                        to: 4
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP18.R2.code,
                            advise: RESULT.GROUP18.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจเร็ว ซี่โครงบาน จมูกบาน ไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP18.R2.code,
                            advise: RESULT.GROUP18.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP18.R2.code,
                            advise: RESULT.GROUP18.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP18.R2.code,
                            advise: RESULT.GROUP18.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP18.R2.code,
                            advise: RESULT.GROUP18.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 6
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP18.R2.code,
                            advise: RESULT.GROUP18.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 7
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 5,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP18.R2.code,
                            advise: RESULT.GROUP18.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 7
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP18.R2.code,
                            advise: RESULT.GROUP18.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP18.Y8.code,
                            advise: RESULT.GROUP18.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 7,
                to: 9,
                criteria: {
                    minimumChecked: 1,
                    to: 9,
                    payload: {
                        level: LEVEL.R.text,
                        color: LEVEL.R.color,
                        code: RESULT.GROUP18.R3.code,
                        advise: RESULT.GROUP18.R3.advise,
                    }
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },

                ]
            },
            {
                question: 'ผู้ป่วยตัวเขียวคล้ำหรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R3.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R2.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยร่วมมือทำตามคำสั่งง่ายๆ เช่น ยกแขน, แบมือ, กำมือ',
                from: 9,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ทำไม่ได้',
                        to: 10
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่อยากทำ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP18.Y3.code,
                            advise: RESULT.GROUP18.Y3.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ทำได้',
                        to: 11
                    },
                ]
            },
            {
                question: 'มีอาการมานานเท่าไหร่',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 3 ชั่วมง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP18.R6.code,
                            advise: RESULT.GROUP18.R6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่าหรือเท่ากับ 3 ชั่วโมง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP18.Y6.code,
                            advise: RESULT.GROUP18.Y6.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยเป็นเบาหวาน/ความดันหรือไม่',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP18.G1.code,
                            advise: RESULT.GROUP18.G1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 12
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการเกร็งกระตุกร่วมด้วยหรือไม่',
                from: 12,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP18.R7.code,
                            advise: RESULT.GROUP18.R7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 13
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุมากกว่า 45 ปีหรือไม่',
                from: 13,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 45 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP18.R8.code,
                            advise: RESULT.GROUP18.R8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 45 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP18.Y7.code,
                            advise: RESULT.GROUP18.Y7.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีประวัติบาดเจ็บที่ศรีษะมาก่อนหรือไม่ (ภายใน 3 วัน)',
                from: 14,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP18.W1.code,
                            advise: RESULT.GROUP18.W1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP18.W1.code,
                            advise: RESULT.GROUP18.W1.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'ไม่รู้สติ',
        description: 'ไม่ตอบสนอง, หมดสติชั่ววูบ',
        module: 19,
        image: 'assets/imgs/knock-down.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },               
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP19.Y9.code,
                            advise: RESULT.GROUP19.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP19.R1.code,
                            advise: RESULT.GROUP19.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },       
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้แจ้งไม่สามารถเข้าไปปลุก/เรียกผู้ป่วยได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP19.Y1.code,
                            advise: RESULT.GROUP19.Y1.advise,
                        }
                    }           
                ]
            },
            {
                question: 'ผู้ป่วยพูดหรือมีเสียงร้องออกมาหรือไม่',
                from: 2,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีเสียงออกมา',
                        to: 7
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'มีเสียงออกมา',
                        to: 3
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP19.R2.code,
                            advise: RESULT.GROUP19.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบาน ไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP19.R2.code,
                            advise: RESULT.GROUP19.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP19.R2.code,
                            advise: RESULT.GROUP19.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP19.R2.code,
                            advise: RESULT.GROUP19.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP19.R2.code,
                            advise: RESULT.GROUP19.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 5
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP19.R2.code,
                            advise: RESULT.GROUP19.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 6
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP19.R2.code,
                            advise: RESULT.GROUP19.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 6
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 5,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP19.R2.code,
                            advise: RESULT.GROUP19.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP19.Y8.code,
                            advise: RESULT.GROUP19.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 6,
                to: 8,
                criteria: {
                    minimumChecked: 1,
                    to: 8,
                    payload: {
                        level: LEVEL.R.text,
                        color: LEVEL.R.color,
                        code: RESULT.GROUP19.R3.code,
                        advise: RESULT.GROUP19.R3.advise,
                    }
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },

                ]
            },
            {
                question: 'ผู้ป่วยตัวเขียวคล้ำหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R3.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R2.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยร่วมมือทำตามคำสั่งง่ายๆ เช่น ยกแขน แบมือ กำมือ',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ทำไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP19.Y5.code,
                            advise: RESULT.GROUP19.Y5.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่อยากทำ',
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP19.Y6.code,
                            advise: RESULT.GROUP19.Y6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ทำได้',
                        to: 9
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการเกร็งกระตุกหรือไม่',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP19.R6.code,
                            advise: RESULT.GROUP19.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 10
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีเป็นเบาหวานหรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP19.R9.code,
                            advise: RESULT.GROUP19.R9.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 11
                    },
                ]
            },
            {
                question: 'มีอาการเจ็บแน่นทรวงอก/ใจสั่นหรือไม่',
                from: 11,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'มี',
                        to: 12,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 13,
                    },

                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไร',
                from: 12,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 40 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP19.R7.code,
                            advise: RESULT.GROUP19.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 40 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP19.Y7.code,
                            advise: RESULT.GROUP19.Y7.advise,
                        }
                    },
                ]
            },
            {
                question: 'มีโรคกล้ามเนื้อหัวใจขาดเลือดอยู่เดิม',
                from: 13,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP19.R8.code,
                            advise: RESULT.GROUP19.R8.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 14,
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการหมดสติชั่ววูบเป็นครั้งแรกในวันนี้ใช่หรือไม่',
                from: 13,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เป็น 2 ครั้งขึ้นไป',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP19.Y4.code,
                            advise: RESULT.GROUP19.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นครั้งแรก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP19.G5.code,
                            advise: RESULT.GROUP19.G5.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หน้ามืดแต่ไม่หมดสติ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP19.W1.code,
                            advise: RESULT.GROUP19.W1.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีประวัติบาดเจ็บที่ศรีษะมาก่อนหรือไม่ (ภายใน 3 วัน)',
                from: 14,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP19.G3.code,
                            advise: RESULT.GROUP19.G3.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นครั้งแรก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP19.W2.code,
                            advise: RESULT.GROUP19.W2.advise,
                        }
                    },

                ]
            },
        ]
    },
    {
        name: 'เด็ก',
        description: 'กุมารเวช',
        module: 20,
        image: 'assets/imgs/crying-baby.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'เด็กรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 24,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },               
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของเด็กไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP20.Y9.code,
                            advise: RESULT.GROUP20.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก เด็กรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP20.R1.code,
                            advise: RESULT.GROUP20.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },                
                ]
            },
            {
                question: 'เด็กพูดหรือมีเสียงร้องออกมาหรือไม่',
                from: 2,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีเสียงออกมา',
                        to: 6
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'มีเสียงออกมา',
                        to: 3
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจเร็วดูเหนื่อย / ต้องผงกศรีษะช่วยให้หายใจได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP20.R2.code,
                            advise: RESULT.GROUP20.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด (เด็กอายุมากกว่า 6 ปี)',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP20.R2.code,
                            advise: RESULT.GROUP20.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 4,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจแล้วหน้าอกบุ๋ม',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP20.R2.code,
                            advise: RESULT.GROUP20.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP20.R2.code,
                            advise: RESULT.GROUP20.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'กระสับกระส่าย ต้องผุดลุกผุดนั่ง / น้องนั่งโน้มตัวไปข้างหน้า ใช้มือยันเพื่อช่วยให้หายใจได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP20.R2.code,
                            advise: RESULT.GROUP20.R2.advise,
                        }
                    },
                ]
            },
            {
                question: 'เด็กมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 4,
                to: 5,
                criteria: {
                    minimumChecked: 1,
                    to: 5,
                    payload: {
                        level: LEVEL.R.text,
                        color: LEVEL.R.color,
                        code: RESULT.GROUP20.R3.code,
                        advise: RESULT.GROUP20.R3.advise,
                    }
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ริมผีปากเขียวคล้ำ',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวลายจ้ำๆ/ผิวลายเป็นดวงๆ',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวเย็นซีด',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลม/เกือบเป็นลมเมื่อนั่งหรือยืน',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวอ่อนปวกเปียก',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'กระหม่อมบุ๋ม / ตาโหล / ปากแห้ง / ปัสสาวะน้อย',
                        checked: false,

                    },

                ]
            },
            {
                question: 'เด็กมีอาการผิดปกต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 8,
                criteria: {
                    minimumChecked: 2,
                    to: 8,
                    payload: {
                        level: LEVEL.R.text,
                        color: LEVEL.R.color,
                        code: RESULT.GROUP20.R4.code,
                        advise: RESULT.GROUP20.R4.advise,
                    }
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เซื่องซึม / เงื่องหงอย',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เงียบผิดปกติ',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มีน้ำลายยิดร่วมกับอาการกลืนลำบาก',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยตัวหรือปากเขียวคล้ำหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R3.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R2.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                ]
            },
            {
                question: 'อาการบาดเจ็บมีสาเหตุจากการบาดเจ็บหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.MODULE,
                        name: 'มี / สงสัยอาจมี / ไม่แน่ใจ',
                        module: 21,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีสาเหตุจากการบาดเจ็บ',
                        to: 1
                    },
                ]
            },
            {
                question: 'เด็กมีไข้หรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'มี',
                        to: 9
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 14
                    },
                ]
            },
            {
                question: 'มีเลือดออกโดยไม่ได้รับบาดเจ็บ เช่น มีจุดเลือดออก เลือดกำเดา อาเจียนเป็นเลือด ถ่ายเป็นเลือด',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP20.Y5.code,
                            advise: RESULT.GROUP20.Y5.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 10
                    },
                ]
            },
            {
                question: 'มีอาการมาแล้วกี่วัน',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: '4 - 7 วัน',
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP20.G2.code,
                            advise: RESULT.GROUP20.G2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'น้อยกว่า 4 วัน หรือ มากกว่า 7 วัน',
                        to: 13,
                    },
                ]
            },
            {
                question: 'เด็กกรีดร้องกวนผิดปกติหรือไม่',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP20.G1.code,
                            advise: RESULT.GROUP20.G1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 12
                    },
                ]
            },
            {
                question: 'พ่อแม่หรือคนเลี้ยงสามารถกล่อมแล้วหยุดร้องได้หรือไม่',
                from: 12,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'กล่อมให้หยุดร้องไม่ได้',
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP20.G1.code,
                            advise: RESULT.GROUP20.G1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'กล่อมแล้วเงียบได้',
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP20.W5.code,
                            advise: RESULT.GROUP20.W5.advise,
                        }
                    },
                ]
            },
            {
                question: 'เด็กอายุเท่าไหร่',
                from: 13,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อายุน้อยกว่า 3 เดือน',
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP20.W6.code,
                            advise: RESULT.GROUP20.W6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'อายุมากกว่า 3 เดือน',
                        to: 23,
                    },                    
                ]
            },
            {
                question: 'เด็กกินสารพิษ / ยาเกินขนาด/ ยาของคนอื่นหรือเปล่า',
                from: 14,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'กิน',
                        to: 15
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่กิน',
                        to: 20,
                    },
                ]
            },
            {
                question: 'กินยา / สารพิษมานานเท่าไหร่',
                from: 15,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'น้อยกว่า 30 นาที',
                        to: 16
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 30 นาที',
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP20.Y7.code,
                            advise: RESULT.GROUP20.Y7.advise,
                        }
                    },
                ]
            },
            {
                question: 'มีคนเห็นและยินยันได้ชัดเจนว่าเด็กกินยา / สารพิษหรือไม่',
                from: 16,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'มีคนเห็น',
                        to: 17
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีคนเห็น',
                        to: 19,
                    },
                ]
            },
            {
                question: 'สิ่งที่กินเป็นอะไร',
                from: 17,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยา',
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP20.R8.code,
                            advise: RESULT.GROUP20.R8.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'สารกัดกร่อน',
                        to: 18,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้ำมันที่ไม่ใช้อาหาร เช่น น้ำมันก๊าด น้ำมันสน',
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP20.R8.code,
                            advise: RESULT.GROUP20.R8.advise,
                        }
                    },
                ]
            },
            {
                question: 'มีอาการกลืนลำบากหรือเปล่า',
                from: 18,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP20.R7.code,
                            advise: RESULT.GROUP20.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP20.Y7.code,
                            advise: RESULT.GROUP20.Y7.advise,
                        }
                    },
                ]
            },
            {
                question: 'สิ่งที่คาดว่ากินเข้าไปเป็นอะไร',
                from: 19,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยา',
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP20.Y7.code,
                            advise: RESULT.GROUP20.Y7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'สารกัดกร่อน',
                        to: 18,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้ำมันที่ไม่ใช้อาหาร เช่น น้ำมันก๊าด น้ำมันสน',
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP20.Y7.code,
                            advise: RESULT.GROUP20.Y7.advise,
                        }
                    },
                ]
            },
            {
                question: 'เด็กมีอาการชักหรือไม่',
                from: 20,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'กำลังชัก',
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP20.R6.code,
                            advise: RESULT.GROUP20.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ใช่หยุดชักแล้ว',
                        to: 21
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 22,
                    },
                ]
            },
            {
                question: 'ชักมาแล้วกี่ครั้ง',
                from: 21,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'หลายครั้ง (มากกว่า 3 ครั้งต่อชั่วโมง)',
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP20.R6.code,
                            advise: RESULT.GROUP20.R6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 3 ครั้ง ต่อชั่วโมง',
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP20.Y6.code,
                            advise: RESULT.GROUP20.Y6.advise,
                        }
                    },
                ]
            },
            {
                question: 'เด็กมีอาการอื่นอย่างไรบ้าง',
                from: 22,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มีผื่นตามตัว',
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP20.W1.code,
                            advise: RESULT.GROUP20.W1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ปวดหู / ปวดฟัน',
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP20.W2.code,
                            advise: RESULT.GROUP20.W2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อาการไม่จำเพาะอื่นๆ',
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP20.W4.code,
                            advise: RESULT.GROUP20.W4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เด็กมีความผิดปกติแต่กำเนิด/พิการ และต้องการความช่วยเหลือ',
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP20.G3.code,
                            advise: RESULT.GROUP20.G3.advise,
                        }
                    },
                ]
            },
            {
                question: 'อาเจียนหรือถ่ายเหลวมากกว่า 10 ครั้งใน 1 วันหรือไม่',
                from: 23,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP20.Y1.code,
                            advise: RESULT.GROUP20.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 11
                    },
                ]
            },
            {
                question: 'อาการหมดสติมีสาเหตุจากการบาดเจ็บหรือไม่',
                from: 24,
                choices: [
                    {
                        type: TYPE.MODULE,
                        name: 'มี / สงสัยอาจมี / ไม่แน่ใจ',
                        module : 21,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ได้มีสาเหตุจากการบาดเจ็บ',
                        to: 1,
                    },
                ]
            },
        ]
    },
    {
        name: 'ถูกทำร้าย',
        description: 'ถูกทำร้าย',
        module: 21,
        image: 'assets/imgs/bear-attacking.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ตำรวจอยู่ในที่เกิดเหตุหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีตำรวจ',
                        to: 1,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'มีตำรวจอยู่ในที่เกิดเหตุแล้ว (คาดว่าปลอดภัย)',
                        to: 1,
                    },
                ]
            },
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 3,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'กำลังชัก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R6.code,
                            advise: RESULT.GROUP21.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP21.Y9.code,
                            advise: RESULT.GROUP21.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'อย่าขยับผู้ป่วย (โดยเฉพาะส่วนศรีษะและคอ) แล้วเรียกผู้ป่วยดังๆ ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 2,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R1.code,
                            advise: RESULT.GROUP21.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R2.code,
                            advise: RESULT.GROUP21.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R2.code,
                            advise: RESULT.GROUP21.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R2.code,
                            advise: RESULT.GROUP21.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R2.code,
                            advise: RESULT.GROUP21.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R2.code,
                            advise: RESULT.GROUP21.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R2.code,
                            advise: RESULT.GROUP21.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 4,
                to: 5,
                criteria: {
                    minimumChecked: 2,
                    to: 5,
                    payload: {
                        level: LEVEL.R.text,
                        color: LEVEL.R.color,
                        code: RESULT.GROUP21.R3.code,
                        advise: RESULT.GROUP21.R3.advise,
                    }
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยชักหลังการบาดเจ็บหรือไม่',
                from: 5,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ชัก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R3.code,
                            advise: RESULT.GROUP21.R3.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ชัก',
                        to: 6
                    },
                ]
            },
            {
                question: 'ขณะนี้ผู้ป่วยยังมีเลือดออกอยู่หรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'เลือดยังไหลอยู่',
                        to: 7
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีเลือดออก/หยุดแล้ว',
                        to: 8
                    },
                ]
            },
            {
                question: 'ให้ใช้ผ้าสะอาดหนาๆ กดบนแผลแน่นๆ ค้างไว้ แล้วมีเลือดชุ่มขึ้นมาหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R5.code,
                            advise: RESULT.GROUP21.R5.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 8
                    },
                ]
            },
            {
                question: 'ผู้ป่วยถูกทำร้ายด้วยอะไร',
                from: 8,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ถูกแทง',
                        to: 9,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ถูกยิง',
                        to: 9,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'อื่นๆ',
                        to: 10,
                    },
                ]
            },
            {
                question: 'แผลดังกล่าวที่ส่วนใดของร่างกายบ้าง',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ศรีษะหรือคอ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R8.code,
                            advise: RESULT.GROUP21.R8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ทรวงอก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R8.code,
                            advise: RESULT.GROUP21.R8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ช่องท้อง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R8.code,
                            advise: RESULT.GROUP21.R8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'แขนหรือขา',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP21.Y1.code,
                            advise: RESULT.GROUP21.Y1.advise,
                        }
                    },
                ]
            },
            {
                question: 'มีกระดูกหักหรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP21.W1.code,
                            advise: RESULT.GROUP21.W1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'มี',
                        to: 11
                    },
                ]
            },
            {
                question: 'กระดูกหักตำแหน่งใดบ้าง',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ต้นคอ / หลัง / กระดูกเชิงกราน / ต้นขา / ต้นแขน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP21.R7.code,
                            advise: RESULT.GROUP21.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อื่นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP21.G1.code,
                            advise: RESULT.GROUP21.G1.advise,
                        }
                    },
                ]
            },
        ],
    },
    {
        name: 'ไฟไหม้',
        description: 'ลวกเหตุความร้อน, สารเคมี, ไฟฟ้าช๊อต',
        module: 22,
        image: 'assets/imgs/house-on-fire.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP22.Y9.code,
                            advise: RESULT.GROUP22.Y9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'กำลังชัก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R6.code,
                            advise: RESULT.GROUP22.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },

                ]
            },
            {
                question: 'อย่าขยับตัวผู้ป่วย (โดยเฉพาะส่วนศรีษะและคอ) แล้วเรียกผู้ป่วยด้วยเสียงดังๆ ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R1.code,
                            advise: RESULT.GROUP22.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่สั้นๆ / พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R2.code,
                            advise: RESULT.GROUP22.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจเร็ว ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R2.code,
                            advise: RESULT.GROUP22.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R2.code,
                            advise: RESULT.GROUP22.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R2.code,
                            advise: RESULT.GROUP22.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R2.code,
                            advise: RESULT.GROUP22.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R2.code,
                            advise: RESULT.GROUP22.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 3
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 3,
                to: 4,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP22.R3.code,
                    advise: RESULT.GROUP22.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        from: 3,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 3,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยิืน',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 3,
                        name: 'ซีดและผิวซีดเย็ด',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยชักหลังการบาดเจ็บหรือไม่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ชัก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R6.code,
                            advise: RESULT.GROUP22.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ชัก',
                        to: 5
                    },
                ]
            },
            {
                question: 'ขณะนี้ผู้ป่วยยังมีเลือดออกอยู่หรือไม่',
                from: 5,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'เลือดยังไหลอยู่',
                        to: 6
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีเลือดออก/เลือดหยุดแล้ว',
                        to: 7

                    },
                ]
            },
            {
                question: 'ให้ใช้ผ้าสะอาดหนาๆ กดบนแผนแน่นๆ ค้างไว้ แล้วมีเลือดชุ่มขึ้นมาหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R5.code,
                            advise: RESULT.GROUP22.R5.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 7
                    },
                ]
            },
            {
                question: 'ผู้ป่วยถูกไหม้/ลวก/กัดกร่อนด้วยสิ่งใด',
                from: 7,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไฟ/ของร้อน',
                        to: 8
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'สารเคมี',
                        to: 12
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไฟฟ้าช๊อต',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R9.code,
                            advise: RESULT.GROUP22.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ถูกสารป้องกันตัว เช่น แก็สน้ำตา สเปรย์พริกไทย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP22.G8.code,
                            advise: RESULT.GROUP22.G8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ถูกไม้ขีดไฟ / บุหรี่จี้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP22.W1.code,
                            advise: RESULT.GROUP22.W1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ร้อยไหม้จากของเย็นจัด เช่น น้ำแข็งแห้ง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP22.W2.code,
                            advise: RESULT.GROUP22.W2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'แสบร้อนจากถูกแดด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP22.W3.code,
                            advise: RESULT.GROUP22.W3.advise,
                        }
                    },

                ]
            },
            {
                question: '่ผู้ป่วยเป็นเด็ก/ผู้ใหญ่',
                from: 8,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ทารก (อายุน้อยกว่า 1 ปี)',
                        to: 9
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'เด็ก (อายุ 1-15 ปี)',
                        to: 10
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ผู้ใหญ่ (อายุมากกว่า 15 ปี)',
                        to: 11
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีรอยไหม้ / ลวก บริเวณใดบ้าง (คิดเป็นกี่ % ของร่างกาย)',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ศรีษะ และ คอ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R8.code,
                            advise: RESULT.GROUP22.R8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 10%',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R8.code,
                            advise: RESULT.GROUP22.R8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่าหรือเท่ากับ 5%',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP22.Y6.code,
                            advise: RESULT.GROUP22.Y6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 5%',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP22.G6.code,
                            advise: RESULT.GROUP22.G6.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีรอยไหม้ / ลวก บริเวณใดบ้าง (คิดเป็นกี่ % ของร่างกาย)',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ศรีษะ และ คอ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R8.code,
                            advise: RESULT.GROUP22.R8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 10%',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R8.code,
                            advise: RESULT.GROUP22.R8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่าหรือเท่ากับ 5%',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP22.Y6.code,
                            advise: RESULT.GROUP22.Y6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 5%',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP22.G6.code,
                            advise: RESULT.GROUP22.G6.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีรอยไหม้ / ลวก บริเวณใดบ้าง (คิดเป็นกี่ % ของร่างกาย)',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ศรีษะ และ คอ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R8.code,
                            advise: RESULT.GROUP22.R8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20%',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R8.code,
                            advise: RESULT.GROUP22.R8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่าหรือเท่ากับ 10%',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP22.Y6.code,
                            advise: RESULT.GROUP22.Y6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 10%',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP22.G6.code,
                            advise: RESULT.GROUP22.G6.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยสัมผัสสารเคมีจากภายนอก หรือ การกิน',
                from: 12,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'สัมผัสภายนอก',
                        to: 13
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'กิน / หายใจเข้าไป',
                        to: 14
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีรอยไหม้ / ลวก บริเวณใดบ้าง',
                from: 13,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ศรีษะ และ คอ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R7.code,
                            advise: RESULT.GROUP22.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อื่นๆ ที่ไม่ใช่ ศรีษะและคอ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP22.G7.code,
                            advise: RESULT.GROUP22.G7.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยกลืน (น้ำลาย น้ำ อาหาร) ลำบากหรือไม่',
                from: 14,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'กลืนลำบาก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R7.code,
                            advise: RESULT.GROUP22.R7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'กลืนได้ปกติ',
                        to: 15
                    },
                ]
            },
            {
                question: 'มีอาการผิดปกติอื่นหรือไม่ เช่น เจ็บคอ ปวดท้อง ปวดศรีษะ คัน วิงเวียน',
                from: 15,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP22.Y4.code,
                            advise: RESULT.GROUP22.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP22.G5.code,
                            advise: RESULT.GROUP22.G5.advise,
                        }
                    },
                ]
            },

        ]
    },
    {
        name: 'ตกน้ำ จมน้ำ',
        description: 'หน้ำคว่าจมน้ำ , บาดเจ็บเหตุดำน้ำม, บาดเจ็บทางน้ำ',
        module: 23,
        image: 'assets/imgs/man-drowing.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP23.Y9.code,
                            advise: RESULT.GROUP23.Y9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'กำลังชัก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP23.R6.code,
                            advise: RESULT.GROUP23.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },

                ]
            },
            {
                question: 'อย่าขยับตัวผู้ป่วย (โดยเฉพาะส่วนศรีษะและคอ) แล้วเรียกผู้ป่วยด้วยเสียงดังๆ ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP23.R1.code,
                            advise: RESULT.GROUP23.R1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่สั้นๆ / พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP23.R2.code,
                            advise: RESULT.GROUP23.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจเร็ว ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP23.R2.code,
                            advise: RESULT.GROUP23.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP23.R2.code,
                            advise: RESULT.GROUP23.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP23.R2.code,
                            advise: RESULT.GROUP23.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP23.R2.code,
                            advise: RESULT.GROUP23.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP23.R2.code,
                            advise: RESULT.GROUP23.R2.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 3,
                to: 4,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP23.R3.code,
                    advise: RESULT.GROUP23.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        from: 3,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 3,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยิืน',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 3,
                        name: 'ซีดและผิวซีดเย็ด',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยชักหลังจากจมน้ำหรือไม่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ชัก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP23.R3.code,
                            advise: RESULT.GROUP23.R3.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ชัก',
                        to: 5
                    },
                ]
            },
            {
                question: 'มีตำแหน่งบาดแผลส่วนใดของร่างกาย',
                from: 5,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ศรีษะ / คอ / ทรวงอก / ช่องท้อง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP23.R5.code,
                            advise: RESULT.GROUP23.R5.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ที่อื่นๆ',
                        to: 10
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีบาดแผล',
                        to: 11
                    },
                ]
            },
            {
                question: 'ขณะนี้ผู้ป่วยยังมีเลือดออกอยู่หรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'เลือดยังไหลอยู่',
                        to: 7
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีเลือดออก/เลือดหยุดแล้ว',
                        to: 8

                    },
                ]
            },
            {
                question: 'ให้ใช้ผ้าสะอาดหนาๆ กดบนแผนแน่นๆ ค้างไว้ แล้วมีเลือดชุ่มขึ้นมาหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP23.R5.code,
                            advise: RESULT.GROUP23.R5.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 8
                    },
                ]
            },
            {
                question: 'เป็นอุบัติเหตุจากการดำน้ำหรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP23.Y7.code,
                            advise: RESULT.GROUP23.Y7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 9
                    },
                ]
            },
            {
                question: 'ผู้ป่วยไอ/สำลักน้ำหรือไม่',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP23.Y3.code,
                            advise: RESULT.GROUP23.Y3.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP23.G3.code,
                            advise: RESULT.GROUP23.G3.advise,
                        }
                    },
                ]
            },
            {
                question: 'ปวดคอหรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ปวด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP23.Y5.code,
                            advise: RESULT.GROUP23.Y5.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ปวด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP23.G5.code,
                            advise: RESULT.GROUP23.G5.advise,
                        }
                    },
                ]
            },
            {
                question: 'มีกระดูกหักหรือไม่',
                from: 11,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'มี',
                        to: 12
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP23.W1.code,
                            advise: RESULT.GROUP23.W1.advise,
                        }
                    },

                ]
            },
            {
                question: 'กระดูกหักตำแหน่งใด',
                from: 12,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ต้นคอ / หลัง / กระดูกเชิงกราน / ต้นขา / ต้นแขน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP23.R9.code,
                            advise: RESULT.GROUP23.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อื่นๆ ที่เหลือ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP23.G4.code,
                            advise: RESULT.GROUP23.G4.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'ผลัดหกล้ม',
        description: 'อุบัติเหตุ , เจ็บปวด',
        module: 24,
        image: 'assets/imgs/man-pushing-child.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 17
                    },

                    {
                        type: TYPE.RESULT,
                        name: 'กำลังชัก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP24.R6.code,
                            advise: RESULT.GROUP24.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 1,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP24.Y9.code,
                            advise: RESULT.GROUP24.Y9.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยชักหลังการบาดเจ็บหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ชัก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP24.R6.code,
                            advise: RESULT.GROUP24.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ชัก',
                        to: 2
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอวัยวะ(แขน/ขา/ส่วนอื่น) ขาด/ติดคาที่ หรือไม่',
                from: 2,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ใช่',
                        to: 3
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 4
                    },
                ]
            },
            {
                question: 'สามารถเคลื่อนย้ายผู้ป่วยพร้อมวัตถุได้หรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เคลื่อนย้ายไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP24.R7.code,
                            advise: RESULT.GROUP24.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เคลื่อนย้ายได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP24.Y7.code,
                            advise: RESULT.GROUP24.Y7.advise,
                        }
                    },
                ]
            },
            {
                question: 'ตกจากที่สูงเกินกว่า 5 เมตรหรือไม่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP24.R8.code,
                            advise: RESULT.GROUP24.R8.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยหมดสติชั่ววูบหรือไม่',
                from: 5,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP24.Y1.code,
                            advise: RESULT.GROUP24.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 6
                    },
                ]
            },
            {
                question: 'มีกระดูกหักหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'มี',
                        to: 16
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP24.W1.code,
                            advise: RESULT.GROUP24.W1.advise,
                        }
                    },
                ]
            },
            {
                question: 'ก่อนเกิดอุบุติเหตุมีอาการต่อไปนี้บ้างหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เจ็บแน่นทรวงอก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP24.Y3.code,
                            advise: RESULT.GROUP24.Y3.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'วิงเวียนศรีษะ/ปวดหัว/มึนงง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP24.Y3.code,
                            advise: RESULT.GROUP24.Y3.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เบาหวาน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP24.Y3.code,
                            advise: RESULT.GROUP24.Y3.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีอาการดังกล่าวข้างต้น',
                        to: 8
                    },
                ]
            },
            {
                question: 'ผู้ป่วย/ผู้แจ้งยังยืนยันการขอความช่วยเหลือใช่หรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP24.G6.code,
                            advise: RESULT.GROUP24.G6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 9
                    },

                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่สั้นๆ / พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R2.code,
                            advise: RESULT.GROUP22.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจเร็ว ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R2.code,
                            advise: RESULT.GROUP22.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R2.code,
                            advise: RESULT.GROUP22.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R2.code,
                            advise: RESULT.GROUP22.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R2.code,
                            advise: RESULT.GROUP22.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP22.R2.code,
                            advise: RESULT.GROUP22.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 10
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 10,
                to: 11,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP24.R3.code,
                    advise: RESULT.GROUP24.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },

                ]
            },
            {
                question: 'ผู้ป่วยสามารถขยับแขน/ขาได้หรือไม่',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ขยับไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP24.R8.code,
                            advise: RESULT.GROUP24.R8.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ขยับได้',
                        to: 12
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการปวดบริเวณใดหรือไม่',
                from: 12,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ศรีษะ / คอ / หลัง / สะโพก / ลำตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP24.Y4.code,
                            advise: RESULT.GROUP24.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'แขนยา',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP24.W2.code,
                            advise: RESULT.GROUP24.W2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีอาการปวด',
                        to: 13
                    },
                ]
            },
            {
                question: 'มีตำแหน่งของบาดแผลส่วนใดของร่างกาย',
                from: 13,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ศรีษะ / คอ / ทรวงอก / ช่องท้อง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP24.R5.code,
                            advise: RESULT.GROUP24.R5.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ที่อื่นๆ',
                        to: 14
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีบาดแผล',
                        to: null, // TODO : FIX THIS
                    },
                ]
            },
            {
                question: 'ขณะนี้ผู้ป่วยยังมีเลือดออกอยู่หรือไม่',
                from: 14,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'เลือดยังไหลอยู่',
                        to: 15
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีเลือดออก/เลือดหยุดแล้ว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP24.W1.code,
                            advise: RESULT.GROUP24.W1.advise,
                        }

                    },
                ]
            },
            {
                question: 'ให้ใช้ผ้าสะอาดหนาๆ กดบนแผนแน่นๆ ค้างไว้ แล้วมีเลือดชุ่มขึ้นมาหรือไม่',
                from: 15,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP24.R5.code,
                            advise: RESULT.GROUP24.R5.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP24.G1.code,
                            advise: RESULT.GROUP24.W1.advise,
                        }
                    },
                ]
            },
            {
                question: 'กระดูกหักตำแหน่งใด',
                from: 16,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ต้นคอ / หลัง / กระดูกเชิงกราน / ต้นขา / ต้นแขน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP24.R9.code,
                            advise: RESULT.GROUP24.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อื่นๆ ที่เหลือ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP24.G1.code,
                            advise: RESULT.GROUP24.G1.advise,
                        }
                    },
                ]
            },
            {
                question: 'อย่าขยับผู้ป่วย (โดยเฉพาะส่วนศรีษะและคอ) แล้วเรียกผู้ป่วยดังๆ ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 17,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP24.R1.code,
                            advise: RESULT.GROUP24.R1.advise,
                        }
                    }
                ]
            },

        ]
    },
    {
        name: 'อุบัติเหตุยานยนต์',
        description: 'อุบัติเหตุยานยนต์',
        module: 25,
        image: 'assets/imgs/car-crash.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้แจ้งอยู่ใน/หยุดดูเหตุการณ์ หรือเพียงขับรถผ่าน',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'อยู่ใน/หยุดดูเหตุการณ์',
                        to: 1
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ขับรถผ่าน',
                        to: 22,
                    },

                ]
            },
            {
                question: 'ผู้แจ้งคือใคร',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พลเมืองดี / อาสาสมัคร / ตำรวจ',
                        to: 2
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ผู้บาดเจ็บแจ้งเอง',
                        to: 17
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หน่วยบริการ (FR/BLS/ALS)',
                        to: 20
                    },

                ]
            },
            {
                question: 'สามารถระบุข้อใดต่อไปนี้หรือไม่',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มีคนกระเด็นออกจากรถยนต์ที่นั่ง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มีคนเสียชีวิต',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นรถยนต์ชนคนเดินเท้า',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'คนเจ็บมากกว่าหรือเท่ากับ 3 คน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ติดภายใน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'มีคนเจ็บน้อยกว่า 3 คน',
                        to: 3
                    },
                ]
            },
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 5,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'กำลังชัก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R6.code,
                            advise: RESULT.GROUP25.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 4,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP25.Y9.code,
                            advise: RESULT.GROUP25.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'อย่าขยับผู้ป่วย (โดยเฉพาะส่วนศรีษะและคอ) แล้วเรียกผู้ป่วยดังๆ ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 4,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 5
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R1.code,
                            advise: RESULT.GROUP25.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 5,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R2.code,
                            advise: RESULT.GROUP25.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจเร็ว ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R2.code,
                            advise: RESULT.GROUP25.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R2.code,
                            advise: RESULT.GROUP25.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R2.code,
                            advise: RESULT.GROUP25.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R2.code,
                            advise: RESULT.GROUP25.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R2.code,
                            advise: RESULT.GROUP25.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 6
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 6,
                to: 7,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP25.R3.code,
                    advise: RESULT.GROUP25.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,
                    },

                ]
            },
            {
                question: 'ผู้ป่วยสามารถขยับแขน/ขาได้หรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ขยับไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R8.code,
                            advise: RESULT.GROUP25.R8.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ขยับได้',
                        to: 8
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการปวดบริเวณใดหรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ศรีษะ / คอ / หลัง / สะโพก / ลำตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP25.Y4.code,
                            advise: RESULT.GROUP25.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'แขนขา',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP25.W2.code,
                            advise: RESULT.GROUP25.W2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีอาการปวด',
                        to: 9
                    },
                ]
            },
            {
                question: 'มีตำแหน่งของบาดแผลส่วนใดของร่างกาย',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ศรีษะ / คอ / ทรวงอก / ช่องท้อง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R5.code,
                            advise: RESULT.GROUP25.R5.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ที่อื่นๆ',
                        to: 10
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีบาดแผล',
                        to: 12,
                    },
                ]
            },
            {
                question: 'ขณะนี้ผู้ป่วยยังมีเลือดออกอยู่หรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'เลือดยังไหลอยู่',
                        to: 11
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีเลือดออก/เลือดหยุดแล้ว',
                        to: 12

                    },
                ]
            },
            {
                question: 'ให้ใช้ผ้าสะอาดหนาๆ กดบนแผนแน่นๆ ค้างไว้ แล้วมีเลือดชุ่มขึ้นมาหรือไม่',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R5.code,
                            advise: RESULT.GROUP25.R5.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 12
                    },
                ]
            },
            {
                question: 'ผู้ป่วยชักหลังการบาดเจ็บหรือไม่',
                from: 12,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ชัก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R6.code,
                            advise: RESULT.GROUP25.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ชัก',
                        to: 13
                    },
                ]
            },
            {
                question: 'ผู้ป่วยหมดสติชั่ววูบหรือไม่',
                from: 13,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP25.Y1.code,
                            advise: RESULT.GROUP25.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 14
                    },
                ]
            },
            {
                question: 'มีกระดูกหักหรือไม่',
                from: 14,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP25.W1.code,
                            advise: RESULT.GROUP25.W1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'มี',
                        to: 15
                    },
                ]
            },
            {
                question: 'กระดูกหักตำแหน่งใดบ้าง',
                from: 15,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ต้นคอ / หลัง / กระดูกเชิงกราน / ต้นขา / ต้นแขน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R9.code,
                            advise: RESULT.GROUP25.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อื่นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP25.G1.code,
                            advise: RESULT.GROUP25.G1.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วย/ผู้แจ้งยืนยันการขอความช่วยเหลือใช่หรือไม่',
                from: 16,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP25.G6.code,
                            advise: RESULT.GROUP25.G6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        to: null,
                    },
                ]
            },
            {
                question: 'สามารถระบุข้อใดต่อไปนี้หรือไม่',
                from: 17,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มีคนกระเด็นออกจากรถยนต์ที่นั่ง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มีคนเสียชีวิต',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นรถยนต์ชนคนเดินเท้า',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'คนเจ็บมากกว่าหรือเท่ากับ 3 คน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ติดภายใน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'มีคนเจ็บน้อยกว่า 3 คน',
                        to: 18
                    },
                ]
            },
            {
                question: 'มีผู้บาดเจ็บไม่รู้สึกตัวหรือไม่',
                from: 18,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'มีคนไม่รู้สึกตัว',
                        to: 19,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ทุกคนรู้สึกตัวดี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP25.Y3.code,
                            advise: RESULT.GROUP25.Y3.advise,
                        }
                    },
                ]
            },
            {
                question: 'อย่าขยับตัวผู้ป่วย (โดยเฉพาะส่วนศรีษะและคอ) แล้วเรียกผู้ป่วยด้วยเสียงดังๆ ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 19,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R1.code,
                            advise: RESULT.GROUP25.R1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'พอรู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP25.Y3.code,
                            advise: RESULT.GROUP25.Y3.advise,
                        }
                    },
                ]
            },
            {
                question: 'สามารถระบุข้อใดต่อไปนี้หรือไม่',
                from: 20,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มีคนกระเด็นออกจากรถยนต์ที่นั่ง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มีคนเสียชีวิต',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นรถยนต์ชนคนเดินเท้า',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'คนเจ็บมากกว่าหรือเท่ากับ 3 คน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ติดภายใน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'มีคนเจ็บน้อยกว่า 3 คน',
                        to: 21
                    },
                ]
            },
            {
                question: 'อาการผู้บาดเจ็บเป็นอย่างไร',
                from: 21,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มีผู้บาดเจ็บหนัก (สัญญาณชีพ หรือระดับความรู้สึกผิดปกติ)',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มีผู้บาดเจ็บเล็กน้อย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP25.G8.code,
                            advise: RESULT.GROUP25.G8.advise,
                        }
                    },
                ]
            },
            {
                question: 'สามารถระบุข้อใดต่อไปนี้หรือไม่',
                from: 22,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มีคนกระเด็นออกจากรถยนต์ที่นั่ง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มีคนเสียชีวิต',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นรถยนต์ชนคนเดินเท้า',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'คนเจ็บมากกว่าหรือเท่ากับ 3 คน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP25.R7.code,
                            advise: RESULT.GROUP25.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ติดภายใน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP25.Y8.code,
                            advise: RESULT.GROUP25.Y8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่สามารถระบุได้ / อื่นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP25.G9.code,
                            advise: RESULT.GROUP25.G9.advise,
                        }
                    },
                ]
            },
        ]
    }
]
