import { ResultPage } from './../result/result';
import { QuestionPage } from '../question/question';

export const CHOICE_TYPE = {
    CHECKBOX: 'checkbox',
    BUTTON: 'button'
}

export const TYPE = {
    'RESULT': 'result',
    'QUESTION': 'question',
    'MODULE': 'module'
}

export const LEVEL = {
    R: {
        text: 'ผู้ป่วยฉุกเฉินวิกฤติ',
        color: '#D72732'
    },
    Y: {
        text: 'ผู้ป่วยฉุกเฉินเร่งด่วน',
        color: '#F7E744'
    },
    G: {
        text: 'ผู้ป่วยฉุกเฉินไม่รุนแรง',
        color: '#1BA153'
    },
    W: {
        text: 'ผู้ป่วยทั่วไป',
        color: '#F0F0F0'
    }
}

export const RESULT = {
    GROUP1: {
        R1: {
            code: '1 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '1 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            },
        },
        R3: {
            code: '1 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R4: {
            code: '1 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'เพราะอาจทำให้ผู้ป่วยสำลักได้'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R5: {
            code: '1 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R6: {
            code: '1 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R7: {
            code: '1 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R8: {
            code: '1 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R9: {
            code: '1 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y1: {
            code: '1 เหลือง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },

                ],
                notes: [

                ]
            }
        },
        Y2: {
            code: '1 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่าผู้ป่วยนอนราบ ',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท',
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y3: {
            code: '1 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1.จัดท่าผู้ป่วยนอนราบ ',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท',
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y4: {
            code: '1 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y5: {
            code: '1 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y6: {
            code: '1 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y8: {
            code: '1 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '1 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ],
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ],
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G1: {
            code: '1 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G2: {
            code: '1 เขียว 2',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W1: {
            code: '1 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W2: {
            code: '1 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W3: {
            code: '1 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W4: {
            code: '1 ขาว 4',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W5: {
            code: '1 ขาว 5',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W6: {
            code: '1 ขาว 6',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W7: {
            code: '1 ขาว 7',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'และอยู่ในท่าที่สบาย'
                        ],
                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วย ไปตรวจในวันและเวลาราชการ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ],
                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
    },
    GROUP2: {
        R1: {
            code: '2 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: 'นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย ',

                ]
            },
        },
        R2: {
            code: '2 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        R3: {
            code: '2 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',

                ]
            }
        },
        R4: {
            code: '2 แดง 4',
            level: LEVEL.R
        },
        Y1: {
            code: '2 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่านอนศรีษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',

                ]
            }
        },
        Y4: {
            code: '2 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y8: {
            code: '2 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '2 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        W1: {
            code: '2 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W2: {
            code: '2 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W3: {
            code: '2 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W4: {
            code: '2 ขาว 4',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก ',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
    },
    GROUP3: {
        R1: {
            code: '3 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย ',
                ]
            },
        },
        R2: {
            code: '3 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        R3: {
            code: '3 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        R4: {
            code: '3 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนในท่าที่ผู้ป่วยสบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        R5: {
            code: '3 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ใช้ผ้าสะอาดกดห้ามเลือดไว้ให้แน่น ไม่เอาผ้าออก',
                        subDetails: [

                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยอยู่ในท่าที่สบาย อยู่ในอาการที่ถ่ายเท',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        R6: {
            code: '3 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. ล้างบาดแผลด้วยน้ำสะอาดหลายๆครั้ง ',
                        subDetails: [
                            'และใช้น้ำแข็งหรือถุงน้ำแข็งประคบหรือวางไว้บนบาดแผล'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยนอนอยู่ในท่าที่บาดแผลงูพิษกัดอยู่ต่ำกว่าระดับหัวใจ ',
                        subDetails: [
                            'นอนอยู่นิ่งๆ  เคลื่อนไหวร่างกายให้น้อยที่สุด และควรปลอบใจให้ผู้ป่วยสบายใจ'
                        ]
                    },
                    {
                        detail: '3. รีบนำผู้ป่วยส่งโรงพยาบาลที่ใกล้ที่สุด',
                        subDetails: [
                            'ถ้านำสัตว์ที่กัดไปด้วยหรือบอกชื่อของสัตว์ที่กัดได้ด้วยยิ่งดี '
                        ]
                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        Y1: {
            code: '3 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ล้างแผลและรอบบริเวณแผลด้วยสบู่ ',
                        subDetails: [
                            'และชะล้างแผลด้วยน้ำสะอาดปริมาณมาก ๆ'
                        ]

                    },
                    {
                        detail: '2. ซับแผลให้แห้งด้วยผ้าก๊อซที่สะอาด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. กรณีแผลเหวะหวะให้ปล่อยแผลไว้',
                        subDetails: [
                            'โดยไม่ต้องเย็บแผลแต่ปิดแผลด้วยผ้าก๊อซสะอาด'
                        ]
                    },
                    {
                        detail: '4. แนะนำให้ฉีดยาวัคซีนป้องกันโรคบาดทะยักและวัคคซีนป้องกันพิษสุนัขบ้าที่โรงพยาบาลหรือสถานีอนามัย',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้แจ้งกลับมาทาง 1669 อีกครั้ง',
                ]
            }
        },
        Y2: {
            code: '3 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนศรีษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    'ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    'หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    'กดเหล็กในออก(หากทำได้) , ประคบน้ำแข็งบริเวณที่ถูกต่อย',
                ]
            }
        },
        Y8: {
            code: '3 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '3 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ล้างแผลและรอบบริเวณแผลด้วยสบู่ ',
                        subDetails: [
                            'และชะล้างแผลด้วยน้ำสะอาดปริมาณมาก ๆ'
                        ]

                    },
                    {
                        detail: '2. ซับแผลให้แห้งด้วยผ้าก๊อซที่สะอาด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. กรณีแผลเหวะหวะให้ปล่อยแผลไว้',
                        subDetails: [
                            'โดยไม่ต้องเย็บแผลแต่ปิดแผลด้วยผ้าก๊อซสะอาด'
                        ]
                    },
                    {
                        detail: '4. แนะนำให้ฉีดยาวัคซีนป้องกันโรคบาดทะยักและวัคคซีนป้องกันพิษสุนัขบ้าที่โรงพยาบาลหรือสถานีอนามัย',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้แจ้งกลับมาทาง 1669 อีกครั้ง',
                ]
            }
        },
        W1: {
            code: '3 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'กดเหล็กในออก(หากทำได้)  ',
                        subDetails: [
                            'ประคบน้ำแข็งบริเวณที่ถูกต่อย ถ้ามีอาการปวด ให้รับประทานยาแก้ปวด  ถ้าคันหรือผิวหนังมีผื่นขึ้น ให้รับประทานยาแก้แพ้ ถ้าอาการไม่ทุเลาลง แนะนำให้มาพบแพทย์ในวันเวลาราชการ'
                        ]

                    },
                ],
                notes: [
                ]
            }
        },
        W2: {
            code: '3 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ล้างแผลและรอบบริเวณแผลด้วยสบู่ ',
                        subDetails: [
                            'และชะล้างแผลด้วยน้ำสะอาดปริมาณมาก ๆ'
                        ]

                    },
                    {
                        detail: '2. ซับแผลให้แห้งด้วยผ้าก๊อซที่สะอาด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. กรณีแผลเหวะหวะให้ปล่อยแผลไว้',
                        subDetails: [
                            'โดยไม่ต้องเย็บแผลแต่ปิดแผลด้วยผ้าก๊อซสะอาด'
                        ]
                    },
                    {
                        detail: '4. แนะนำให้ฉีดยาวัคซีนป้องกันโรคบาดทะยักและวัคคซีนป้องกันพิษสุนัขบ้าที่โรงพยาบาลหรือสถานีอนามัย',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    'หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้แจ้งกลับมาทาง 1669 อีกครั้ง',
                ]
            }
        },
        W3: {
            code: '3 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ล้างแผลและรอบบริเวณแผลด้วยสบู่ ',
                        subDetails: [
                            'และชะล้างแผลด้วยน้ำสะอาดปริมาณมาก ๆ'
                        ]
                    },
                    {
                        detail: '2. แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            ' หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },

                ],
                notes: [
                ]
            }
        },
        G1: {
            code: '3 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
    },
    GROUP4: {
        R1: {
            code: '4 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '4 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R3: {
            code: '4 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R4: {
            code: '4 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร',
                        subDetails: [
                            'เพราะอาจทำให้ผู้ป่วยสำลักได้'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R5: {
            code: '4 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร',
                        subDetails: [
                            'เพราะอาจทำให้ผู้ป่วยสำลักได้'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R6: {
            code: '4 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร',
                        subDetails: [
                            'เพราะอาจทำให้ผู้ป่วยสำลักได้'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R7: {
            code: '4 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R9: {
            code: '4 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่านอนในท่าที่ผู้ป่วยสบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร',
                        subDetails: [
                            'ให้งดน้ำงดอาหารทุกชนิด'
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y1: {
            code: '4 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y2: {
            code: '4 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y3: {
            code: '4 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบในท่าที่สบาย ',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y4: {
            code: '4 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบในท่าที่สบาย ',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y6: {
            code: '4 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนั่งหรือยืน',
                        subDetails: [
                            'ให้บีบปลายจมูกโดยไม่คลายออก และอยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y8: {
            code: '4 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '4 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบในท่าที่สบาย ',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W1: {
            code: '4 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก และอยู่ในท่าที่สบาย ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วยไปตรวจในวันและเวลาราชการ ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ]

                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [

                        ]

                    },
                ],
                notes: [
                ]
            }
        },
        W2: {
            code: '4 ขาว 2',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก และอยู่ในท่าที่สบาย ',
                        subDetails: [
                            'หากมีเลือดไหลอีก ให้ผู้ป่วยนั่งหรือยืน ให้บีบปลายจมูกโดยไม่คลายออก และอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วยไปตรวจในวันและเวลาราชการ ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ]

                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [

                        ]

                    },
                ],
                notes: [
                ]
            }
        },
        W3: {
            code: '4 ขาว 3',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: '1. ให้ผู้ป่วยนอนพัก และอยู่ในท่าที่สบาย ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. แนะนำให้นำผู้ป่วยไปตรวจในวันและเวลาราชการ ',
                        subDetails: [
                            'และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย'
                        ]

                    },
                    {
                        detail: '3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [

                        ]

                    },
                ],
                notes: [
                ]
            }
        },
        G1: {
            code: '4 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        G2: {
            code: '4 เขียว 2',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
    },
    GROUP5: {
        R1: {
            code: '5 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '5 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R3: {
            code: '5 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R4: {
            code: '5 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R6: {
            code: '5 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y1: {
            code: '5 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. แนะนำไม่ให้บีบหรือนวด บริเวณที่มีอาการชา',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y2: {
            code: '5 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y4: {
            code: '5 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y5: {
            code: '5 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y7: {
            code: '5 เหลือง 7',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y8: {
            code: '5 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '5 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        G1: {
            code: '5 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                    {
                        detail: '4. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G4: {
            code: '5 เขียว 4',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. หากทำตามคำแนะนำข้อ 3 แล้วไม่ดีขึ้น ให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },

                ],
                notes: [
                ]
            }
        },
        G6: {
            code: '5 เขียว 6',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้สังเกตอาการผู้ป่วยอยู่ที่บ้าน',
                        subDetails: [
                            'หากมีอาการผิดปกติ ให้ญาติพาผู้ป่วยส่ง รพ.'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        G7: {
            code: '5 เขียว 7',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [
                ]
            }
        },
        G8: {
            code: '5 เขียว 8',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. ล้างตาด้วยน้ำสะอาด ไม่แนะนำให้ใช้ยาหยอดตาหรือยาป้ายตา',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '2. หากถูกบริเวณอื่นที่ไม่ใช่ตา ให้ล้างด้วยน้ำสะอาดและสบู่ ',
                        subDetails: [
                            'ไม่ควรใช้น้ำยาใดๆ ป้าย บริเวณที่ถูกสาร'
                        ]
                    },
                ],
                notes: [
                    'ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล  หากอาการยังไม่ดีขึ้นให้ญาตินำผู้ป่วยส่งโรงพยาบาลใกล้บ้าน'
                ]
            }
        },
        W1: {
            code: '5 ขาว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้สังเกตอาการผู้ป่วยอยู่ที่บ้าน หากมีอาการผิดปกติ ให้ญาติพาผู้ป่วยส่ง รพ.',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
    },
    GROUP6: {
        R1: {
            code: '6 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. ให้ทำการปั๊มหัวใจไปเรื่อยๆ จนกว่ารถ รพ. จะไปถึง',
                    '2. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '3. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '6 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. ให้ทำการปั๊มหัวใจไปเรื่อยๆ จนกว่ารถ รพ. จะไปถึง',
                    '2. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '3. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        Y1: {
            code: '6 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. ให้ทำการปั๊มหัวใจไปเรื่อยๆ จนกว่ารถ รพ. จะไปถึง',
                    '2. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '3. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        Y4: {
            code: '6 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. ให้ทำการปั๊มหัวใจไปเรื่อยๆ จนกว่ารถ รพ. จะไปถึง',
                    '2. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '3. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        Y8: {
            code: '6 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
    },
    GROUP7: {
        R1: {
            code: '7 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '7 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R3: {
            code: '7 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R4: {
            code: '7 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R5: {
            code: '7 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R6: {
            code: '7 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. หากผู้ป่วยเคยได้รับการสั่งให้ใช้ยาอมใต้ลิ้น หรือยาพ่นขยายหลอดเลือดหัวใจ และไม่มีอาการเป็นลมหรือมึนศีรษะ แนะนำให้ผู้ป่วยใช้ยาเฉพาะตามที่แพทย์เคยสั่ง',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R7: {
            code: '7 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. หากผู้ป่วยเคยได้รับการสั่งให้ใช้ยาอมใต้ลิ้น หรือยาพ่นขยายหลอดเลือดหัวใจ และไม่มีอาการเป็นลมหรือมึนศีรษะ แนะนำให้ผู้ป่วยใช้ยาเฉพาะตามที่แพทย์เคยสั่ง',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R8: {
            code: '7 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R9: {
            code: '7 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y1: {
            code: '7 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        Y4: {
            code: '7 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y5: {
            code: '7 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y6: {
            code: '7 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y8: {
            code: '7 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '7 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        G1: {
            code: '7 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                    {
                        detail: '4. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        G6: {
            code: '7 เขียว 6',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [
                ]
            }
        },
        W1: {
            code: '7 ขาว 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. แนะนำให้สังเกตอาการผู้ป่วยอยู่ที่บ้าน ',
                        subDetails: [
                            'หากมีอาการผิดปกติ ให้ญาติพาผู้ป่วยส่งรพ.'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        W2: {
            code: '7 ขาว 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: '2. แนะนำให้สังเกตอาการผู้ป่วยอยู่ที่บ้าน ',
                        subDetails: [
                            'หากมีอาการผิดปกติ ให้ญาติพาผู้ป่วยส่งรพ.'
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
    },
    GROUP8: {
        R1: {
            code: '8 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        R2: {
            code: '8 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'สำหรับผู้ป่วยอายุ 8 ปี ขึ้นไป',
                        subDetails: [
                            '<b>ผู้ป่วยรู้สึกตัวดี</b>',
                            '1. ให้ผู้ป่วยยืนขึ้น  ผู้ช่วยเหลือยืนด้านหลังผู้ป่วย  โอบมือรอบผู้ป่วย  กำมือเป็นกำปั้นวางใต้ลิ้นปี่ตรงกลางเหนือสะดือ',
                            '2. ใช้มืออีกข้างหนึ่ง  กุมรอบกำปั้นอีกมือหนึ่งให้แน่  และกระตุกมือดันเข้าหาตัวผู้ป่วยบริเวณใต้ลิ้นปี่  ให้สิ่งแปลกปลอมหลุดออกมา  ถ้ายังไม่หลุดให้ทำซ้ำจนกว่าสิ่งแปลกปลอมจะหลุดออกมา',
                            '<b>ผู้ป่วยไม่รู้สึกตัว</b>',
                            '1. จัดผู้ป่วยนอนราบกับพื้น',
                            '2. ถ้าผู้ป่วยไม่หายใจ  ให้ทำการช่วยหายใจแบบผู้ใหญ่',
                            '3. การกดหน้าท้อง  (ABDOMINAL THRUSTS)',
                            '3.1  นั่งคร่อมบริเวณเข่าของผู้ป่วย',
                            '3.2  วางสันมือตรงบริเวณใต้ลิ้นปี่เหนือสะดือ  มืออีกข้างหนึ่งวางทับบนหลังมือแรก  ให้สันมือตรงกัน',
                            '3.3  ออกแรงกระแทกดันไปทางศีรษะผู้ป่วย  ในแนวกึ่งกลางลำตัว  ด้วยความเร็วติดต่อกัน  5  ครั้ง',
                            '3.4  อ้าปากผู้ป่วยดูว่าสิ่งแปลกปลอมหลุดออกมาอยู่ในปากผู้ป่วยหรือไม่  ถ้ามีสิ่งแปลกปลอมอยู่ให้ล้วงออก',
                            '3.5  ถ้าสิ่งแปลกปลอมยังไม่หลุดออกมา  ให้ทำซ้ำ  ตามข้อ 3.2 - 3.4  จนกระทั่งสิ่งแปลกปลอมหลุดออกมาและผู้ป่วยเริ่มหายใจได้เอง  หรือจนกว่าหน่วยกู้ชีพจะมาถึง',
                        ]
                    },
                    {
                        detail: 'สำหรับเด็กอายุ  1-8 ปี',
                        subDetails: [
                            '<b>ผู้ป่วยรู้สึกตัวดี ให้กระแทกบริเวณท้องส่วนบน  ในขณะที่เด็กยืนหรือนั่ง</b>',
                            '1. ให้ผู้ช่วยเหลือยืนด้านหลังและหันหน้าไปทางเดียวกับผู้ป่วย  โอบรอบตัวผู้ป่วย',
                            '2. กำมือข้างหนึ่งเป็นกำปั้น  วางไว้ใต้ลิ้นปี่เหนือสะดือเล็กน้อย',
                            '3. มืออีกข้างหนึ่งกุมรอบกำปั้นของมือแรก  ออกแรงกระแทกขึ้นไปทางด้านบนเร็ว ๆ และหลาย ๆ ครั้ง  ทำจนกว่าสิ่งแปลกปลอมจะหลุดออกมา',
                            '<b>ผู้ป่วยไม่รู้สึกตัว   ให้กระแทกบริเวณท้องส่วนบน  ในขณะที่เด็กนอนราบ</b>',
                            '1. จัดให้เด็กนอนหงาย',
                            '2. ผู้ช่วยเหลือคุกเข่าข้างตัวหรือคร่อมบริเวณเข่าของผู้ป่วย',
                            '3. วางสันมือข้างหนึ่งบริเวณใต้ลิ้นปี่เหนือสะดือ  มืออีกข้างวางทับบนหลังมือแรก  ให้สันมือตรงกัน',
                            '4. ออกแรงกระแทกดันไปทางศีรษะผู้ป่วย  ในแนวกึ่งกลางลำตัว  ด้วยความเร็วติดต่อกัน  5  ครั้ง',
                            '5. อ้าปากผู้ป่วยดูว่าสิ่งแปลกปลอมหลุดออกมาอยู่ในปากผู้ป่วยหรือไม่  ถ้ามีสิ่งแปลกปลอมอยู่ให้ล้วงออก',
                            '6. ถ้าสิ่งแปลกปลอมยังไม่หลุดออกมา  ให้ทำซ้ำ  ตามข้อ  3 - 4  จนกระทั่งสิ่งแปลกปลอมหลุดออกมาและผู้ป่วยเริ่มหายใจได้เอง  หรือจนกว่าหน่วยกู้ชีพจะมาถึง',
                        ]
                    },
                    {
                        detail: 'สำหรับเด็กทารกอายุต่ำกว่า  1 ปี   ผู้ช่วยเหลือนั่งบนเก้าอี้',
                        subDetails: [
                            '1. จับให้ทารกคว่ำลงตามแนวมือ  และแขนผู้ช่วยเหลือ  (โดยจับให้แน่นที่ส่วนคางของทารก)  ให้ศีรษะของทารกอยู่ต่ำกว่าลำตัวผู้ช่วยเหลือ',
                            '2. ใช้สันมือตบระหว่างกรุดูกสะบักของทารกทั้ง 2 ข้าง 5 ครั้ง',
                            '3. หลังจากออกแรงตบบนหลังแล้ว  จับให้ทารกนอนหงายบนท้องแขนส่วนล่าง  โดยวางแขนไว้บนต้นขาของผู้ช่วยเหลือ  และจับศีรษะของทารกให้ศีรษะอยู่ต่ำกว่าลำตัว',
                            '4. ใช้นิ้วกลางและนิ้วนางกดแบบกระแทกลงบนกระดูกหน้าอก  เหนือเส้นซึ่งลากเชื่อมระหว่างหัวนมซ้ายกับขวา  กดแบบกระแทก  จำนวน 5 ครั้ง',
                            '5. ทำข้อ 2 สลับกับข้อ 4  จนกว่าสิ่งแปลกปลอมจะออกมา',
                        ]

                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        R3: {
            code: '8 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'สำหรับผู้ป่วยอายุ 8 ปี ขึ้นไป',
                        subDetails: [
                            '<b>ผู้ป่วยรู้สึกตัวดี</b>',
                            '1. ให้ผู้ป่วยยืนขึ้น  ผู้ช่วยเหลือยืนด้านหลังผู้ป่วย  โอบมือรอบผู้ป่วย  กำมือเป็นกำปั้นวางใต้ลิ้นปี่ตรงกลางเหนือสะดือ',
                            '2. ใช้มืออีกข้างหนึ่ง  กุมรอบกำปั้นอีกมือหนึ่งให้แน่  และกระตุกมือดันเข้าหาตัวผู้ป่วยบริเวณใต้ลิ้นปี่  ให้สิ่งแปลกปลอมหลุดออกมา  ถ้ายังไม่หลุดให้ทำซ้ำจนกว่าสิ่งแปลกปลอมจะหลุดออกมา',
                            '<b>ผู้ป่วยไม่รู้สึกตัว</b>',
                            '1. จัดผู้ป่วยนอนราบกับพื้น',
                            '2. ถ้าผู้ป่วยไม่หายใจ  ให้ทำการช่วยหายใจแบบผู้ใหญ่',
                            '3. การกดหน้าท้อง  (ABDOMINAL THRUSTS)',
                            '3.1  นั่งคร่อมบริเวณเข่าของผู้ป่วย',
                            '3.2  วางสันมือตรงบริเวณใต้ลิ้นปี่เหนือสะดือ  มืออีกข้างหนึ่งวางทับบนหลังมือแรก  ให้สันมือตรงกัน',
                            '3.3  ออกแรงกระแทกดันไปทางศีรษะผู้ป่วย  ในแนวกึ่งกลางลำตัว  ด้วยความเร็วติดต่อกัน  5  ครั้ง',
                            '3.4  อ้าปากผู้ป่วยดูว่าสิ่งแปลกปลอมหลุดออกมาอยู่ในปากผู้ป่วยหรือไม่  ถ้ามีสิ่งแปลกปลอมอยู่ให้ล้วงออก',
                            '3.5  ถ้าสิ่งแปลกปลอมยังไม่หลุดออกมา  ให้ทำซ้ำ  ตามข้อ 3.2 - 3.4  จนกระทั่งสิ่งแปลกปลอมหลุดออกมาและผู้ป่วยเริ่มหายใจได้เอง  หรือจนกว่าหน่วยกู้ชีพจะมาถึง',
                        ]
                    },
                    {
                        detail: 'สำหรับเด็กอายุ  1-8 ปี',
                        subDetails: [
                            '<b>ผู้ป่วยรู้สึกตัวดี ให้กระแทกบริเวณท้องส่วนบน  ในขณะที่เด็กยืนหรือนั่ง</b>',
                            '1. ให้ผู้ช่วยเหลือยืนด้านหลังและหันหน้าไปทางเดียวกับผู้ป่วย  โอบรอบตัวผู้ป่วย',
                            '2. กำมือข้างหนึ่งเป็นกำปั้น  วางไว้ใต้ลิ้นปี่เหนือสะดือเล็กน้อย',
                            '3. มืออีกข้างหนึ่งกุมรอบกำปั้นของมือแรก  ออกแรงกระแทกขึ้นไปทางด้านบนเร็ว ๆ และหลาย ๆ ครั้ง  ทำจนกว่าสิ่งแปลกปลอมจะหลุดออกมา',
                            '<b>ผู้ป่วยไม่รู้สึกตัว   ให้กระแทกบริเวณท้องส่วนบน  ในขณะที่เด็กนอนราบ</b>',
                            '1. จัดให้เด็กนอนหงาย',
                            '2. ผู้ช่วยเหลือคุกเข่าข้างตัวหรือคร่อมบริเวณเข่าของผู้ป่วย',
                            '3. วางสันมือข้างหนึ่งบริเวณใต้ลิ้นปี่เหนือสะดือ  มืออีกข้างวางทับบนหลังมือแรก  ให้สันมือตรงกัน',
                            '4. ออกแรงกระแทกดันไปทางศีรษะผู้ป่วย  ในแนวกึ่งกลางลำตัว  ด้วยความเร็วติดต่อกัน  5  ครั้ง',
                            '5. อ้าปากผู้ป่วยดูว่าสิ่งแปลกปลอมหลุดออกมาอยู่ในปากผู้ป่วยหรือไม่  ถ้ามีสิ่งแปลกปลอมอยู่ให้ล้วงออก',
                            '6. ถ้าสิ่งแปลกปลอมยังไม่หลุดออกมา  ให้ทำซ้ำ  ตามข้อ  3 - 4  จนกระทั่งสิ่งแปลกปลอมหลุดออกมาและผู้ป่วยเริ่มหายใจได้เอง  หรือจนกว่าหน่วยกู้ชีพจะมาถึง',
                        ]
                    },
                    {
                        detail: 'สำหรับเด็กทารกอายุต่ำกว่า  1 ปี   ผู้ช่วยเหลือนั่งบนเก้าอี้',
                        subDetails: [
                            '1. จับให้ทารกคว่ำลงตามแนวมือ  และแขนผู้ช่วยเหลือ  (โดยจับให้แน่นที่ส่วนคางของทารก)  ให้ศีรษะของทารกอยู่ต่ำกว่าลำตัวผู้ช่วยเหลือ',
                            '2. ใช้สันมือตบระหว่างกรุดูกสะบักของทารกทั้ง 2 ข้าง 5 ครั้ง',
                            '3. หลังจากออกแรงตบบนหลังแล้ว  จับให้ทารกนอนหงายบนท้องแขนส่วนล่าง  โดยวางแขนไว้บนต้นขาของผู้ช่วยเหลือ  และจับศีรษะของทารกให้ศีรษะอยู่ต่ำกว่าลำตัว',
                            '4. ใช้นิ้วกลางและนิ้วนางกดแบบกระแทกลงบนกระดูกหน้าอก  เหนือเส้นซึ่งลากเชื่อมระหว่างหัวนมซ้ายกับขวา  กดแบบกระแทก  จำนวน 5 ครั้ง',
                            '5. ทำข้อ 2 สลับกับข้อ 4  จนกว่าสิ่งแปลกปลอมจะออกมา',
                        ]

                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        Y1: {
            code: '8 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ไม่ควรนำอาการ หรือน้ำ หรืองสิ่งของใดๆ เข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '2. ไม่ควรล้วง หรือใช้นิ้วกวาดเข้าไปในปาก',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. . กระตุ้นให้ผู้ป่วยไอ จนกว่าสิ่งแปลกปลอมหรือเศษอาหาร จะหลุดออกมา',
                        subDetails: [

                        ]
                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มเริ่มพูดไม่มีเสียง หรือไอไม่ได้ ให้ที่ ตาม 8 แดง 2',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            }
        },
        Y2: {
            code: '8 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ไม่ควรนำอาการ หรือน้ำ หรืองสิ่งของใดๆ เข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '2. ไม่ควรล้วง หรือใช้นิ้วกวาดเข้าไปในปาก',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. กระตุ้นให้ผู้ป่วยไอ จนกว่าสิ่งแปลกปลอมหรือเศษอาหาร จะหลุดออกมา',
                        subDetails: [

                        ]
                    },
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มเริ่มพูดไม่มีเสียง หรือไอไม่ได้ ให้ที่ ตาม 8 แดง 2',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            }
        },
        Y8: {
            code: '8 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '8 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท',
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        G1: {
            code: '8 เขียว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท',
                        ]
                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        W1: {
            code: '8 ขาว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ให้ผู้ป่วยนอนพัก และอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หากมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 เพื่อรับฟังคำแนะนำ หากไม่มีอาการเปลี่ยนแปลง แนะนำให้ไปตรวจรักษาที่ รพ.ในวันและเวลาราชการ',
                        ]
                    },

                ],
                notes: [
                ]
            }
        },
    },
    GROUP9: {
        R1: {
            code: '9 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                ]
            },
        },
        R2: {
            code: '9 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        R3: {
            code: '9 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        R4: {
            code: '9 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'เพราะอาจทำให้ผู้ป่วยสำลักได้'
                        ]

                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        R5: {
            code: '9 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        R6: {
            code: '9 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดพื้นที่ให้โล่ง ไม่มีสิ่งกีดขวางขณะที่ผู้ป่วยชัก',
                        subDetails: [

                        ]

                    },
                    {
                        detail: '2. ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]

                    },
                    {
                        detail: '3. จัดท่านอนตะแคงซ้าย อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [

                        ]

                    },
                    {
                        detail: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และ ไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]

                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        Y1: {
            code: '9 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        Y3: {
            code: '9 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [

                ]
            }
        },
        Y8: {
            code: '9 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        Y9: {
            code: '9 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [

                ]
            }
        },
        W1: {
            code: '9 ขาว 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. แนะนำให้สังเกตอาการผู้ป่วยอยู่ที่บ้าน ',
                        subDetails: [
                            'หากมีอาการผิดปกติ ให้ญาติพาผู้ป่วยส่งตรวจที่ รพ. ในวันและเวลาราชการ',
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
        W2: {
            code: '9 ขาว 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. แนะนำให้สังเกตอาการผู้ป่วยอยู่ที่บ้าน ',
                        subDetails: [
                            'หากมีอาการผิดปกติ ให้ญาติพาผู้ป่วยส่งตรวจที่ รพ. ในวันและเวลาราชการ',
                        ]
                    },
                ],
                notes: [

                ]
            }
        },
    },
    GROUP10: {
        R1: {
            code: '10 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: '3. สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                ]
            },
        },
        R2: {
            code: '10 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R3: {
            code: '10 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R4: {
            code: '10 แดง 4',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร ',
                        subDetails: [
                            'เพราะอาจทำให้ผู้ป่วยสำลักได้'
                        ]

                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        R5: {
            code: '10 แดง 5',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. นำผู้ป่วยเข้าที่ร่ม มีอากาศถ่ายเทได้สะดวก',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. เปลื้องหรือคลายเสื้อผ้า',
                        subDetails: [
                            'สิ่งที่รัดออกให้หลวม ถอดผ้าหนาๆ ออก เพื่อให้ความร้อนระบายออกจากร่างกายได้ง่าย และให้นอนหงายศีรษะสูง'
                        ]

                    },
                    {
                        detail: '3. เช็ดตัวด้วยน้ำเย็น',
                        subDetails: [
                            'วางกระเป๋าน้ำแข็งบนศีรษะ เพื่อช่วยลดอุณหภูมิให้กลับไปอยู่ในระดับปกติ โดยเร็ว'
                        ]
                    },
                    {
                        detail: '4. ห้ามคนมุงดู',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. หลีกเลี่ยงการให้ยาลดไข้',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ไม่ควรดื่มน้ำร้อน ชา, กาแฟ, เหล้า ฯลฯ',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. หากมีเลือด ให้ใช้ผ้าสะอาดปิดบริเวณที่เลือดออก ยกเว้น เลือดกำเดาไหล',
                    '3. กรณีเลือดกำเดาไหลให้ ผู้ป่วยนั่งหรือยืน ให้บีบปลายจมูกโดยไม่คลายออก และอยู่ในสถานที่อากาศถ่ายเท',
                    '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                ]
            }
        },
        R6: {
            code: '10 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดพื้นที่ให้โล่ง ไม่มีสิ่งกีดขวางขณะที่ผู้ป่วยชัก',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '2. ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. จัดท่านอนตะแคงซ้าย อยู่ในสถานที่อากาศถ่ายเท',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และ ไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '5. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        R7: {
            code: '10 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. นำผู้ป่วยเข้าที่ร่ม มีอากาศถ่ายเทได้สะดวก',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. เปลื้องหรือคลายเสื้อผ้า',
                        subDetails: [
                            'สิ่งที่รัดออกให้หลวม ถอดผ้าหนาๆ ออก เพื่อให้ความร้อนระบายออกจากร่างกายได้ง่าย และให้นอนหงายศีรษะสูง'
                        ]

                    },
                    {
                        detail: '3. เช็ดตัวด้วยน้ำเย็น',
                        subDetails: [
                            'วางกระเป๋าน้ำแข็งบนศีรษะ เพื่อช่วยลดอุณหภูมิให้กลับไปอยู่ในระดับปกติ โดยเร็ว'
                        ]
                    },
                    {
                        detail: '4. ห้ามคนมุงดู',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. หลีกเลี่ยงการให้ยาลดไข้',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ไม่ควรดื่มน้ำร้อน ชา, กาแฟ, เหล้า ฯลฯ',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                ]
            }
        },
        R8: {
            code: '10 แดง 8',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. นำผู้ป่วยเข้าที่ร่ม มีอากาศถ่ายเทได้สะดวก',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. เปลื้องหรือคลายเสื้อผ้า',
                        subDetails: [
                            'สิ่งที่รัดออกให้หลวม ถอดผ้าหนาๆ ออก เพื่อให้ความร้อนระบายออกจากร่างกายได้ง่าย และให้นอนหงายศีรษะสูง'
                        ]

                    },
                    {
                        detail: '3. เช็ดตัวด้วยน้ำเย็น',
                        subDetails: [
                            'วางกระเป๋าน้ำแข็งบนศีรษะ เพื่อช่วยลดอุณหภูมิให้กลับไปอยู่ในระดับปกติ โดยเร็ว'
                        ]
                    },
                    {
                        detail: '4. ห้ามคนมุงดู',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. หลีกเลี่ยงการให้ยาลดไข้',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ไม่ควรดื่มน้ำร้อน ชา, กาแฟ, เหล้า ฯลฯ',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                ]
            }
        },
        R9: {
            code: '10 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: '1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย',
                        subDetails: [
                            'และอยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                ]
            }
        },
        Y1: {
            code: '10 เหลือง 1',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. นำผู้ป่วยเข้าที่ร่ม มีอากาศถ่ายเทได้สะดวก',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. เปลื้องหรือคลายเสื้อผ้า',
                        subDetails: [
                            'สิ่งที่รัดออกให้หลวม ถอดผ้าหนาๆ ออก เพื่อให้ความร้อนระบายออกจากร่างกายได้ง่าย และให้นอนหงายศีรษะสูง'
                        ]

                    },
                    {
                        detail: '3. เช็ดตัวด้วยน้ำเย็น',
                        subDetails: [
                            'วางกระเป๋าน้ำแข็งบนศีรษะ เพื่อช่วยลดอุณหภูมิให้กลับไปอยู่ในระดับปกติ โดยเร็ว'
                        ]
                    },
                    {
                        detail: '4. ห้ามคนมุงดู',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. หลีกเลี่ยงการให้ยาลดไข้',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ไม่ควรดื่มน้ำร้อน ชา, กาแฟ, เหล้า ฯลฯ',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                ]
            }
        },
        Y2: {
            code: '10 เหลือง 2',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                ]
            }
        },
        Y3: {
            code: '10 เหลือง 3',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. นำผู้ป่วยเข้าที่ร่ม มีอากาศถ่ายเทได้สะดวก',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. เปลื้องหรือคลายเสื้อผ้า',
                        subDetails: [
                            'สิ่งที่รัดออกให้หลวม ถอดผ้าหนาๆ ออก เพื่อให้ความร้อนระบายออกจากร่างกายได้ง่าย และให้นอนหงายศีรษะสูง'
                        ]

                    },
                    {
                        detail: '3. เช็ดตัวด้วยน้ำเย็น',
                        subDetails: [
                            'วางกระเป๋าน้ำแข็งบนศีรษะ เพื่อช่วยลดอุณหภูมิให้กลับไปอยู่ในระดับปกติ โดยเร็ว'
                        ]
                    },
                    {
                        detail: '4. ห้ามคนมุงดู',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. หลีกเลี่ยงการให้ยาลดไข้',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. ไม่ควรดื่มน้ำร้อน ชา, กาแฟ, เหล้า ฯลฯ',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
                ]
            }
        },
        Y4: {
            code: '10 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. ไม่สัมผัสหรือแตะต้องตัวผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยถอดเสื้อผ้าที่ปนเปื้อนออก หากทำได้',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ล้างสารเคมีออกจากตาอย่างต่อเนื่อง',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ถ้าสารเคมีเป็นผง ให้ปัดออก ห้ามใช้ล้าง',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '5. รวบรวมข้อมูลเกี่ยวกับสารเคมี เช่น ขวด หรือภาชนะบรรจุภัณฑ์ ไปรพ. กับคนผู้ป่วยด้วย',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '6. อย่าให้ผู้ป่วยดื่มหรือกินสิ่งใด',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                ]
            }
        },
        Y5: {
            code: '10 เหลือง 5',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. หากผู้ป่วยหนาวและตัวแห้ง ให้ห่มผ้าให้ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '2. หากผู้ป่วยหนาวและตัวเปียก ให้ถอดเสื้อผ้าที่เปีบกออกและห่มผ้าให้ผู้ป่วย',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. อย่าให้ผู้ป่วยดื่มหรือกินสิ่งใด',
                        subDetails: [
                        ]
                    },
                    {
                        detail: '4. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                ]
            }
        },
        Y6: {
            code: '10 เหลือง 6',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                ]
            }
        },
        Y9: {
            code: '10 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                ]
            }
        },
        Y8: {
            code: '10 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        G2: {
            code: '10 เขียว 2',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: '1. แนะนำให้ผู้ป่วยนอนราบอยู่ในท่าที่สบาย',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [
                        ]

                    },
                    {
                        detail: '3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                ]
            }
        },
        G8: {
            code: '10 เขียว 8',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ล้างตาด้วยน้ำสะอาด ไม่แนะนำให้ใช้ยาหยอดตาหรือยาป้ายตา',
                        subDetails: [
                        ]

                    },
                ],
                notes: [
                    'ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล หากอาการยังไม่ดีขึ้นให้ญาตินำผู้ป่วยส่งโรงพยาบาลใกล้บ้าน'
                ]
            }
        },
        W1: {
            code: '10 ขาว 1',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ล้างตัวให้สะอาด ',
                        subDetails: [
                            'หากมีอาการแน่นหน้าอก หายใจขัด หรืออาการผิดปกติอื่นๆ ให้โทรแจ้ง 1669 อีกครั้ง หากไม่มีอาการผิดปกติ ให้แนะนำไปตรวจที่ รพ. ในวันและเวลาราชการ',
                        ]

                    },
                ],
                notes: [
                ]
            }
        },
    },
    GROUP14: {
        R1: {
            code: '14 แดง 1',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
                        subDetails: [
                            '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป'
                        ]

                    },
                    {
                        detail: 'นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
                        subDetails: [
                            ' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ'
                        ]
                    },
                    {
                        detail: 'สอนวิธีปั๊มหัวใจ',
                        subDetails: [
                            'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
                            'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
                            'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)'
                        ]
                    }
                ],
                notes: [
                    '1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
                    '2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',

                ]
            }
        },
        R2: {
            code: '14 แดง 2',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
                        subDetails: [
                            'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
                        subDetails: [

                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    }
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',

                ]
            }
        },
        R3: {
            code: '14 แดง 3',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
                        subDetails: [
                            'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท'
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',

                ]
            }
        },
        R6: {
            code: '14 แดง 6',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'จัดพื้นที่ให้โล่ง ',
                        subDetails: [
                            'ไม่มีสิ่งกีดขวางขณะที่ผู้ป่วยชัก'
                        ]

                    },
                    {
                        detail: 'ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย',
                        subDetails: [

                        ]
                    },
                    {
                        detail: 'จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                            'อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '3. จัดท่านอนตะแคงซ้าย อยู่ในสถานที่อากาศถ่ายเท'

                ]
            }
        },
        R7: {
            code: '14 แดง 7',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'พูดคุยด้วยท่าทีเป็นมิตร ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: 'สังเกตอาการผู้ป่วย ',
                        subDetails: [
                            'ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร'
                        ]
                    },
                    {
                        detail: 'ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน ',
                        subDetails: [
                        ]
                    },
                    {
                        detail: 'หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้',
                        subDetails: [
                            'อาจต้องใช้วิธีผูกมัด'
                        ]
                    },
                ],
                notes: [
                    '1. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '2. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',

                ]
            }
        },
        R9: {
            code: '14 แดง 9',
            level: LEVEL.R,
            advise: {
                contents: [
                    {
                        detail: 'อย่าทำให้ผู้ป่วยอาเจียน ',
                        subDetails: [
                        ]

                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '2. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',

                ]
            }
        },
        Y4: {
            code: '14 เหลือง 4',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย'
                ]
            }
        },
        Y8: {
            code: '14 เหลือง 8',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'จัดท่านอนตะแคงซ้าย ',
                        subDetails: [
                            'เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
                    '2. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง',
                ]
            }
        },
        Y9: {
            code: '14 เหลือง 9',
            level: LEVEL.Y,
            advise: {
                contents: [
                    {
                        detail: 'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
                        subDetails: [
                            'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
                    '2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
                    '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย'
                ]
            }
        },
        G3: {
            code: '14 เขียว 3',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'พูดกับผู้ป่วยด้วยความนุ่มนวล ',
                        subDetails: [
                            'เกลี่ยกล่อมให้นอนพัก'
                        ]
                    },
                    {
                        detail: 'พยายามให้ผู้ป่วยอยู่ในบริเวณบ้าน ',
                        subDetails: [
                            'พื้นที่โล่งอากาศถ่ายเท'
                        ]
                    },
                    {
                        detail: 'ระวังไม่ให้มีสิ่งของที่สามารถทำอันตรายต่อญาติและผู้ป่วยอยู่ใกล้ตัว ',
                        subDetails: [
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                ]
            }
        },
        G4: {
            code: '14 เขียว 4',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        G5: {
            code: '14 เขียว 5',
            level: LEVEL.G,
            advise: {
                contents: [

                ],
                notes: [

                ]
            }
        },
        G8: {
            code: '14 เขียว 8',
            level: LEVEL.G,
            advise: {
                contents: [
                    {
                        detail: 'ล้างตาด้วยน้ำสะอาด ',
                        subDetails: [
                            'ไม่แนะนำให้ใช้ยาหยอดตาหรือยาป้ายตา'
                        ]
                    },
                ],
                notes: [
                    '1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล  หากอาการยังไม่ดีขึ้นให้ญาตินำผู้ป่วยส่งโรงพยาบาลใกล้บ้าน'
                ]
            }
        },
        W1: {
            code: '14 ขาว 1',
            level: LEVEL.W,
            advise: {
                contents: [
                    {
                        detail: 'แนะนำให้ผู้ป่วยนอนพัก',
                        subDetails: [
                            ' หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ'
                        ]
                    },
                ],
                notes: [

                ]
            }
        }
    }
}

export const QUESTIONS = [
    {
        name: 'ปวดท้อง',
        description: 'ปวดท้อง, หลัง, เชิงกรานและขาหนีบ',
        image: 'assets/imgs/stomach-ache.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y9.code,
                            advise: RESULT.GROUP1.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R1.code,
                            advise: RESULT.GROUP1.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R2.code,
                            advise: RESULT.GROUP1.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y8.code,
                            advise: RESULT.GROUP1.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 21,
                criteria: {
                    minimumChecked: 1,
                    to: 6,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยปวดท้องส่วนใด',
                from: 6,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ปวด/จุกเสียด/แน่นยอดอก/ลิ้นปี่/ท้องส่วนบน (เหนือสะดือ)',
                        to: 7
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ปวดท้องน้อย/หลัง/บั้นเอว/สีข้าง',
                        to: 8
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ปวดไม่จำเพาะเจาะจง/อื่นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y3.code,
                            advise: RESULT.GROUP1.Y3.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุมากกว่า 50 ปี หรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R9.code,
                            advise: RESULT.GROUP1.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y3.code,
                            advise: RESULT.GROUP1.Y3.advise,
                        }
                    },
                ]
            },
            {
                question: 'อาการปวดเกิดจากการบาดเจ็บหรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่เกิดอาการบาดเจ็บ',
                        to: 9
                    },
                    {
                        type: TYPE.MODULE,
                        name: 'เกิดอาการบาดเจ็บ',
                        moduleIndex: 20,
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าใด',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อายุมากกว่า 65 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R8.code,
                            advise: RESULT.GROUP1.R8.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อายุ 50 - 65 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y4.code,
                            advise: RESULT.GROUP1.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อายุน้อยกว่า 50 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y3.code,
                            advise: RESULT.GROUP1.Y3.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอาเจียนหรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'อาเจียน',
                        to: 11
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่อาเจียน',
                        to: 12,
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีเลือดออกหรือไม่ ที่ใดบ้าง',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อาเจียนเป็นเลือด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R5.code,
                            advise: RESULT.GROUP1.R5.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ถ่ายอุจจาระดำ / แดงคล้ำ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R6.code,
                            advise: RESULT.GROUP1.R6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: '(กรณีเป็นผู้หญิง)มีเลือดออกทางช่องคลอด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP1.R7.code,
                            advise: RESULT.GROUP1.R7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่เห็นมีเลือดออก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP1.G1.code,
                            advise: RESULT.GROUP1.G1.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยปวดท้องส่วนใด บนเหนือสะดือหรือส่่วนอื่น',
                from: 12,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ท้องส่วนบน เหนือสะดือ',
                        to: 13
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ท้องน้อย',
                        to: 14
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หลัง',
                        to: 16
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'บั้นเอว/สีข้าง',
                        to: 19
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ขาหนีบ',
                        to: 20
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ระบุบริเวณที่ปวดชัดเจนไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W1.code,
                            advise: RESULT.GROUP1.W1.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุมากกว่า 50 ปีหรือไม่',
                from: 13,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y6.code,
                            advise: RESULT.GROUP1.Y6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W2.code,
                            advise: RESULT.GROUP1.W2.advise,
                        }
                    },

                ]
            },
            {
                question: 'อาการปวดเกิดจากการบาดเจ็บหรือไม่',
                from: 14,
                choices: [
                    {
                        type: TYPE.MODULE,
                        name: 'ใช่',
                        moduleIndex: 20,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่',
                        to: 15
                    },

                ]
            },
            {
                question: 'ผู้ป่วยอายุมากกว่า 50 ปีหรือไม่',
                from: 15,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y4.code,
                            advise: RESULT.GROUP1.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W2.code,
                            advise: RESULT.GROUP1.W2.advise,
                        }
                    },

                ]
            },
            {
                question: 'อาการปวดเกิดจากการบาดเจ็บ/ยกของหนักใช่หรือไม่',
                from: 16,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W6.code,
                            advise: RESULT.GROUP1.W6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่',
                        to: 17
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอายุมากกว่า 50 ปีหรือไม่',
                from: 17,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'ใช่',
                        to: 18
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่',
                        to: 19
                    },
                ]
            },
            {
                question: 'ผู้ป่วยเริ่มมีอาการปวดรุนแรงขึ้นมาอย่างเฉียบพลันหรือไม่',
                from: 18,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y4.code,
                            advise: RESULT.GROUP1.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W3.code,
                            advise: RESULT.GROUP1.W3.advise,
                        }
                    },

                ]
            },

            {
                question: 'ปวดบีบอย่างรุนแรงเป็นช่วงๆหรือไม่',
                from: 19,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP1.Y5.code,
                            advise: RESULT.GROUP1.Y5.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W4.code,
                            advise: RESULT.GROUP1.W4.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยเริ่มมีอาการปวดรุนแรงขึ้นมาอย่างเฉียบพลันหรือไม่',
                from: 20,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP1.G1.code,
                            advise: RESULT.GROUP1.G1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W5.code,
                            advise: RESULT.GROUP1.W5.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีปัญหาสายสวนหรือไม่',
                from: 21,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'มี',
                        to: 22
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 10
                    },
                ]
            },
            {
                question: 'เป็นสายสวนอะไร',
                from: 22,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'สายสวนปัสสาวะ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP1.W7.code,
                            advise: RESULT.GROUP1.W7.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'สายสวนอื่นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP1.G2.code,
                            advise: RESULT.GROUP1.G2.advise,
                        }
                    },
                ]
            },

        ]
    },
    {
        name: 'แพ้ยา',
        description: 'แพ้อาหาร , สัตว์ต่อย , ภูมิแพ้ ',
        image: 'assets/imgs/pill.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP2.Y9.code,
                            advise: RESULT.GROUP2.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R1.code,
                            advise: RESULT.GROUP2.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP2.R2.code,
                            advise: RESULT.GROUP2.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP2.Y8.code,
                            advise: RESULT.GROUP2.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP2.R3.code,
                    advise: RESULT.GROUP2.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลม',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อาการซึมลง',
                        checked: false,
                    },
                ]
            },
            {
                question: 'ผุ้ป่วยเคยมีประวัติแพ้รุนแรงต่อสิ่งใดหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'เคย',
                        to: 7
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่เคย',
                        to: 8
                    },
                ]
            },
            {
                question: 'เคยมีอาการเกิดขึ้นหลังจากได้รับสิ่งที่แพ้ภายใน 30 นาทีหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP2.Y1.code,
                            advise: RESULT.GROUP2.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 8
                    },
                ]
            },
            {
                question: 'ผุ้ป่วยเคยแพ้ยา / ช่วงนี้ผู้ป่วยกิน / ได้รับยาแล้วมีอาการแพ้หรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP2.Y4.code,
                            advise: RESULT.GROUP2.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 9
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการผิดปกติอย่างไรบ้าง',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นผื่นคัน / ลมพิษ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP2.W3.code,
                            advise: RESULT.GROUP2.W3.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อาการอื่นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP2.W2.code,
                            advise: RESULT.GROUP2.W2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มีอาการผิดปกติ',
                        to: 11
                    },
                ]
            },
            {
                question: 'ผู้ป่วยเคยมีประวัติการแพ้หรือไม่',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เคย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP2.W4.code,
                            advise: RESULT.GROUP2.W4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่เคย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP2.W1.code,
                            advise: RESULT.GROUP2.W1.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'สัตว์กัด',
        description: 'สัตว์กัด',
        image: 'assets/imgs/cobra.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP3.Y9.code,
                            advise: RESULT.GROUP3.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R1.code,
                            advise: RESULT.GROUP3.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R2.code,
                            advise: RESULT.GROUP3.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP3.Y8.code,
                            advise: RESULT.GROUP3.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP3.R3.code,
                    advise: RESULT.GROUP3.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },

                ]
            },
            {
                question: 'ผู้ป่วยถูกสัตว์ชนิดใดกัดหรือต่อย',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'งูพิษ/งูที่ไม่แน่ใจว่ามีพิษ/สัตว์มีพิษ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R6.code,
                            advise: RESULT.GROUP3.R6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หอยเต้าปูน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP3.R6.code,
                            advise: RESULT.GROUP3.R6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผึ้ง/แตน/ต่อ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP3.G1.code,
                            advise: RESULT.GROUP3.G1.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'สัตว์อื่นๆ',
                        to: 7
                    },
                ]
            },
            {
                question: 'มีอาการบวม/ฟกช้ำรอบตำแหน่งที่ถูกกัด/เสีย/สัมผัสบ้างหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP3.W1.code,
                            advise: RESULT.GROUP3.W1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP3.W3.code,
                            advise: RESULT.GROUP3.W3.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'เลือดออก',
        description: 'ไม่มีสาเหตุจากการบาดเจ็บ',
        image: 'assets/imgs/broken-heart-bleeding.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y9.code,
                            advise: RESULT.GROUP4.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R1.code,
                            advise: RESULT.GROUP4.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP4.R2.code,
                            advise: RESULT.GROUP4.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y8.code,
                            advise: RESULT.GROUP4.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                criteria: {
                    minimumChecked: 1,
                    to: 6,
                    payload: {
                        level: LEVEL.R.text,
                        color: LEVEL.R.color,
                        code: RESULT.GROUP4.R3.code,
                        advise: RESULT.GROUP4.R3.advise,
                    }
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'มีอาการหมดสติชั่ววูบหลายครั้งในวันนั้น',
                        checked: false,
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีเลือดออกที่ใดบ้าง',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'อาเจียนเป็นเลือด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y1.code,
                            advise: RESULT.GROUP4.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ถ่ายอุจจาระดำ / แดงคล้ำ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y1.code,
                            advise: RESULT.GROUP4.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไอเป็นเลือด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y1.code,
                            advise: RESULT.GROUP4.Y1.advise,
                        }
                    },

                    {
                        type: TYPE.QUESTION,
                        name: 'เลือดกำเดา',
                        to: 7
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'กรณีเป็นผู้หญิงมีเลือดออกทางช่องคลอด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y1.code,
                            advise: RESULT.GROUP4.Y1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เลือดในปัสสาวะ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP4.G2.code,
                            advise: RESULT.GROUP4.G2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ที่อื่น นอกจากทวารดังกล่าวข้างต้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP4.Y1.code,
                            advise: RESULT.GROUP4.Y1.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยยอมที่จะลองหยุดเลือดด้วยตัวเองหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยินยอม',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP4.W2.code,
                            advise: RESULT.GROUP4.W2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่ยินยอม',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP4.G1.code,
                            advise: RESULT.GROUP4.G1.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'หายใจลำบาก',
        description: 'ติดขัด',
        image: 'assets/imgs/nose.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP5.Y9.code,
                            advise: RESULT.GROUP5.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R1.code,
                            advise: RESULT.GROUP5.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP5.R2.code,
                            advise: RESULT.GROUP5.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP5.Y8.code,
                            advise: RESULT.GROUP5.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP5.R3.code,
                    advise: RESULT.GROUP5.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },

                ]
            },
            {
                question: 'ผู้ป่วยเจ็บแน่นทรวงอกหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 7
                    },
                ]
            },
            {
                question: 'ผู้เคยมีการใช้อ๊อกซิเจนที่บ้านและหมดถังใช่หรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP5.Y7.code,
                            advise: RESULT.GROUP5.Y7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 8
                    },
                ]
            },
            {
                question: 'ผู้ป่วยถูกการป้องกันตัว เช่น แก๊สน้ำตา สเปรย์พริกไทยหรือไม่',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP14.G8.code,
                            advise: RESULT.GROUP14.G8.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 9
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการใดต่อไปนี้',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นหวัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            color: LEVEL.W.color,
                            code: RESULT.GROUP5.W1.code,
                            advise: RESULT.GROUP5.W1.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยหรือผู้แจ้งยืนยันการขอความช่วยเหลือ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP5.G6.code,
                            advise: RESULT.GROUP5.G6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'อื่นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP5.G7.code,
                            advise: RESULT.GROUP5.G7.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'หัวใจหยุดเต้น',
        description: 'หัวใจหยุดเต้น',
        image: 'assets/imgs/heartbeat.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'พิจารณาไม่ใช้เนื่องจากอย่างไรก็ตาม ก็จะส่งหน่วยแน่นอน',
                from: 0,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ส่งหน่วย ALS',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP6.R1.code,
                            advise: RESULT.GROUP6.R1.advise,
                        }
                    }
                ]
            },
        ],
    },
    {
        name: 'เจ็บแน่นทรวงอก',
        description: 'หัวใจ, มีปัญหาทางด้านหัวใจ',
        image: 'assets/imgs/female-trunk.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP7.Y9.code,
                            advise: RESULT.GROUP7.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R1.code,
                            advise: RESULT.GROUP7.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R2.code,
                            advise: RESULT.GROUP7.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP7.Y8.code,
                            advise: RESULT.GROUP7.Y8.advise,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                criteria: {
                    minimumChecked: 1,
                    to: 6,
                    payload: {
                        level: LEVEL.R.text,
                        color: LEVEL.R.color,
                        code: RESULT.GROUP7.R3.code,
                        advise: RESULT.GROUP7.R3.advise,
                    }
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
                        checked: false,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซีดและผิวซีดเย็น',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หัวใจเต้นเร็ว/ใจสั่น',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคประจำตัวหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'โรคปอด/หลอดเลือดปอด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R9.code,
                            advise: RESULT.GROUP7.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'โรคหลอดเลือด/ลิ้น/กล้ามเนื้อหัวใจ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R9.code,
                            advise: RESULT.GROUP7.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'โรคเบาหวาน',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R9.code,
                            advise: RESULT.GROUP7.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'โรคความดันเลือดสูง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R9.code,
                            advise: RESULT.GROUP7.R9.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ฝังเครื่องกระตุกหัวใจอัติโนมัติไว้ แล้วเครื่องกระตุกขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP7.R8.code,
                            advise: RESULT.GROUP7.R8.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี/อื่นๆ',
                        to: 7
                    },
                ]
            },
            {
                question: 'ผู้ป่วยเป็นชายหรือหญิง อายุเท่าไหร่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ชาย อายุมากกว่าหรือเท่ากับ 40 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP7.Y6.code,
                            advise: RESULT.GROUP7.Y6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ชาย อายุน้อยกว่า 40 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP7.G6.code,
                            advise: RESULT.GROUP7.G6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หญิง อายุมากกว่าหรือเท่ากับ 40 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP7.Y6.code,
                            advise: RESULT.GROUP7.Y6.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หญิง อายุน้อยกว่า 40 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP7.G6.code,
                            advise: RESULT.GROUP7.G6.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'สำลัก',
        description: 'อุดกั้นทางเดินหายใจ',
        image: 'assets/imgs/respiratory-system.png',
        color: '#CA1F13',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP8.Y9.code,
                            advise: RESULT.GROUP8.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R1.code,
                            advise: RESULT.GROUP8.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ผู้ป่วยพูดหรือมีเสียงร้องออกมาหรือไม่',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มีเสียงออกมา',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R2.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'มีเสียงออกมา',
                        to: 3
                    },
                ]
            },
            {
                question: 'หายใจโล่งแล้วหรือยัง',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยังไม่โล่ง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP8.R2.code,
                            advise: RESULT.GROUP8.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'โล่งแล้ว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP8.Y2.code,
                            advise: RESULT.GROUP8.Y2.advise,
                        }
                    },
                ]
            },
        ]
    },
    {
        name: 'ได้รับสารพิษ',
        description: 'ยาเกินขนาด',
        image: 'assets/imgs/poison.png',
        color: '#FF85A7',
        questions: [
            {
                question: 'ผู้ป่วยรู้สึกตัวหรือไม่',
                from: 0,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'รู้สึกตัว',
                        to: 2,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่รู้สึกตัว',
                        to: 1
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP14.Y9.code,
                            advise: RESULT.GROUP14.Y9.advise,
                        }
                    }
                ]
            },
            {
                question: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
                from: 1,
                choices: [
                    {
                        type: TYPE.QUESTION,
                        name: 'พอรู้สึกตัว',
                        to: 2
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ยังคงไม่รู้สึกตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R1.code,
                            advise: RESULT.GROUP14.R1.advise,
                        }
                    }
                ]
            },
            {
                question: 'ลักษณะอาการหายใจเป็นอย่างไร',
                from: 2,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'พูดได้แค่ประโยคสั้นๆ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจมีเสียงดัง',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                            color: LEVEL.R.color,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ตัวซีดและเหงือท่วมตัว',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                            color: LEVEL.R.color,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'หายใจเร็ว',
                        to: 3
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'พูดได้ / หายใจปกติ',
                        to: 5
                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
                from: 3,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่มี',
                        to: 4
                    },
                ]
            },
            {
                question: 'ผู้ป่วยอายุเท่าไหร่',
                from: 4,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มากกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R2.code,
                            advise: RESULT.GROUP14.R2.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'น้อยกว่า 20 ปี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            code: RESULT.GROUP14.Y8.code,
                            advise: RESULT.GROUP14.Y8.advise,
                            color: LEVEL.Y.color,
                        }
                    },

                ]
            },
            {
                question: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
                type: CHOICE_TYPE.CHECKBOX,
                from: 5,
                to: 6,
                payload: {
                    level: LEVEL.R.text,
                    color: LEVEL.R.color,
                    code: RESULT.GROUP14.R3.code,
                    advise: RESULT.GROUP14.R3.advise,
                },
                choices: [
                    {
                        type: TYPE.RESULT,
                        from: 5,
                        name: 'เหงื่อท่วมตัว',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 5,
                        name: 'ซีดและผิวซีดเย็ด',
                        checked: false,

                    },
                    {
                        type: TYPE.RESULT,
                        from: 5,
                        name: 'เป็นลมหรือเกือบเป็นลม',
                        checked: false,

                    },
                ]
            },
            {
                question: 'ผู้ป่วยมีอาการชักหรือไม่',
                from: 6,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ชัก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R6.code,
                            advise: RESULT.GROUP14.R6.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 7
                    },
                ]
            },
            {
                question: 'เจ้าหน้าที่ร้องขอการเตรียมพร้อมเนื่องจากผู้ป่วยมีภาวะคุกคาม อันจะเป็นอัตรายต่อตนเองและผู้อื่นหรือไม่',
                from: 7,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ใช่',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,

                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R7.code,
                            advise: RESULT.GROUP14.R7.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'ไม่ใช่',
                        to: 8
                    },
                ]
            },
            {
                question: 'ผู้ป่วยได้รับ/สารอะไรเข้าสู่ร่างกาย',
                from: 8,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'ยา',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP14.G4.code,
                            advise: RESULT.GROUP14.G4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'สารเคมีที่ใช้ในการเกษตร',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R9.code,
                            advise: RESULT.GROUP14.R9.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'สารกัดกร่อน / สารเคมีอื่น (ที่ไม่ใช่อาหารยา)',
                        to: 9,
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'สารป้องกันตัว เช่น แก๊สน้ำตา สเปรย์พริกไทย',
                        to: 11,
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'สารเสพติด',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP14.G3.code,
                            advise: RESULT.GROUP14.G3.advise,
                        }
                    },
                ]
            },
            {
                question: 'ผู้ป่วยกลืน น้ำลาย น้ำ และอากหาร ลำบากหรือไม่่',
                from: 9,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'กลืนลำบาก',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.R.text,
                            color: LEVEL.R.color,
                            code: RESULT.GROUP14.R9.code,
                            advise: RESULT.GROUP14.R9.advise,
                        }
                    },
                    {
                        type: TYPE.QUESTION,
                        name: 'กลืนได้ปกติ',
                        to: 10
                    },
                ]
            },
            {
                question: 'มีอาการผิดปกติอื่นเช่น เจ็บคอ ปวดท้อง ปวดศรีษะ คัน วิงเวียน',
                from: 10,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.Y.text,
                            color: LEVEL.Y.color,
                            code: RESULT.GROUP14.Y4.code,
                            advise: RESULT.GROUP14.Y4.advise,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            color: LEVEL.G.color,
                            code: RESULT.GROUP14.G5.code,
                            advise: RESULT.GROUP14.G5.advise,
                        }
                    },
                ]
            },
            {
                question: 'มีอาการผิดปกติหรือไม่ เช่น ปวดท้อง ปวดศรีษะ คัน วิงเวียน',
                from: 11,
                choices: [
                    {
                        type: TYPE.RESULT,
                        name: 'มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.G.text,
                            code: RESULT.GROUP14.G8.code,
                            advise: RESULT.GROUP14.G8.advise,
                            color: LEVEL.G.color,
                        }
                    },
                    {
                        type: TYPE.RESULT,
                        name: 'ไม่มี',
                        to: ResultPage,
                        payload: {
                            level: LEVEL.W.text,
                            code: RESULT.GROUP14.W1.code,
                            advise: RESULT.GROUP14.W1.advise,
                            color: LEVEL.W.color,
                        }
                    },
                ]
            },
        ]
    }
]
