import { level, choiceType, questionType } from "../meta";

const result = {
  red1: {
    code: "3 แดง 1",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่",
          descriptions: [
            "<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป"
          ]
        },
        {
          title: "2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง",
          descriptions: [
            " พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ"
          ]
        },
        {
          title: "3. สอนวิธีปั๊มหัวใจ",
          descriptions: [
            "ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย",
            "ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา",
            "ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)"
          ]
        }
      ],
      notes: [
        "1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย",
        "2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที",
        "3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย "
      ]
    }
  },
  red2: {
    code: "3 แดง 2",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ",
          descriptions: [
            "หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท"
          ]
        },
        {
          title: "2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป",
          descriptions: []
        },
        {
          title:
            "3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ",
          descriptions: [
            "จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: [
        "1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม",
        "2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที",
        "3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย"
      ]
    }
  },
  red3: {
    code: "3 แดง 3",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ",
          descriptions: ["ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title:
            "2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          descriptions: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: [
        "1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม",
        "2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที",
        "3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย"
      ]
    }
  },
  red4: {
    code: "3 แดง 4",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. จัดท่านอนในท่าที่ผู้ป่วยสบาย",
          descriptions: [
            "หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท"
          ]
        },
        {
          title:
            "2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          descriptions: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: [
        "1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม",
        "2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที",
        "3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย"
      ]
    }
  },
  red5: {
    code: "3 แดง 5",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. ให้ใช้ผ้าสะอาดกดห้ามเลือดไว้ให้แน่น ไม่เอาผ้าออก",
          descriptions: []
        },
        {
          title: "2. ให้ผู้ป่วยอยู่ในท่าที่สบาย อยู่ในอาการที่ถ่ายเท",
          descriptions: []
        },
        {
          title:
            "3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          descriptions: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: [
        "1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม",
        "2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที",
        "3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย"
      ]
    }
  },
  red6: {
    code: "3 แดง 6",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. ล้างบาดแผลด้วยน้ำสะอาดหลายๆครั้ง ",
          descriptions: ["และใช้น้ำแข็งหรือถุงน้ำแข็งประคบหรือวางไว้บนบาดแผล"]
        },
        {
          title:
            "2. ให้ผู้ป่วยนอนอยู่ในท่าที่บาดแผลงูพิษกัดอยู่ต่ำกว่าระดับหัวใจ ",
          descriptions: [
            "นอนอยู่นิ่งๆ  เคลื่อนไหวร่างกายให้น้อยที่สุด และควรปลอบใจให้ผู้ป่วยสบายใจ"
          ]
        },
        {
          title: "3. รีบนำผู้ป่วยส่งโรงพยาบาลที่ใกล้ที่สุด",
          descriptions: [
            "ถ้านำสัตว์ที่กัดไปด้วยหรือบอกชื่อของสัตว์ที่กัดได้ด้วยยิ่งดี "
          ]
        }
      ],
      notes: [
        "1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคง เพื่อให้ทางเดินหายใจโล่ง  คลายเสื้อผ้าให้หลวม",
        "2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที",
        "3. กดเหล็กในออก(หากทำได้) ,ประคบน้ำแข็งบริเวณที่ถูกต่อย"
      ]
    }
  },
  yellow1: {
    code: "3 เหลือง 1",
    level: level.yellow,
    advise: {
      contents: [
        {
          title: "1. ล้างแผลและรอบบริเวณแผลด้วยสบู่ ",
          descriptions: ["และชะล้างแผลด้วยน้ำสะอาดปริมาณมาก ๆ"]
        },
        {
          title: "2. ซับแผลให้แห้งด้วยผ้าก๊อซที่สะอาด",
          descriptions: []
        },
        {
          title: "3. กรณีแผลเหวะหวะให้ปล่อยแผลไว้",
          descriptions: ["โดยไม่ต้องเย็บแผลแต่ปิดแผลด้วยผ้าก๊อซสะอาด"]
        },
        {
          title:
            "4. แนะนำให้ฉีดยาวัคซีนป้องกันโรคบาดทะยักและวัคคซีนป้องกันพิษสุนัขบ้าที่โรงพยาบาลหรือสถานีอนามัย",
          descriptions: []
        }
      ],
      notes: [
        "หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้แจ้งกลับมาทาง 1669 อีกครั้ง"
      ]
    }
  },
  yellow2: {
    code: "3 เหลือง 2",
    level: level.yellow,
    advise: {
      contents: [
        {
          title: "1. จัดท่านอนศรีษะสูง",
          descriptions: [
            "หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท"
          ]
        },
        {
          title:
            "2. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ",
          descriptions: [
            "จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: [
        "ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล",
        "หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ",
        "กดเหล็กในออก(หากทำได้) , ประคบน้ำแข็งบริเวณที่ถูกต่อย"
      ]
    }
  },
  yellow8: {
    code: "3 เหลือง 8",
    level: level.yellow,
    advise: {
      contents: [],
      notes: []
    }
  },
  yellow9: {
    code: "3 เหลือง 9",
    level: level.yellow,
    advise: {
      contents: [
        {
          title: "1. ล้างแผลและรอบบริเวณแผลด้วยสบู่ ",
          descriptions: ["และชะล้างแผลด้วยน้ำสะอาดปริมาณมาก ๆ"]
        },
        {
          title: "2. ซับแผลให้แห้งด้วยผ้าก๊อซที่สะอาด",
          descriptions: []
        },
        {
          title: "3. กรณีแผลเหวะหวะให้ปล่อยแผลไว้",
          descriptions: ["โดยไม่ต้องเย็บแผลแต่ปิดแผลด้วยผ้าก๊อซสะอาด"]
        },
        {
          title:
            "4. แนะนำให้ฉีดยาวัคซีนป้องกันโรคบาดทะยักและวัคคซีนป้องกันพิษสุนัขบ้าที่โรงพยาบาลหรือสถานีอนามัย",
          descriptions: []
        }
      ],
      notes: [
        "หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้แจ้งกลับมาทาง 1669 อีกครั้ง"
      ]
    }
  },
  white1: {
    code: "3 ขาว 1",
    level: level.white,
    advise: {
      contents: [
        {
          title: "กดเหล็กในออก(หากทำได้)  ",
          descriptions: [
            "ประคบน้ำแข็งบริเวณที่ถูกต่อย ถ้ามีอาการปวด ให้รับประทานยาแก้ปวด  ถ้าคันหรือผิวหนังมีผื่นขึ้น ให้รับประทานยาแก้แพ้ ถ้าอาการไม่ทุเลาลง แนะนำให้มาพบแพทย์ในวันเวลาราชการ"
          ]
        }
      ],
      notes: []
    }
  },
  white2: {
    code: "3 ขาว 2",
    level: level.white,
    advise: {
      contents: [
        {
          title: "1. ล้างแผลและรอบบริเวณแผลด้วยสบู่ ",
          descriptions: ["และชะล้างแผลด้วยน้ำสะอาดปริมาณมาก ๆ"]
        },
        {
          title: "2. ซับแผลให้แห้งด้วยผ้าก๊อซที่สะอาด",
          descriptions: []
        },
        {
          title: "3. กรณีแผลเหวะหวะให้ปล่อยแผลไว้",
          descriptions: ["โดยไม่ต้องเย็บแผลแต่ปิดแผลด้วยผ้าก๊อซสะอาด"]
        },
        {
          title:
            "4. แนะนำให้ฉีดยาวัคซีนป้องกันโรคบาดทะยักและวัคคซีนป้องกันพิษสุนัขบ้าที่โรงพยาบาลหรือสถานีอนามัย",
          descriptions: []
        }
      ],
      notes: [
        "หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้แจ้งกลับมาทาง 1669 อีกครั้ง"
      ]
    }
  },
  white3: {
    code: "3 ขาว 3",
    level: level.white,
    advise: {
      contents: [
        {
          title: "1. ล้างแผลและรอบบริเวณแผลด้วยสบู่ ",
          descriptions: ["และชะล้างแผลด้วยน้ำสะอาดปริมาณมาก ๆ"]
        },
        {
          title: "2. แนะนำให้ผู้ป่วยนอนพัก",
          descriptions: [
            " หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ"
          ]
        }
      ],
      notes: []
    }
  },
  green1: {
    code: "3 เขียว 1",
    level: level.green,
    advise: {
      contents: [],
      notes: []
    }
  }
};

const questions = [
  {
    name: "ผู้ป่วยรู้สึกตัวหรือไม่",
    type: questionType.single,
    from: 0,
    choices: [
      {
        type: choiceType.question,
        name: "ไม่รู้สึกตัว",
        to: 1
      },
      {
        type: choiceType.question,
        name: "รู้สึกตัว",
        to: 2
      },
      {
        type: choiceType.result,
        name: "ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้",
        result: result.yellow9
      }
    ]
  },
  {
    name: "ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่",
    type: questionType.single,
    from: 1,
    choices: [
      {
        type: choiceType.question,
        name: "พอรู้สึกตัว",
        to: 2
      },
      {
        type: choiceType.result,
        name: "ยังคงไม่รู้สึกตัว",
        result: result.red1
      }
    ]
  },
  {
    name: "ลักษณะอาการหายใจเป็นอย่างไร",
    type: questionType.single,
    from: 2,
    choices: [
      {
        type: choiceType.result,
        name: "พูดได้แค่ประโยคสั้นๆ/พูดติดขัด",
        result: result.red2
      },
      {
        type: choiceType.result,
        name: "ซี่โครงบาน จมูกบานไหปลาร้ายุบ",
        result: result.red2
      },
      {
        type: choiceType.result,
        name: "หายใจมีเสียงดัง",
        result: result.red2
      },
      {
        type: choiceType.result,
        name: "ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น",
        result: result.red2
      },
      {
        type: choiceType.result,
        name: "ตัวซีดและเหงือท่วมตัว",
        result: result.red2
      },
      {
        type: choiceType.question,
        name: "หายใจเร็ว",
        to: 3
      },
      {
        type: choiceType.result,
        name: "หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย",
        result: result.red2
      },
      {
        type: choiceType.question,
        name: "พูดได้ / หายใจปกติ",
        to: 5
      }
    ]
  },
  {
    name: "ผู้ป่วยมีโรคหอบหืดหรือไม่",
    type: questionType.single,
    from: 3,
    choices: [
      {
        type: choiceType.result,
        name: "มี",
        result: result.red2
      },
      {
        type: choiceType.question,
        name: "ไม่มี",
        to: 4
      }
    ]
  },
  {
    name: "ผู้ป่วยอายุเท่าไหร่",
    type: questionType.single,
    from: 4,
    choices: [
      {
        type: choiceType.result,
        name: "มากกว่า 20 ปี",
        result: result.red2
      },
      {
        type: choiceType.result,
        name: "น้อยกว่า 20 ปี",
        result: result.yellow8
      }
    ]
  },
  {
    name: "ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่",
    type: questionType.checkbox,
    from: 5,
    to: 6,
    criteria: {
      type: choiceType.result,
      minimum: 2,
      result: result.red3
    },
    choices: [
      {
        name: "เหงื่อท่วมตัว",
        checked: false
      },
      {
        name: "เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน",
        checked: false
      },
      {
        name: "ซีดและผิวซีดเย็น",
        checked: false
      }
    ]
  },
  {
    name: "ผู้ป่วยถูกสัตว์ชนิดใดกัดหรือต่อย",
    type: questionType.single,
    from: 6,
    choices: [
      {
        type: choiceType.result,
        name: "งูพิษ/งูที่ไม่แน่ใจว่ามีพิษ/สัตว์มีพิษ",
        result: result.red6
      },
      {
        type: choiceType.result,
        name: "หอยเต้าปูน",
        result: result.red6
      },
      {
        type: choiceType.result,
        name: "ผึ้ง/แตน/ต่อ",
        result: result.green1
      },
      {
        type: choiceType.question,
        name: "สัตว์อื่นๆ",
        to: 7
      }
    ]
  },
  {
    name: "มีอาการบวม/ฟกช้ำรอบตำแหน่งที่ถูกกัด/เสีย/สัมผัสบ้างหรือไม่",
    type: questionType.single,
    from: 7,
    choices: [
      {
        type: choiceType.result,
        name: "มี",
        result: result.white1
      },
      {
        type: choiceType.result,
        name: "ไม่มี",
        result: result.white3
      }
    ]
  }
];

const module3 = {
  name: "สัตว์กัด",
  module: 3,
  description: "สัตว์กัด",
  image: "assets/imgs/cobra.png",
  questions: questions
};

export default module3;
