import { level, questionType, choiceType, criteriaType } from '../meta';
import { result as module8Result } from './module8';

const result = {
	red1: {
		code: '16 แดง 1',
		level: level.red,
		advise: {
			contents: [
				{
					title: 'มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
					descriptions: [ '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป' ],
				},
				{
					title: 'นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
					descriptions: [
						' พร้อมบอกญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆก่อน กระผม/ดิฉัน จะบอกคุณว่าต้องทำอะไร',
					],
				},
				{
					title: 'สอนวิธีปั๊มหัวใจ',
					descriptions: [
						'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
						'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
						'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเหนื่อยล้า สามารถเปลี่ยนคนได้)',
					],
				},
			],
			notes: [
				'1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
				'2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
				'3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และ ไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย',
				'4. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
			],
		},
	},
	red2: {
		code: '16 แดง 2',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
					descriptions: [ 'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
					descriptions: [],
				},
				{
					title: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
				'2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และ ไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย',
				'3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
			],
		},
	},
	red3: {
		code: '16 แดง 3',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ',
					descriptions: [ 'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
				'2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และ ไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย',
				'3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
			],
		},
	},
	red4: {
		code: '16 แดง 4',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
					descriptions: [],
				},
				{
					title: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
					descriptions: [ 'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย' ],
				},
				{
					title: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
					descriptions: [],
				},
				{
					title: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ', '2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย' ],
		},
	},
	red5: {
		code: '16 แดง 5',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
					descriptions: [],
				},
				{
					title: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
					descriptions: [ 'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย' ],
				},
				{
					title: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
					descriptions: [],
				},
				{
					title: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ', '2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย' ],
		},
	},
	red6: {
		code: '16 แดง 6',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
					descriptions: [],
				},
				{
					title: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
					descriptions: [ 'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย' ],
				},
				{
					title: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
					descriptions: [],
				},
				{
					title: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ', '2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย' ],
		},
	},
	red7: {
		code: '16 แดง 7',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
					descriptions: [],
				},
				{
					title: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
					descriptions: [ 'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย' ],
				},
				{
					title: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
					descriptions: [],
				},
				{
					title: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ', '2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย' ],
		},
	},
	red8: {
		code: '16 แดง 8',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
					descriptions: [],
				},
				{
					title: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
					descriptions: [ 'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย' ],
				},
				{
					title: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
					descriptions: [],
				},
				{
					title: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ', '2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย' ],
		},
	},
	red9: {
		code: '16 แดง 9',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
					descriptions: [],
				},
				{
					title: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
					descriptions: [ 'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย' ],
				},
				{
					title: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
					descriptions: [],
				},
				{
					title: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ', '2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย' ],
		},
	},
	red10: {
		code: '16 แดง 10',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
					descriptions: [],
				},
				{
					title: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
					descriptions: [ 'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย' ],
				},
				{
					title: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
					descriptions: [],
				},
				{
					title: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
				'2. หากหยุดชัก/ อาเจียน /มีอาการซึม ให้จัดท่านอนตะแคงซ้าย หากมีเครื่องตรวจน้ำตาลในเลือด ให้เจาะดูค่าน้ำตาลในเลือดและแจ้งผลแก่เจ้าหน้าที่ ระหว่างรอรถพยาบาลด้วย',
			],
		},
	},
	yellow1: {
		code: '16 เหลือง 1',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
					descriptions: [],
				},
				{
					title: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
					descriptions: [ 'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย' ],
				},
				{
					title: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
					descriptions: [],
				},
				{
					title: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ ',
			],
		},
	},
	yellow2: {
		code: '16 เหลือง 2',
		level: level.yellow,
		advise: {
			contents: [],
			notes: [],
		},
	},
	yellow4: {
		code: '16 เหลือง 4',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
					descriptions: [],
				},
				{
					title: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
					descriptions: [ 'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย' ],
				},
				{
					title: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
					descriptions: [],
				},
				{
					title: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ ',
			],
		},
	},
	yellow5: {
		code: '16 เหลือง 5',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
					descriptions: [],
				},
				{
					title: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
					descriptions: [ 'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย' ],
				},
				{
					title: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
					descriptions: [],
				},
				{
					title: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ ',
			],
		},
	},
	yellow8: {
		code: '16 เหลือง 8',
		level: level.yellow,
		advise: {
			contents: [],
			notes: [],
		},
	},
	yellow9: {
		code: '16 เหลือง 9',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. เคลื่อนย้ายสิ่งของให้ห่างจากผู้ป่วยจนพ้นระยะที่อาจจะกระทบกระแทกได้',
					descriptions: [],
				},
				{
					title: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด ',
					descriptions: [ 'และไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย' ],
				},
				{
					title: '3. ไม่ราดน้ำรดตัวผู้ป่วย และไม่ผูกมัดผู้ป่วย',
					descriptions: [],
				},
				{
					title: '4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ ',
			],
		},
	},
	green1: {
		code: '16 เขียว 1',
		level: level.green,
		advise: {
			contents: [],
			notes: [],
		},
	},
	white1: {
		code: '16 ขาว 1',
		level: level.white,
		advise: {
			contents: [
				{
					title: 'แนะนำให้ผู้ป่วยนอนพัก ',
					descriptions: [
						'หากมีอาการเลือดออกช่องคลอดมากผิดปกติ หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ',
					],
				},
			],
			notes: [],
		},
	},
};

const questions = [
	{
		name: 'ขณะนี้คนไข้กำลังชัก/กระตุกอยุ่หรือไม่',
		type: questionType.single,
		from: 0,
		choices: [
			{
				type: choiceType.result,
				name: 'ใช่',
				result: result.red4,
			},
			{
				type: choiceType.question,
				name: 'ไม่ใช่ / หยุดชักแล้ว',
				to: 1,
			},
		],
	},
	{
		name: 'ผู้ป่วยรู้สึกตัวหรือยัง',
		type: questionType.single,
		from: 1,
		choices: [
			{
				type: choiceType.question,
				name: 'ยังไม่รู้สึกตัว',
				to: 2,
			},
			{
				type: choiceType.question,
				name: 'รู้สึกตัว',
				to: 3,
			},
			{
				type: choiceType.result,
				name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
				result: result.yellow9,
			},
		],
	},
	{
		name: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
		type: questionType.single,
		from: 2,
		choices: [
			{
				type: choiceType.question,
				name: 'พอรู้สึกตัว',
				to: 3,
			},
			{
				type: choiceType.result,
				name: 'ยังคงไม่รู้สึกตัว',
				result: result.red1,
			},
		],
	},
	{
		name: 'ผู้ป่วยพูดหรือมีเสียงร้องออกมาหรือไม่',
		type: questionType.single,
		from: 3,
		choices: [
			{
				type: choiceType.question,
				name: 'ไม่มีเสียงออกมา',
				to: 4,
			},
			{
				type: choiceType.question,
				name: 'มีเสียงออกมา',
				to: 5,
			},
		],
	},
	{
		name: 'ผู้ป่วยตัวเขียวคล้ำหรือไม่',
		type: questionType.single,
		from: 4,
		choices: [
			{
				type: choiceType.result,
				name: 'ใช่',
				result: module8Result.red3,
			},
			{
				type: choiceType.result,
				name: 'ไม่ใช่',
				result: module8Result.red2,
			},
		],
	},
	{
		name: 'ลักษณะอาการหายใจเป็นอย่างไร',
		type: questionType.single,
		from: 5,
		choices: [
			{
				type: choiceType.result,
				name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'หายใจมีเสียงดัง',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'ตัวซีดและเหงือท่วมตัว',
				result: result.red2,
			},
			{
				type: choiceType.question,
				name: 'หายใจเร็ว',
				to: 6,
			},
			{
				type: choiceType.result,
				name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
				result: result.red2,
			},
			{
				type: choiceType.question,
				name: 'พูดได้ / หายใจปกติ',
				to: 8,
			},
		],
	},
	{
		name: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
		type: questionType.single,
		from: 6,
		choices: [
			{
				type: choiceType.result,
				name: 'มี',
				result: result.red2,
			},
			{
				type: choiceType.question,
				name: 'ไม่มี',
				to: 7,
			},
		],
	},
	{
		name: 'ผู้ป่วยอายุเท่าไหร่',
		type: questionType.single,
		from: 7,
		choices: [
			{
				type: choiceType.result,
				name: 'มากกว่า 20 ปี',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'น้อยกว่า 20 ปี',
				result: result.yellow8,
			},
		],
	},
	{
		name: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
		type: questionType.checkbox,
		from: 8,
		to: 9,
		criteria: {
			type: criteriaType.result,
			minimum: 1,
			result: result.red3,
		},
		choices: [
			{
				name: 'เหงื่อท่วมตัว',
				checked: false,
			},
			{
				name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
				checked: false,
			},
			{
				name: 'ซีดและผิวซีดเย็น',
				checked: false,
			},
		],
	},
	{
		name: 'เคยมีประวัติการชักมาก่อนหน้านี้หรือไม่',
		type: questionType.single,
		from: 9,
		choices: [
			{
				type: choiceType.result,
				name: 'ไม่เคย',
				result: result.yellow1,
			},
			{
				type: choiceType.result,
				name: 'เคย',
				result: result.yellow4,
			},
			{
				type: choiceType.result,
				name: 'ไม่มีอาการชัก แต่สัญญาณบอกเหตุการชัก',
				result: result.white1,
			},
			{
				type: choiceType.question,
				name: 'ไม่ทราบ',
				to: 10,
			},
		],
	},
	{
		name: 'เคยมีอาการจากภาวะเครียด/ถูกขัดใจ/ตื่นตระหนก/หายใจมากเกิน ในลักษณะเดียวกันนี้มาก่อนบ้างหรือไม่',
		type: questionType.single,
		from: 10,
		choices: [
			{
				type: choiceType.result,
				name: 'เคย',
				result: result.green1,
			},
			{
				type: choiceType.result,
				name: 'ไม่เคย',
				result: result.yellow2,
			},
			{
				type: choiceType.result,
				name: 'ไม่ทราบ',
				result: result.yellow5,
			},
		],
	},
];

const module16 = {
	name: 'ชัก',
	description: 'มีสัญญาณบอกเหตุการชัก',
	module: 16,
	image: 'assets/imgs/respiratory-system.png',
	color: '#CA1F13',
	questions: questions,
};

export default module16;
