import { level, questionType, choiceType } from '../meta';

const result = {
	red1: {
		code: '8 แดง 1',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
					descriptions: [ '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป' ],
				},
				{
					title: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
					descriptions: [
						' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ',
					],
				},
				{
					title: '3. สอนวิธีปั๊มหัวใจ',
					descriptions: [
						'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
						'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
						'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)',
					],
				},
			],
			notes: [
				'1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
				'2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
				'3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
			],
		},
	},
	red2: {
		code: '8 แดง 2',
		level: level.red,
		advise: {
			contents: [
				{
					title: 'สำหรับผู้ป่วยอายุ 8 ปี ขึ้นไป',
					descriptions: [
						'<b>ผู้ป่วยรู้สึกตัวดี</b>',
						'1. ให้ผู้ป่วยยืนขึ้น  ผู้ช่วยเหลือยืนด้านหลังผู้ป่วย  โอบมือรอบผู้ป่วย  กำมือเป็นกำปั้นวางใต้ลิ้นปี่ตรงกลางเหนือสะดือ',
						'2. ใช้มืออีกข้างหนึ่ง  กุมรอบกำปั้นอีกมือหนึ่งให้แน่  และกระตุกมือดันเข้าหาตัวผู้ป่วยบริเวณใต้ลิ้นปี่  ให้สิ่งแปลกปลอมหลุดออกมา  ถ้ายังไม่หลุดให้ทำซ้ำจนกว่าสิ่งแปลกปลอมจะหลุดออกมา',
						'<b>ผู้ป่วยไม่รู้สึกตัว</b>',
						'1. จัดผู้ป่วยนอนราบกับพื้น',
						'2. ถ้าผู้ป่วยไม่หายใจ  ให้ทำการช่วยหายใจแบบผู้ใหญ่',
						'3. การกดหน้าท้อง  (ABDOMINAL THRUSTS)',
						'3.1  นั่งคร่อมบริเวณเข่าของผู้ป่วย',
						'3.2  วางสันมือตรงบริเวณใต้ลิ้นปี่เหนือสะดือ  มืออีกข้างหนึ่งวางทับบนหลังมือแรก  ให้สันมือตรงกัน',
						'3.3  ออกแรงกระแทกดันไปทางศีรษะผู้ป่วย  ในแนวกึ่งกลางลำตัว  ด้วยความเร็วติดต่อกัน  5  ครั้ง',
						'3.4  อ้าปากผู้ป่วยดูว่าสิ่งแปลกปลอมหลุดออกมาอยู่ในปากผู้ป่วยหรือไม่  ถ้ามีสิ่งแปลกปลอมอยู่ให้ล้วงออก',
						'3.5  ถ้าสิ่งแปลกปลอมยังไม่หลุดออกมา  ให้ทำซ้ำ  ตามข้อ 3.2 - 3.4  จนกระทั่งสิ่งแปลกปลอมหลุดออกมาและผู้ป่วยเริ่มหายใจได้เอง  หรือจนกว่าหน่วยกู้ชีพจะมาถึง',
					],
				},
				{
					title: 'สำหรับเด็กอายุ  1-8 ปี',
					descriptions: [
						'<b>ผู้ป่วยรู้สึกตัวดี ให้กระแทกบริเวณท้องส่วนบน  ในขณะที่เด็กยืนหรือนั่ง</b>',
						'1. ให้ผู้ช่วยเหลือยืนด้านหลังและหันหน้าไปทางเดียวกับผู้ป่วย  โอบรอบตัวผู้ป่วย',
						'2. กำมือข้างหนึ่งเป็นกำปั้น  วางไว้ใต้ลิ้นปี่เหนือสะดือเล็กน้อย',
						'3. มืออีกข้างหนึ่งกุมรอบกำปั้นของมือแรก  ออกแรงกระแทกขึ้นไปทางด้านบนเร็ว ๆ และหลาย ๆ ครั้ง  ทำจนกว่าสิ่งแปลกปลอมจะหลุดออกมา',
						'<b>ผู้ป่วยไม่รู้สึกตัว   ให้กระแทกบริเวณท้องส่วนบน  ในขณะที่เด็กนอนราบ</b>',
						'1. จัดให้เด็กนอนหงาย',
						'2. ผู้ช่วยเหลือคุกเข่าข้างตัวหรือคร่อมบริเวณเข่าของผู้ป่วย',
						'3. วางสันมือข้างหนึ่งบริเวณใต้ลิ้นปี่เหนือสะดือ  มืออีกข้างวางทับบนหลังมือแรก  ให้สันมือตรงกัน',
						'4. ออกแรงกระแทกดันไปทางศีรษะผู้ป่วย  ในแนวกึ่งกลางลำตัว  ด้วยความเร็วติดต่อกัน  5  ครั้ง',
						'5. อ้าปากผู้ป่วยดูว่าสิ่งแปลกปลอมหลุดออกมาอยู่ในปากผู้ป่วยหรือไม่  ถ้ามีสิ่งแปลกปลอมอยู่ให้ล้วงออก',
						'6. ถ้าสิ่งแปลกปลอมยังไม่หลุดออกมา  ให้ทำซ้ำ  ตามข้อ  3 - 4  จนกระทั่งสิ่งแปลกปลอมหลุดออกมาและผู้ป่วยเริ่มหายใจได้เอง  หรือจนกว่าหน่วยกู้ชีพจะมาถึง',
					],
				},
				{
					title: 'สำหรับเด็กทารกอายุต่ำกว่า  1 ปี   ผู้ช่วยเหลือนั่งบนเก้าอี้',
					descriptions: [
						'1. จับให้ทารกคว่ำลงตามแนวมือ  และแขนผู้ช่วยเหลือ  (โดยจับให้แน่นที่ส่วนคางของทารก)  ให้ศีรษะของทารกอยู่ต่ำกว่าลำตัวผู้ช่วยเหลือ',
						'2. ใช้สันมือตบระหว่างกรุดูกสะบักของทารกทั้ง 2 ข้าง 5 ครั้ง',
						'3. หลังจากออกแรงตบบนหลังแล้ว  จับให้ทารกนอนหงายบนท้องแขนส่วนล่าง  โดยวางแขนไว้บนต้นขาของผู้ช่วยเหลือ  และจับศีรษะของทารกให้ศีรษะอยู่ต่ำกว่าลำตัว',
						'4. ใช้นิ้วกลางและนิ้วนางกดแบบกระแทกลงบนกระดูกหน้าอก  เหนือเส้นซึ่งลากเชื่อมระหว่างหัวนมซ้ายกับขวา  กดแบบกระแทก  จำนวน 5 ครั้ง',
						'5. ทำข้อ 2 สลับกับข้อ 4  จนกว่าสิ่งแปลกปลอมจะออกมา',
					],
				},
			],
			notes: [
				'1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
				'2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
				'3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
			],
		},
	},
	red3: {
		code: '8 แดง 3',
		level: level.red,
		advise: {
			contents: [
				{
					title: 'สำหรับผู้ป่วยอายุ 8 ปี ขึ้นไป',
					descriptions: [
						'<b>ผู้ป่วยรู้สึกตัวดี</b>',
						'1. ให้ผู้ป่วยยืนขึ้น  ผู้ช่วยเหลือยืนด้านหลังผู้ป่วย  โอบมือรอบผู้ป่วย  กำมือเป็นกำปั้นวางใต้ลิ้นปี่ตรงกลางเหนือสะดือ',
						'2. ใช้มืออีกข้างหนึ่ง  กุมรอบกำปั้นอีกมือหนึ่งให้แน่  และกระตุกมือดันเข้าหาตัวผู้ป่วยบริเวณใต้ลิ้นปี่  ให้สิ่งแปลกปลอมหลุดออกมา  ถ้ายังไม่หลุดให้ทำซ้ำจนกว่าสิ่งแปลกปลอมจะหลุดออกมา',
						'<b>ผู้ป่วยไม่รู้สึกตัว</b>',
						'1. จัดผู้ป่วยนอนราบกับพื้น',
						'2. ถ้าผู้ป่วยไม่หายใจ  ให้ทำการช่วยหายใจแบบผู้ใหญ่',
						'3. การกดหน้าท้อง  (ABDOMINAL THredUSTS)',
						'3.1  นั่งคร่อมบริเวณเข่าของผู้ป่วย',
						'3.2  วางสันมือตรงบริเวณใต้ลิ้นปี่เหนือสะดือ  มืออีกข้างหนึ่งวางทับบนหลังมือแรก  ให้สันมือตรงกัน',
						'3.3  ออกแรงกระแทกดันไปทางศีรษะผู้ป่วย  ในแนวกึ่งกลางลำตัว  ด้วยความเร็วติดต่อกัน  5  ครั้ง',
						'3.4  อ้าปากผู้ป่วยดูว่าสิ่งแปลกปลอมหลุดออกมาอยู่ในปากผู้ป่วยหรือไม่  ถ้ามีสิ่งแปลกปลอมอยู่ให้ล้วงออก',
						'3.5  ถ้าสิ่งแปลกปลอมยังไม่หลุดออกมา  ให้ทำซ้ำ  ตามข้อ 3.2 - 3.4  จนกระทั่งสิ่งแปลกปลอมหลุดออกมาและผู้ป่วยเริ่มหายใจได้เอง  หรือจนกว่าหน่วยกู้ชีพจะมาถึง',
					],
				},
				{
					title: 'สำหรับเด็กอายุ  1-8 ปี',
					descriptions: [
						'<b>ผู้ป่วยรู้สึกตัวดี ให้กระแทกบริเวณท้องส่วนบน  ในขณะที่เด็กยืนหรือนั่ง</b>',
						'1. ให้ผู้ช่วยเหลือยืนด้านหลังและหันหน้าไปทางเดียวกับผู้ป่วย  โอบรอบตัวผู้ป่วย',
						'2. กำมือข้างหนึ่งเป็นกำปั้น  วางไว้ใต้ลิ้นปี่เหนือสะดือเล็กน้อย',
						'3. มืออีกข้างหนึ่งกุมรอบกำปั้นของมือแรก  ออกแรงกระแทกขึ้นไปทางด้านบนเร็ว ๆ และหลาย ๆ ครั้ง  ทำจนกว่าสิ่งแปลกปลอมจะหลุดออกมา',
						'<b>ผู้ป่วยไม่รู้สึกตัว   ให้กระแทกบริเวณท้องส่วนบน  ในขณะที่เด็กนอนราบ</b>',
						'1. จัดให้เด็กนอนหงาย',
						'2. ผู้ช่วยเหลือคุกเข่าข้างตัวหรือคร่อมบริเวณเข่าของผู้ป่วย',
						'3. วางสันมือข้างหนึ่งบริเวณใต้ลิ้นปี่เหนือสะดือ  มืออีกข้างวางทับบนหลังมือแรก  ให้สันมือตรงกัน',
						'4. ออกแรงกระแทกดันไปทางศีรษะผู้ป่วย  ในแนวกึ่งกลางลำตัว  ด้วยความเร็วติดต่อกัน  5  ครั้ง',
						'5. อ้าปากผู้ป่วยดูว่าสิ่งแปลกปลอมหลุดออกมาอยู่ในปากผู้ป่วยหรือไม่  ถ้ามีสิ่งแปลกปลอมอยู่ให้ล้วงออก',
						'6. ถ้าสิ่งแปลกปลอมยังไม่หลุดออกมา  ให้ทำซ้ำ  ตามข้อ  3 - 4  จนกระทั่งสิ่งแปลกปลอมหลุดออกมาและผู้ป่วยเริ่มหายใจได้เอง  หรือจนกว่าหน่วยกู้ชีพจะมาถึง',
					],
				},
				{
					title: 'สำหรับเด็กทารกอายุต่ำกว่า  1 ปี   ผู้ช่วยเหลือนั่งบนเก้าอี้',
					descriptions: [
						'1. จับให้ทารกคว่ำลงตามแนวมือ  และแขนผู้ช่วยเหลือ  (โดยจับให้แน่นที่ส่วนคางของทารก)  ให้ศีรษะของทารกอยู่ต่ำกว่าลำตัวผู้ช่วยเหลือ',
						'2. ใช้สันมือตบระหว่างกรุดูกสะบักของทารกทั้ง 2 ข้าง 5 ครั้ง',
						'3. หลังจากออกแรงตบบนหลังแล้ว  จับให้ทารกนอนหงายบนท้องแขนส่วนล่าง  โดยวางแขนไว้บนต้นขาของผู้ช่วยเหลือ  และจับศีรษะของทารกให้ศีรษะอยู่ต่ำกว่าลำตัว',
						'4. ใช้นิ้วกลางและนิ้วนางกดแบบกระแทกลงบนกระดูกหน้าอก  เหนือเส้นซึ่งลากเชื่อมระหว่างหัวนมซ้ายกับขวา  กดแบบกระแทก  จำนวน 5 ครั้ง',
						'5. ทำข้อ 2 สลับกับข้อ 4  จนกว่าสิ่งแปลกปลอมจะออกมา',
					],
				},
			],
			notes: [
				'1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
				'2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
				'3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
			],
		},
	},
	yellow1: {
		code: '8 เหลือง 1',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. ไม่ควรนำอาการ หรือน้ำ หรืองสิ่งของใดๆ เข้าไปในปากผู้ป่วย',
					descriptions: [],
				},
				{
					title: '2. ไม่ควรล้วง หรือใช้นิ้วกวาดเข้าไปในปาก',
					descriptions: [],
				},
				{
					title: '3. . กระตุ้นให้ผู้ป่วยไอ จนกว่าสิ่งแปลกปลอมหรือเศษอาหาร จะหลุดออกมา',
					descriptions: [],
				},
			],
			notes: [
				'1. หากผู้ป่วยเริ่มเริ่มพูดไม่มีเสียง หรือไอไม่ได้ ให้ที่ ตาม 8 แดง 2',
				'2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
				'3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
			],
		},
	},
	yellow2: {
		code: '8 เหลือง 2',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. ไม่ควรนำอาการ หรือน้ำ หรืองสิ่งของใดๆ เข้าไปในปากผู้ป่วย',
					descriptions: [],
				},
				{
					title: '2. ไม่ควรล้วง หรือใช้นิ้วกวาดเข้าไปในปาก',
					descriptions: [],
				},
				{
					title: '3. กระตุ้นให้ผู้ป่วยไอ จนกว่าสิ่งแปลกปลอมหรือเศษอาหาร จะหลุดออกมา',
					descriptions: [],
				},
			],
			notes: [
				'1. หากผู้ป่วยเริ่มเริ่มพูดไม่มีเสียง หรือไอไม่ได้ ให้ที่ ตาม 8 แดง 2',
				'2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
				'3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
			],
		},
	},
	yellow8: {
		code: '8 เหลือง 8',
		level: level.yellow,
		advise: {
			contents: [],
			notes: [],
		},
	},
	yellow9: {
		code: '8 เหลือง 9',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
					descriptions: [ 'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
					descriptions: [],
				},
				{
					title: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ' ],
		},
	},
	green1: {
		code: '8 เขียว 1',
		level: level.green,
		advise: {
			contents: [
				{
					title: '1. แนะนำให้ผู้ป่วยนอนอยู่ในท่าที่สบาย',
					descriptions: [ 'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
					descriptions: [],
				},
				{
					title: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ' ],
		},
	},
	white1: {
		code: '8 ขาว 1',
		level: level.green,
		advise: {
			contents: [
				{
					title: 'ให้ผู้ป่วยนอนพัก และอยู่ในท่าที่สบาย',
					descriptions: [
						'หากมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 เพื่อรับฟังคำแนะนำ หากไม่มีอาการเปลี่ยนแปลง แนะนำให้ไปตรวจรักษาที่ รพ.ในวันและเวลาราชการ',
					],
				},
			],
			notes: [],
		},
	},
};

const questions = [
	{
		name: 'ผู้ป่วยรู้สึกตัวหรือไม่',
		type: questionType.button,
		from: 0,
		choices: [
			{
				type: choiceType.question,
				name: 'ไม่รู้สึกตัว',
				to: 1,
			},
			{
				type: choiceType.question,
				name: 'รู้สึกตัว',
				to: 2,
			},
			{
				type: choiceType.result,
				name: 'ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
				result: result.yellow9,
			},
		],
	},
	{
		name: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
		type: questionType.button,
		from: 1,
		choices: [
			{
				type: choiceType.result,
				name: 'ยังคงไม่รู้สึกตัว',
				result: result.red1,
			},
			{
				type: choiceType.question,
				name: 'พอรู้สึกตัว',
				to: 2,
			},
		],
	},
	{
		name: 'ผู้ป่วยพูดหรือมีเสียงร้องออกมาหรือไม่',
		type: questionType.button,
		from: 2,
		choices: [
			{
				type: choiceType.result,
				name: 'ไม่มีเสียงออกมา',
				result: result.red2,
			},
			{
				type: choiceType.question,
				name: 'มีเสียงออกมา',
				to: 3,
			},
		],
	},
	{
		name: 'หายใจโล่งแล้วหรือยัง',
		type: questionType.button,
		from: 3,
		choices: [
			{
				type: choiceType.result,
				name: 'ยังไม่โล่ง',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'โล่งแล้ว',
				result: result.yellow2,
			},
		],
	},
];

const module8 = {
	name: 'สำลัก',
	description: 'อุดกั้นทางเดินหายใจ',
	module: 8,
	image: 'assets/imgs/respiratory-system.png',
	color: '#CA1F13',
	questions: questions,
};

export default module8;
