import { level, questionType, choiceType, criteriaType } from '../meta';
import { result as module8Result } from './module8';

const result = {
	red1: {
		code: '18 แดง 1',
		level: level.red,
		advise: {
			contents: [
				{
					title: 'มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
					descriptions: [ '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป' ],
				},
				{
					title: 'นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
					descriptions: [
						' พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ',
					],
				},
				{
					title: 'สอนวิธีปั๊มหัวใจ',
					descriptions: [
						'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
						'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
						'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)',
					],
				},
			],
			notes: [
				'1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
				'2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
			],
		},
	},
	red2: {
		code: '18 แดง 2',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
					descriptions: [ 'หรือนั่งเพื่อให้หายใจได้สะดวกอยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป',
					descriptions: [],
				},
				{
					title: '3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ', '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด' ],
		},
	},
	red3: {
		code: '18 แดง 3',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1.จัดท่าผู้ป่วยนอนราบศีรษะต่ำ',
					descriptions: [ 'ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ', '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด' ],
		},
	},
	red4: {
		code: '18 แดง 4',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1.จัดท่านอนตะแคงซ้าย',
					descriptions: [ 'อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ', '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด' ],
		},
	},
	red5: {
		code: '18 แดง 5',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1.จัดผู้ป่วยให้นอนอยู่ในท่าที่สบาย',
					descriptions: [ 'ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ อยู่ในพื้นที่อากาศถ่ายเท' ],
				},
				{
					title: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ', '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด' ],
		},
	},
	red6: {
		code: '18 แดง 6',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1.จัดผู้ป่วยให้นอนอยู่ในท่าที่สบาย',
					descriptions: [ 'ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ อยู่ในพื้นที่อากาศถ่ายเท' ],
				},
				{
					title: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ', '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด' ],
		},
	},
	red7: {
		code: '18 แดง 7',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1.จัดผู้ป่วยให้นอนอยู่ในท่าที่สบาย',
					descriptions: [ 'ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ อยู่ในพื้นที่อากาศถ่ายเท' ],
				},
				{
					title: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ', '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด' ],
		},
	},
	red8: {
		code: '18 แดง 8',
		level: level.red,
		advise: {
			contents: [],
			notes: [],
		},
	},
	red9: {
		code: '18 แดง 9',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1.จัดผู้ป่วยให้นอนอยู่ในท่าที่สบาย',
					descriptions: [ 'ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ อยู่ในพื้นที่อากาศถ่ายเท' ],
				},
				{
					title: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ', '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด' ],
		},
	},
	yellow1: {
		code: '18 เหลือง 1',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1.จัดผู้ป่วยให้นอนอยู่ในท่าที่สบาย',
					descriptions: [ 'ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ อยู่ในพื้นที่อากาศถ่ายเท' ],
				},
				{
					title: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
				'3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
			],
		},
	},
	yellow2: {
		code: '18 เหลือง 2',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1.จัดท่านอนศีรษะสูง',
					descriptions: [ 'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
				'3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
			],
		},
	},
	yellow3: {
		code: '18 เหลือง 3',
		level: level.yellow,
		advise: {
			contents: [],
			notes: [],
		},
	},
	yellow6: {
		code: '18 เหลือง 6',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1.จัดท่าผู้ป่วยให้นอนอยู่ในท่าสบาย',
					descriptions: [ 'เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
				'3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
			],
		},
	},
	yellow7: {
		code: '18 เหลือง 7',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1.จัดท่านอนตะแคงซ้าย',
					descriptions: [ 'อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
				'3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
			],
		},
	},
	yellow8: {
		code: '18 เหลือง 8',
		level: level.yellow,
		advise: {
			contents: [],
			notes: [],
		},
	},
	yellow9: {
		code: '18 เหลือง 9',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1.จัดท่าผู้ป่วยให้นอนอยู่ในท่าสบาย',
					descriptions: [ 'เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '2.ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด',
					descriptions: [
						'จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1.ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2.หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
				'3.อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
			],
		},
	},
	green1: {
		code: '18 เขียว 1',
		level: level.green,
		advise: {
			contents: [],
			notes: [],
		},
	},
	white1: {
		code: '18 ขาว 1',
		level: level.white,
		advise: {
			contents: [],
			notes: [],
		},
	},
};

const questions = [
	{
		name: 'ก่อนเกิดอาการนี้ผู้ป่วยเป็นอัมพาตอยู่เดิมหรือไม่',
		type: questionType.single,
		from: 0,
		choices: [
			{
				type: choiceType.module,
				name: 'ใช่',
				module: 17,
			},
			{
				type: choiceType.question,
				name: 'ไม่ใช่',
				to: 1,
			},
		],
	},
	{
		name: 'ผู้ป่วยรู้สึกตัวหรือไม่',
		type: questionType.single,
		from: 1,
		choices: [
			{
				type: choiceType.question,
				name: 'ไม่รู้สึกตัว',
				to: 2,
			},
			{
				type: choiceType.question,
				name: 'รู้สึกตัว',
				to: 3,
			},
			{
				type: choiceType.result,
				name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
				result: result.yellow9,
			},
		],
	},
	{
		name: 'ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
		type: questionType.single,
		from: 2,
		choices: [
			{
				type: choiceType.result,
				name: 'ยังคงไม่รู้สึกตัว',
				result: result.red1,
			},
			{
				type: choiceType.question,
				name: 'พอรู้สึกตัว',
				to: 3,
			},
		],
	},
	{
		name: 'ผู้ป่วยพูดหรือมีเสียงร้องออกมาหรือไม่',
		type: questionType.single,
		from: 3,
		choices: [
			{
				type: choiceType.question,
				name: 'ไม่มีเสียงออกมา',
				to: 8,
			},
			{
				type: choiceType.question,
				name: 'มีเสียงออกมา',
				to: 4,
			},
		],
	},
	{
		name: 'ลักษณะอาการหายใจเป็นอย่างไร',
		type: questionType.single,
		from: 4,
		choices: [
			{
				type: choiceType.result,
				name: 'พูดได้แค่ประโยคสั้นๆ/พูดติดขัด',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'หายใจเร็ว ซี่โครงบาน จมูกบาน ไหปลาร้ายุบ',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'หายใจมีเสียงดัง',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'ตัวซีดและเหงือท่วมตัว',
				result: result.red2,
			},
			{
				type: choiceType.question,
				name: 'หายใจเร็ว',
				to: 5,
			},
			{
				type: choiceType.result,
				name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
				result: result.red2,
			},
			{
				type: choiceType.question,
				name: 'พูดได้ / หายใจปกติ',
				to: 7,
			},
		],
	},
	{
		name: 'ผู้ป่วยมีโรคหอบหืดหรือไม่',
		type: questionType.single,
		from: 5,
		choices: [
			{
				type: choiceType.result,
				name: 'มี',
				result: result.red2,
			},
			{
				type: choiceType.question,
				name: 'ไม่มี',
				to: 6,
			},
		],
	},
	{
		name: 'ผู้ป่วยอายุเท่าไหร่',
		type: questionType.single,
		from: 6,
		choices: [
			{
				type: choiceType.result,
				name: 'มากกว่า 20 ปี',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'น้อยกว่า 20 ปี',
				result: result.yellow8,
			},
		],
	},
	{
		name: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
		type: questionType.checkbox,
		from: 7,
		to: 9,
		criteria: {
			type: criteriaType.result,
			minimum: 1,
			result: result.red3,
		},
		choices: [
			{
				name: 'เหงื่อท่วมตัว',
				checked: false,
			},
			{
				name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน',
				checked: false,
			},
			{
				name: 'ซีดและผิวซีดเย็น',
				checked: false,
			},
		],
	},
	{
		name: 'ผู้ป่วยตัวเขียวคล้ำหรือไม่',
		type: questionType.single,
		from: 8,
		choices: [
			{
				type: choiceType.result,
				name: 'ใช่',
				result: module8Result.red3,
			},
			{
				type: choiceType.result,
				name: 'ไม่ใช่',
				result: module8Result.red2,
			},
		],
	},
	{
		name: 'ผู้ป่วยร่วมมือทำตามคำสั่งง่ายๆ เช่น ยกแขน, แบมือ, กำมือ',
		type: questionType.single,
		from: 9,
		choices: [
			{
				type: choiceType.question,
				name: 'ทำไม่ได้',
				to: 10,
			},
			{
				type: choiceType.result,
				name: 'ไม่อยากทำ',
				result: result.yellow3,
			},
			{
				type: choiceType.question,
				name: 'ทำได้',
				to: 11,
			},
		],
	},
	{
		name: 'มีอาการมานานเท่าไหร่',
		type: questionType.single,
		from: 10,
		choices: [
			{
				type: choiceType.result,
				name: 'น้อยกว่า 3 ชั่วมง',
				result: result.red6,
			},
			{
				type: choiceType.result,
				name: 'มากกว่าหรือเท่ากับ 3 ชั่วโมง',
				result: result.yellow6,
			},
		],
	},
	{
		name: 'ผู้ป่วยเป็นเบาหวาน/ความดันหรือไม่',
		type: questionType.single,
		from: 11,
		choices: [
			{
				type: choiceType.result,
				name: 'ใช่',
				result: result.green1,
			},
			{
				type: choiceType.question,
				name: 'ไม่ใช่',
				to: 12,
			},
		],
	},
	{
		name: 'ผู้ป่วยมีอาการเกร็งกระตุกร่วมด้วยหรือไม่',
		type: questionType.single,
		from: 12,
		choices: [
			{
				type: choiceType.result,
				name: 'มี',
				result: result.red7,
			},
			{
				type: choiceType.question,
				name: 'ไม่มี',
				to: 13,
			},
		],
	},
	{
		name: 'ผู้ป่วยอายุมากกว่า 45 ปีหรือไม่',
		type: questionType.single,
		from: 13,
		choices: [
			{
				type: choiceType.result,
				name: 'มากกว่า 45 ปี',
				result: result.red8,
			},
			{
				type: choiceType.result,
				name: 'น้อยกว่า 45 ปี',
				result: result.yellow7,
			},
		],
	},
	{
		name: 'ผู้ป่วยมีประวัติบาดเจ็บที่ศรีษะมาก่อนหรือไม่ (ภายใน 3 วัน)',
		type: questionType.single,
		from: 14,
		choices: [
			{
				type: choiceType.result,
				name: 'มี',
				result: result.white1,
			},
			{
				type: choiceType.result,
				name: 'ไม่มี',
				result: result.white1,
			},
		],
	},
];

const module18 = {
	name: 'อัมพาต',
	module: 18,
	description: 'กล้ามเนื้ออ่อนแรง, สูญเสียการรับความรู้สึก, ยืนหรือเดินไม่ได้',
	image: 'assets/imgs/patient.png',
	questions: questions,
};

export default module18;
