import { level, questionType, choiceType, criteriaType } from "../meta";
import { result as module14Result } from "./module14";

const result = {
  red1: {
    code: "13 แดง 1",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่",
          descriptions: [
            "<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป"
          ]
        },
        {
          title: "2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง",
          descriptions: [
            " พร้อมบอกญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆก่อน กระผม/ดิฉัน จะบอกคุณว่าต้องทำอะไร"
          ]
        },
        {
          title: "3. สอนวิธีปั๊มหัวใจ",
          descriptions: [
            "ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย",
            "ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา",
            "ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเหนื่อยล้า สามารถเปลี่ยนคนได้)"
          ]
        }
      ],
      notes: [
        "1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย",
        "2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที",
        "3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย"
      ]
    }
  },
  red2: {
    code: "13 แดง 2",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ",
          descriptions: ["หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title: "2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป",
          descriptions: []
        },
        {
          title: "3. ให้ญาติผู้พบเห็นเหตุการณ์",
          descriptions: [
            "เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: [
        "1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ",
        "2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย"
      ]
    }
  },
  red3: {
    code: "13 แดง 3",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. จัดท่าผู้ป่วยนอนราบศีรษะต่ำ",
          descriptions: ["ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title: "2. ให้ญาติผู้พบเห็นเหตุการณ์",
          descriptions: [
            "เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: [
        "1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ",
        "2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย"
      ]
    }
  },
  red4: {
    code: "13 แดง 4",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. จัดท่าผู้ป่วยนอนราบศีรษะต่ำ",
          descriptions: ["ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title: "2. อย่าให้ผู้ป่วยดื่ม หรือกินอะไร เพราะอาจทำให้ผู้ป่วยสำลักได้",
          descriptions: []
        },
        {
          title: "3. ให้ญาติผู้พบเห็นเหตุการณ์",
          descriptions: [
            "เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: ["1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ"]
    }
  },
  red5: {
    code: "13 แดง 5",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. ให้ใช้ผ้าสะอาดกดห้ามเลือดไว้ให้แน่น ไม่เอาผ้าออก",
          descriptions: []
        },
        {
          title: "2. ให้ผู้ป่วยอยู่ในท่าที่สบาย อยู่ในอาการที่ถ่ายเท",
          descriptions: []
        },
        {
          title: "3. ให้ญาติผู้พบเห็นเหตุการณ์",
          descriptions: [
            "เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: ["1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ"]
    }
  },
  red6: {
    code: "13 แดง 6",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. จัดพื้นที่ให้โล่ง ไม่มีสิ่งกีดขวางขณะที่ผู้ป่วยชัก",
          descriptions: []
        },
        {
          title: "2. ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย",
          descriptions: []
        },
        {
          title: "3. ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย",
          descriptions: []
        },
        {
          title: "4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด",
          descriptions: ["และ ไม่สอดสิ่งใดเข้าไปในปากผู้ป่วย"]
        },
        {
          title: "5. ให้ญาติผู้พบเห็นเหตุการณ์",
          descriptions: [
            "เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: [
        "1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ",
        "2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย",
        "3. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง"
      ]
    }
  },
  red7: {
    code: "13 แดง 7",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. พูดคุยด้วยท่าทีเป็นมิตร",
          descriptions: []
        },
        {
          title: "2. สังเกตอาการผู้ป่วย",
          descriptions: ["ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร"]
        },
        {
          title: "3. ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน",
          descriptions: []
        },
        {
          title: "4. หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้ อาจต้องใช้วิธีผูกมัด",
          descriptions: []
        }
      ],
      notes: [
        "1. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย",
        "2. หากผู้ป่วยอาเจียนให้พลิกด้านตะแคงหน้าผู้ป่วยไปด้านใดด้านหนึ่ง"
      ]
    }
  },
  red8: {
    code: "13 แดง 8",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. จัดสิ่งแวดล้อมให้ปลอดภัย",
          descriptions: [
            "ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง"
          ]
        },
        {
          title: "2. ขอความช่วยเหลือจากตำรวจ",
          descriptions: []
        },
        {
          title:
            "3. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน",
          descriptions: []
        },
        {
          title: "4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ",
          descriptions: [
            "เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น"
          ]
        },
        {
          title: "5. พูดคุยด้วยท่าทีเป็นมิตร",
          descriptions: []
        },
        {
          title: "6. สังเกตอาการผู้ป่วย ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร",
          descriptions: []
        },
        {
          title: "7. ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน",
          descriptions: []
        },
        {
          title: "8. หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้ อาจต้องใช้วิธีผูกมัด",
          descriptions: []
        },
        {
          title: "9. ให้ญาติผู้พบเห็นเหตุการณ์",
          descriptions: [
            "เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: []
    }
  },
  red9: {
    code: "13 แดง 9",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. จัดสิ่งแวดล้อมให้ปลอดภัย",
          descriptions: [
            "ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง"
          ]
        },
        {
          title: "2. ขอความช่วยเหลือจากตำรวจ",
          descriptions: []
        },
        {
          title:
            "3. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน",
          descriptions: []
        },
        {
          title: "4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ",
          descriptions: [
            "เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น"
          ]
        },
        {
          title: "5. พูดคุยด้วยท่าทีเป็นมิตร",
          descriptions: []
        },
        {
          title: "6. สังเกตอาการผู้ป่วย ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร",
          descriptions: []
        },
        {
          title: "7. ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน",
          descriptions: []
        },
        {
          title: "8. หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้ อาจต้องใช้วิธีผูกมัด",
          descriptions: []
        },
        {
          title: "9. ให้ญาติผู้พบเห็นเหตุการณ์",
          descriptions: [
            "เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: []
    }
  },
  yellow1: {
    code: "13 เหลือง 1",
    level: level.yellow,
    advise: {
      contents: [
        {
          title: "1. จัดสิ่งแวดล้อมให้ปลอดภัย",
          descriptions: [
            "ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง"
          ]
        },
        {
          title: "2. ขอความช่วยเหลือจากตำรวจ",
          descriptions: []
        },
        {
          title:
            "3. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน",
          descriptions: []
        },
        {
          title: "4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ",
          descriptions: [
            "เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น"
          ]
        },
        {
          title: "5. พูดคุยด้วยท่าทีเป็นมิตร",
          descriptions: []
        },
        {
          title: "6. สังเกตอาการผู้ป่วย ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร",
          descriptions: []
        },
        {
          title: "7. ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน",
          descriptions: []
        },
        {
          title: "8. หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้ อาจต้องใช้วิธีผูกมัด",
          descriptions: []
        },
        {
          title: "9. ให้ญาติผู้พบเห็นเหตุการณ์",
          descriptions: [
            "เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: ["หากมีบาดแผล ให้ใช้ผ้าสะอาดปิดแผล"]
    }
  },
  yellow4: {
    code: "13 เหลือง 4",
    level: level.yellow,
    advise: {
      contents: [
        {
          title: "1. จัดสิ่งแวดล้อมให้ปลอดภัย",
          descriptions: [
            "ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง"
          ]
        },
        {
          title: "2. ขอความช่วยเหลือจากตำรวจ",
          descriptions: []
        },
        {
          title:
            "3. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน",
          descriptions: []
        },
        {
          title: "4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ",
          descriptions: [
            "เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น"
          ]
        },
        {
          title: "5. พูดคุยด้วยท่าทีเป็นมิตร",
          descriptions: []
        },
        {
          title: "6. สังเกตอาการผู้ป่วย ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร",
          descriptions: []
        },
        {
          title: "7. ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน",
          descriptions: []
        },
        {
          title: "8. หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้ อาจต้องใช้วิธีผูกมัด",
          descriptions: []
        },
        {
          title: "9. ให้ญาติผู้พบเห็นเหตุการณ์",
          descriptions: [
            "เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: []
    }
  },
  yellow5: {
    code: "13 เหลือง 5",
    level: level.yellow,
    advise: {
      contents: [
        {
          title: "1. จัดสิ่งแวดล้อมให้ปลอดภัย",
          descriptions: [
            "ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง"
          ]
        },
        {
          title: "2. ขอความช่วยเหลือจากตำรวจ",
          descriptions: []
        },
        {
          title:
            "3. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน",
          descriptions: []
        },
        {
          title: "4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ",
          descriptions: [
            "เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น"
          ]
        },
        {
          title: "5. พูดคุยด้วยท่าทีเป็นมิตร",
          descriptions: []
        },
        {
          title: "6. สังเกตอาการผู้ป่วย ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร",
          descriptions: []
        },
        {
          title: "7. ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน",
          descriptions: []
        },
        {
          title: "8. หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้ อาจต้องใช้วิธีผูกมัด",
          descriptions: []
        },
        {
          title: "9. ให้ญาติผู้พบเห็นเหตุการณ์",
          descriptions: [
            "เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: []
    }
  },
  yellow8: {
    code: "13 เหลือง 8",
    level: level.yellow,
    advise: {
      contents: [],
      notes: []
    }
  },
  yellow9: {
    code: "13 เหลือง 9",
    level: level.yellow,
    advise: {
      contents: [
        {
          title: "1. จัดสิ่งแวดล้อมให้ปลอดภัย",
          descriptions: [
            "ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง"
          ]
        },
        {
          title: "2. ขอความช่วยเหลือจากตำรวจ",
          descriptions: []
        },
        {
          title:
            "3. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน",
          descriptions: []
        },
        {
          title: "4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ",
          descriptions: [
            "เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น"
          ]
        },
        {
          title: "5. พูดคุยด้วยท่าทีเป็นมิตร",
          descriptions: []
        },
        {
          title: "6. สังเกตอาการผู้ป่วย ระวังไม่ควรเข้าใกล้ผู้ป่วยมาก อยู่ห่างจากผู้ป่วยประมาณ 8 เมตร",
          descriptions: []
        },
        {
          title: "7. ควรนั่งอยู่ในระดับที่มองเห็นผู้ป่วยได้ชัดเจน",
          descriptions: []
        },
        {
          title: "8. หากผู้ป่วยมีแนวโน้มควบคุมตัวเองไม่ได้ อาจต้องใช้วิธีผูกมัด",
          descriptions: []
        },
        {
          title: "9. ให้ญาติผู้พบเห็นเหตุการณ์",
          descriptions: [
            "เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: []
    }
  },
  green1: {
    code: "13 เขียว 1",
    level: level.green,
    advise: {
      contents: [
        {
          title: "1. จัดสิ่งแวดล้อมให้ปลอดภัย",
          descriptions: [
            "ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง"
          ]
        },
        {
          title:
            "2. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน",
          descriptions: []
        },
        {
          title: "3. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ",
          descriptions: [
            "เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น"
          ]
        }
      ],
      notes: []
    }
  },
  green4: {
    code: "13 เขียว 4",
    level: level.green,
    advise: {
      contents: [
        {
          title: "1. จัดท่าผู้ป่วยนอนอยู่ในท่าที่สบาย",
          descriptions: ["และอยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title: "2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป",
          descriptions: []
        },
        {
          title: "3. หากทำตามคำแนะนำข้อ 3 แล้วไม่ดีขึ้น ให้โทรแจ้ง 1669 อีกครั้ง",
          descriptions: []
        },
        {
          title: "4. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          descriptions: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: []
    }
  },
  green5: {
    code: "13 เขียว 5",
    level: level.green,
    advise: {
      contents: [
        {
          title: "แนะนำให้ผู้ป่วยนอนพัก",
          descriptions: [
            "และให้ญาติสังเกตอาการผู้ป่วย หากมีอาการเปลี่ยนแปลงให้โทร 1669 เพื่อรับวิธีการปฐมพยาบาล หากอาการยังไม่ดีขึ้นให้ญาตินำผู้ป่วยส่งโรงพยาบาลที่ใกล้ที่สุด"
          ]
        }
      ],
      notes: []
    }
  },
  green6: {
    code: "13 เขียว 6",
    level: level.green,
    advise: {
      contents: [
        {
          title: "1. จัดสิ่งแวดล้อมให้ปลอดภัย ",
          descriptions: [
            "ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง"
          ]
        },
        {
          title: "2. ขอความช่วยเหลือจากตำรวจ",
          descriptions: []
        },
        {
          title:
            "3. .  ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น ทำร้ายตัวเองหรือทรัพย์สิน",
          descriptions: []
        },
        {
          title: "4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ",
          descriptions: [
            " เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น"
          ]
        }
      ],
      notes: []
    }
  },
  green7: {
    code: "13 เขียว 7",
    level: level.green,
    advise: {
      contents: [
        {
          title: "1. จัดสิ่งแวดล้อมให้ปลอดภัย ",
          descriptions: [
            "ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง"
          ]
        },
        {
          title:
            "2. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น ทำร้ายตัวเองหรือทรัพย์สิน",
          descriptions: []
        },
        {
          title: "3. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ",
          descriptions: [
            " เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น"
          ]
        }
      ],
      notes: []
    }
  },
  green8: {
    code: "13 เขียว 8",
    level: level.green,
    advise: {
      contents: [
        {
          title: "ล้างตาด้วยน้ำสะอาด ไม่แนะนำให้ใช้ยาหยอดตาหรือยาป้ายตา ",
          descriptions: [
            "ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง"
          ]
        }
      ],
      notes: [
        "ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล  หากอาการยังไม่ดีขึ้นให้ญาตินำผู้ป่วยส่งโรงพยาบาลใกล้บ้าน"
      ]
    }
  },
  green9: {
    code: "13 เขียว 9",
    level: level.green,
    advise: {
      contents: [],
      notes: []
    }
  },
  white1: {
    code: "13 ขาว 1",
    level: level.green,
    advise: {
      contents: [
        {
          title: "แนะนำให้ผู้ป่วยนอนพัก",
          descriptions: ["และให้ญาติสังเกตอาการผู้ป่วย หากไม่มีอาการผิดปกติ ให้มาพบแพทย์ในวันและเวลาราชการ"]
        }
      ],
      notes: [
        "จัดสิ่งแวดล้อมให้ปลอดภัย ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง",
        "ขอความช่วยเหลือจากตำรวจ",
        "ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น  ทำร้ายตัวเองหรือทรัพย์สิน",
        "ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก  เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น"
      ]
    }
  },
  white8: {
    code: "13 ขาว 8",
    level: level.white,
    advise: {
      contents: [
        {
          title: "1. จัดสิ่งแวดล้อมให้ปลอดภัย ",
          descriptions: [
            "ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง"
          ]
        },
        {
          title: "2. ขอความช่วยเหลือจากตำรวจ",
          descriptions: []
        },
        {
          title:
            "3. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น ทำร้ายตัวเองหรือทรัพย์สิน",
          descriptions: []
        },
        {
          title: "4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ",
          descriptions: [
            " เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น"
          ]
        }
      ],
      notes: []
    }
  },
  white9: {
    code: "13 ขาว 9",
    level: level.white,
    advise: {
      contents: [
        {
          title: "1. จัดสิ่งแวดล้อมให้ปลอดภัย ",
          descriptions: [
            "ระวังอันตรายที่อาจเกิดขึ้นกับผู้ป่วยและผู้อื่น  ให้เคลื่อนย้ายวัตถุสิ่งของมีคมออกจากบริเวณใกล้เคียง"
          ]
        },
        {
          title: "2. ขอความช่วยเหลือจากตำรวจ",
          descriptions: []
        },
        {
          title:
            "3. ไม่สร้างสิ่งกระตุ้นหรือสิ่งเร้าที่ทำให้ผู้ป่วยหวาดระแวงและอาจทำร้ายผู้อื่น ทำร้ายตัวเองหรือทรัพย์สิน",
          descriptions: []
        },
        {
          title: "4. ผู้ช่วยเหลือให้อยู่บริเวณทางออกที่สะดวก ",
          descriptions: [
            " เช่น  บริเวณประตู  ปากซอย  เพื่อความปลอดภัยของตนเอง  ในกรณีผู้ป่วยคลุ้มคลั่งและจะทำร้ายผู้อื่น"
          ]
        }
      ],
      notes: []
    }
  }
};

const questions = [
  {
    name: "สถานการณ์ปลอดภัยหรือไม่",
    type: questionType.single,
    from: 0,
    choices: [
      {
        type: choiceType.question,
        name: "ปลอดภัย",
        to: 1
      },
      {
        type: choiceType.result,
        name: "ไม่ปลอดภัย",
        result: result.green9
      }
    ]
  },
  {
    name: "ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่",
    type: questionType.checkbox,
    from: 1,
    to: 2,
    criteria: {
      type: criteriaType.result,
      minimum: 2,
      result: result.red3
    },
    choices: [
      {
        name: "เหงื่อท่วมตัว",
        checked: false
      },
      {
        name: "เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน",
        checked: false
      },
      {
        name: "ซีดและผิวซีดเย็น",
        checked: false
      }
    ]
  },
  {
    name: "ผู้ป่วยมีเลือดออกหรือไม่",
    type: questionType.single,
    from: 2,
    choices: [
      {
        type: choiceType.question,
        name: "ใช่",
        to: 3
      },
      {
        type: choiceType.question,
        name: "ไม่ใช่",
        to: 4
      }
    ]
  },
  {
    name: "ห้ามเลือดแล้วหยุดหรือไม่",
    type: questionType.single,
    from: 3,
    choices: [
      {
        type: choiceType.result,
        name: "ไม่หยุด",
        result: result.red5
      },
      {
        type: choiceType.result,
        name: "หยุด",
        result: result.green5
      },
      {
        type: choiceType.result,
        name: "ไม่สามารถห้ามเลือดได้",
        result: result.red5
      }
    ]
  },
  {
    name: "ผู้ป่วยมีทำร้ายตนเองหรือไม่",
    type: questionType.single,
    from: 4,
    choices: [
      {
        type: choiceType.question,
        name: "ใช่",
        to: 5
      },
      {
        type: choiceType.question,
        name: "ไม่ใช่",
        to: 6
      }
    ]
  },
  {
    name: "ด้วยวิธีใด",
    type: questionType.single,
    from: 5,
    choices: [
      {
        type: choiceType.result,
        name: "การยิง / การแทง / การบดทับ (มีบาดแผลทะลวง)",
        result: result.red8
      },
      {
        type: choiceType.result,
        name: "วิธีอื่น เช่น กระโดกจากที่สูง การแขวนคอ การกระแทก การตี การฟัน ใช้ของมีคมกรีดร่างกาย",
        result: result.red8
      },
      {
        type: choiceType.result,
        name: "ใช้สารป้องกันตัว เช่น แก็สน้ำตา สเปรยร์พริกไทย",
        result: result.green8
      },
      {
        type: choiceType.result,
        name: "อื่นๆ",
        result: result.green1
      }
    ]
  },
  {
    name: "มีตัวประกันหรือไม่",
    type: questionType.single,
    from: 6,
    choices: [
      {
        type: choiceType.result,
        name: "มี",
        result: result.red9
      },
      {
        type: choiceType.question,
        name: "ไม่มี",
        to: 7
      }
    ]
  },
  {
    name: "ผู้ป่วยกินยาเกินขนาด / สารพิษ / แอลกอฮอล์ ก่อนมีอาการหรือไม่",
    type: questionType.single,
    from: 7,
    choices: [
      {
        type: choiceType.question,
        name: "ใช่",
        to: 8
      },
      {
        type: choiceType.question,
        name: "ไม่ใช่",
        to: 12
      },
      {
        type: choiceType.question,
        name: "ไม่แน่ใจ / ไม่ทราบ",
        to: 12
      }
    ]
  },
  {
    name: "ผู้ป่วยได้รับยา / สารอะไรเข้าสู่ร่างกาย",
    type: questionType.single,
    from: 8,
    choices: [
      {
        type: choiceType.result,
        name: "ยา",
        result: module14Result.green4
      },
      {
        type: choiceType.result,
        name: "สารเคมีที่ใช้ในการเกษตร",
        result: module14Result.red9
      },
      {
        type: choiceType.question,
        name: "สารกัดกร่อน / สารเคมีอื่น (ที่ไม่ใช่อาหาร/ยา)",
        to: 9
      },
      {
        type: choiceType.result,
        name: "ยา / สารเสพติด / เพื่อความเพลิดเพลิน เช่น ยาบ้า ยาอี กาว",
        result: module14Result.green3
      },
      {
        type: choiceType.question,
        name: "สารป้องกันตัว เช่น แก็สน้ำตา สเปรย์พริกไทย",
        to: 11
      }
    ]
  },
  {
    name: "ผู้ป่วยกลืน (น้ำลาย น้ำ อาหาร) ลำบากหรือไม่",
    type: questionType.single,
    from: 9,
    choices: [
      {
        type: choiceType.result,
        name: "กลืนลำบาก",
        result: module14Result.red9
      },
      {
        type: choiceType.question,
        name: "กลืนได้ปกติ",
        to: 10
      }
    ]
  },
  {
    name: "มีอาการผิดปกติอื่นหรือไม่ เช่น เจ็บคอ ปวดท้อง ปวดศรีษะ คัน วิงเวียน",
    type: questionType.single,
    from: 10,
    choices: [
      {
        type: choiceType.result,
        name: "มี",
        result: module14Result.yellow4
      },
      {
        type: choiceType.result,
        name: "ไม่มี",
        result: module14Result.green5
      }
    ]
  },
  {
    name: "มีอาการผิดปกติหรือไม่ เช่น ปวดท้อง ปวดศรีษะ คัน วิงเวียน",
    type: questionType.single,
    from: 11,
    choices: [
      {
        type: choiceType.result,
        name: "มี",
        result: module14Result.green8
      },
      {
        type: choiceType.result,
        name: "ไม่มี",
        result: module14Result.white1
      }
    ]
  },
  {
    name: "ผู้ป่วยมีอาการชักร่วมด้วยหรือไม่",
    type: questionType.single,
    from: 12,
    choices: [
      {
        type: choiceType.result,
        name: "ชัก",
        result: result.red6
      },
      {
        type: choiceType.question,
        name: "ไม่ชัก",
        to: 13
      }
    ]
  },
  {
    name:
      "ตำรวจ / เจ้าหน้าที่ระงับภัยร้องขอการเตรียมพร้อมเนื่องจากผู้ป่วยมีภาวะคุกคาม อันอาจจะเป็นภยันอันตรายต่อตนเอง/ผู้อื่น หรือไม่",
    type: questionType.single,
    from: 13,
    choices: [
      {
        type: choiceType.result,
        name: "ใช่",
        result: result.red7
      },
      {
        type: choiceType.question,
        name: "ไม่ใช่",
        to: 14
      }
    ]
  },
  {
    name: "พิจารณาแจ้งตำรวจ",
    type: questionType.single,
    from: 14,
    choices: [
      {
        type: choiceType.result,
        name: "แจ้งตำรวจ",
        result: result.white9
      },
      {
        type: choiceType.result,
        name: "ไม่แจ้งตำรวจ",
        result: result.white8
      }
    ]
  }
];

const module13 = {
  name: "คลุ้มคลั่ง",
  description: "ภาวะทางจิตประสาท, อารมณ์",
  module: 13,
  image: "assets/imgs/angry-man.png",
  color: "#FF85A7",
  questions: questions
};

export default module13;
