import { level, questionType, choiceType, criteriaType } from '../meta';
import { result as module14Result } from './module14';

const result = {
	red1: {
		code: '22 แดง 1',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่',
					descriptions: [ '<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป' ],
				},
				{
					title: '2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง',
					descriptions: [
						' พร้อมบอกญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆก่อน กระผม/ดิฉัน จะบอกคุณว่าต้องทำอะไร',
					],
				},
				{
					title: 'สอนวิธีปั๊มหัวใจ',
					descriptions: [
						'ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย',
						'ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา',
						'ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเหนื่อยล้า สามารถเปลี่ยนคนได้)',
					],
				},
			],
			notes: [
				'1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย',
				'2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที',
				'3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด และไม่ราดน้ำรดตัวผู้ป่วย',
			],
		},
	},
	red2: {
		code: '22 แดง 2',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. กรณีกระแสไฟฟ้ารั่วไหลให้ตัดกระแสไฟฟ้า ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ',
					descriptions: [ ' หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '4.กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ' ],
		},
	},
	red3: {
		code: '22 แดง 3',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. กรณีกระแสไฟฟ้ารั่วไหลให้ตัดกระแสไฟฟ้า ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. จัดท่าผู้ป่วยนอนราบศีรษะต่ำ',
					descriptions: [ ' ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '4.กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ' ],
		},
	},
	red4: {
		code: '22 แดง 4',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. กรณีกระแสไฟฟ้ารั่วไหลให้ตัดกระแสไฟฟ้า ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. จัดท่านอนตะแคงซ้าย',
					descriptions: [ 'อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '3. หากผู้ป่วยชัก ไม่งัดหรือใส่ของแข็งเข้าไปในปากผู้ป่วย และไม่ราดน้ำรดตัวผู้ป่วย',
					descriptions: [],
				},
				{
					title: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด  ',
					descriptions: [],
				},
				{
					title: '5. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ' ],
		},
	},
	red5: {
		code: '22 แดง 5',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. กรณีกระแสไฟฟ้ารั่วไหลให้ตัดกระแสไฟฟ้า ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. ปลอบโยนให้ผู้ป่วยอยู่ในความสงบ  ',
					descriptions: [ 'จัดท่าผู้ป่วยให้อยู่ในท่าที่สบาย' ],
				},
				{
					title: '3. หากกดห้ามเลือดไม่หยุด ให้ทำการขันชะเนาะ',
					descriptions: [
						'โดยใช้ผ้าที่หนาประมาณ 1 .5 นิ้ว รัดเหนือบาดแผลประมาณ 5-10 ซม. รัดจนกว่าเลือดจนจะหยุด หรือจนคลำชีพจรไม่ได้  พร้อมบันทึกเวลาที่ทำการขันชะเนาะไว้ด้วย',
					],
				},
				{
					title: '4. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด  ',
					descriptions: [],
				},
				{
					title: '5. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '6. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ' ],
		},
	},
	red6: {
		code: '22 แดง 6',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. กรณีกระแสไฟฟ้ารั่วไหลให้ตัดกระแสไฟฟ้า ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
					descriptions: [ 'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศ' ],
				},
				{
					title: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ' ],
		},
	},
	red7: {
		code: '22 แดง 7',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. กรณีกระแสไฟฟ้ารั่วไหลให้ตัดกระแสไฟฟ้า ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง',
					descriptions: [ 'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศ' ],
				},
				{
					title: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ' ],
		},
	},
	red8: {
		code: '22 แดง 8',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. จัดท่านอนตะแคงซ้าย',
					descriptions: [ 'เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ' ],
		},
	},
	red9: {
		code: '22 แดง 9',
		level: level.red,
		advise: {
			contents: [
				{
					title: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. จัดท่านอนตะแคงซ้าย',
					descriptions: [ 'เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [ '1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ' ],
		},
	},
	yellow1: {
		code: '22 เหลือง 1',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. ใช้น้ำล้างบริเวณที่ถูกราด และปิดแผลด้วยผ้าสะอาด',
					descriptions: [],
				},
				{
					title: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
			],
		},
	},
	yellow2: {
		code: '22 เหลือง 2',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. จัดท่านอนศีรษะสูง',
					descriptions: [ 'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
			],
		},
	},
	yellow3: {
		code: '22 เหลือง 3',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. จัดท่านอนตะแคงซ้าย',
					descriptions: [ 'เพื่อเปิดทางเดินหายใจให้โล่ง อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
			],
		},
	},
	yellow4: {
		code: '22 เหลือง 4',
		level: level.yellow,
		advise: {
			contents: [],
			notes: [],
		},
	},
	yellow5: {
		code: '22 เหลือง 5',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. ใช้น้ำล้างตาแบบไหลผ่าน',
					descriptions: [ 'ล้างด้วยน้ำจำนวนมาก และปิดตาด้วยผ้าสะอาด' ],
				},
				{
					title: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
			],
		},
	},
	yellow6: {
		code: '22 เหลือง 6',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. ใช้น้ำล้างตาแบบไหลผ่าน',
					descriptions: [ 'ล้างด้วยน้ำจำนวนมาก และปิดตาด้วยผ้าสะอาด' ],
				},
				{
					title: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
			],
		},
	},
	yellow7: {
		code: '22 เหลือง 7',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. จัดท่าผู้ป่วยให้นอนอยู่ในท่าที่สบาย',
					descriptions: [ 'หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท' ],
				},
				{
					title: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
			],
		},
	},
	yellow8: {
		code: '22 เหลือง 8',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. ใช้น้ำล้างบริเวณที่ถูกลวก และปิดแผลด้วยผ้าสะอาด',
					descriptions: [],
				},
				{
					title: '3. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '4. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '5. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
			],
		},
	},
	yellow9: {
		code: '22 เหลือง 9',
		level: level.yellow,
		advise: {
			contents: [
				{
					title: '1. ตัดกระแสไฟฟ้ากรณีกระแสไฟฟ้ารั่วไหล ',
					descriptions: [
						'และเคลื่อนย้ายผู้ป่วยมายังสถานที่ที่ปลอดภัย หรือนำผู้ป่วยออกจากแหล่งความร้อน หากสวมใส่เครื่องประดับที่นำความร้อนให้ถอดออก',
					],
				},
				{
					title: '2. อย่าให้ผู้ป่วยดื่ม/กิน สิ่งใด',
					descriptions: [],
				},
				{
					title: '3. กรณีสารเคมีปนเปื้อน กรณีสารเคมีปนเปื้อน ให้ถอดเสื้อผ้าที่เปื้อนสารเคมี ',
					descriptions: [ 'ให้ถอดเสื้อผ้าที่ปนเปื้อนออก  กรณีสารเคมีเข้าตา ให้รินน้ำผ่านตามากๆ กรณีสารเคมีเป็นผง ให้ปัดออกห้ามใช้น้ำล้าง' ],
				},
				{
					title: '4. ให้ญาติผู้พบเห็นเหตุการณ์',
					descriptions: [
						'เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล',
					],
				},
			],
			notes: [
				'1. ผู้ป่วยมีอาการเปลี่ยนแปลงให้โทร 1669 อีกครั้ง เพื่อรับวิธีการปฐมพยาบาล ระหว่างรอรถพยาบาล',
				'2. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ',
			],
		},
	},
	green3: {
		code: '22 เขียว 3',
		level: level.green,
		advise: {
			contents: [
				{
					title: 'แนะนำให้งดใช้อุปกรณ์ที่ถูกช็อค',
					descriptions: [ 'และให้ญาตินำผู้ป่วยไปรับรักษาที่โรงพยาบาลใกล้บ้าน' ],
				},
			],
			notes: [],
		},
	},
	green5: {
		code: '22 เขียว 5',
		level: level.green,
		advise: {
			contents: [],
			notes: [],
		},
	},
	green6: {
		code: '22 เขียว 6',
		level: level.green,
		advise: {
			contents: [
				{
					title: 'ให้ล้างแผลด้วยน้ำเย็นสะอาด',
					descriptions: [ 'ปิดแผลด้วยผ้าสะอาดและให้ญาตินำผู้ป่วยไปรับรักษาที่โรงพยาบาลใกล้บ้าน' ],
				},
			],
			notes: [],
		},
	},
	green7: {
		code: '22 เขียว 7',
		level: level.green,
		advise: {
			contents: [],
			notes: [],
		},
	},
	green8: {
		code: '22 เขียว 8',
		level: level.green,
		advise: {
			contents: [
				{
					title: 'ให้ล้างตาด้วยน้ำสะอาดจำนวนมาก',
					descriptions: [ 'ปิดตาด้วยผ้าสะอาด  หากอาการไม่ดีขึ้น และให้ญาตินำผู้ป่วยไปรับรักษาที่โรงพยาบาลใกล้บ้าน' ],
				},
			],
			notes: [],
		},
	},
	white1: {
		code: '22 ขาว 1',
		level: level.white,
		advise: {
			contents: [
				{
					title: 'แนะนำให้ผู้ป่วยล้างแผลด้วยน้ำสบู่',
					descriptions: [
						'ปิดแผลด้วยผ้าสะอาด  หากมีแผลบวมแดง น้ำเหลืองซึมมีไข้ หายใจเหนื่อย ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ',
					],
				},
			],
			notes: [],
		},
	},
	white2: {
		code: '22 ขาว 2',
		level: level.white,
		advise: {
			contents: [
				{
					title: 'แนะนำให้ผู้ป่วยนอนพัก',
					descriptions: [
						'ให้ความอบอุ่นแก่ร่างกาย หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ',
					],
				},
			],
			notes: [],
		},
	},
	white3: {
		code: '22 ขาว 3',
		level: level.white,
		advise: {
			contents: [
				{
					title: 'แนะนำให้ผู้ป่วยแช่น้ำเย็น 5-10 นาที แล้วเช็ดให้แห้ง ปิดแผลด้วยผ้าสะอาด ',
					descriptions: [
						'ให้ความอบอุ่นแก่ร่างกาย หากมีอาการแน่นหน้าอก  หายใจติดขัด เหงื่อออกตัวเย็น ซึมลง ให้รีบมาพบแพทย์ทันที  หากไม่มีอาการดังกล่าว ให้มาพบแพทย์ในวันเวลาราชการ',
					],
				},
			],
			notes: [],
		},
	},
};

const questions = [
	{
		name: 'ผู้ป่วยรู้สึกตัวหรือไม่',
		type: questionType.single,
		from: 0,
		choices: [
			{
				type: choiceType.question,
				name: 'ไม่รู้สึกตัว',
				to: 1,
			},
			{
				type: choiceType.result,
				name: 'ตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้',
				result: result.yellow9,
			},
			{
				type: choiceType.result,
				name: 'กำลังชัก',
				result: result.red6,
			},
			{
				type: choiceType.question,
				name: 'รู้สึกตัว',
				to: 2,
			},
		],
	},
	{
		name: 'อย่าขยับตัวผู้ป่วย (โดยเฉพาะส่วนศรีษะและคอ) แล้วเรียกผู้ป่วยด้วยเสียงดังๆ ผู้ป่วยรู้สึกตัวขึ้นหรือไม่',
		type: questionType.single,
		from: 1,
		choices: [
			{
				type: choiceType.result,
				name: 'ยังคงไม่รู้สึกตัว',
				result: result.red1,
			},
			{
				type: choiceType.question,
				name: 'พอรู้สึกตัว',
				to: 2,
			},
		],
	},
	{
		name: 'ลักษณะอาการหายใจเป็นอย่างไร',
		type: questionType.single,
		from: 2,
		choices: [
			{
				type: choiceType.result,
				name: 'พูดได้แค่สั้นๆ / พูดติดขัด',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'หายใจเร็ว ซี่โครงบาน จมูกบานไหปลาร้ายุบ',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'หายใจมีเสียงดัง',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'ตัวซีดและเหงือท่วมตัว',
				result: result.red2,
			},
			{
				type: choiceType.result,
				name: 'หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย',
				result: result.red2,
			},
			{
				type: choiceType.question,
				name: 'พูดได้ / หายใจปกติ',
				to: 3,
			},
		],
	},
	{
		name: 'ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่',
		type: questionType.checkbox,
		from: 3,
		to: 4,
		criteria: {
			type: criteriaType.result,
			minimum: 2,
			result: result.red3,
		},

		choices: [
			{
				name: 'เหงื่อท่วมตัว',
				checked: false,
			},
			{
				name: 'เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยิืน',
				checked: false,
			},
			{
				name: 'ซีดและผิวซีดเย็ด',
				checked: false,
			},
		],
	},
	{
		name: 'ผู้ป่วยชักหลังการบาดเจ็บหรือไม่',
		type: questionType.single,
		from: 4,
		choices: [
			{
				type: choiceType.result,
				name: 'ชัก',
				result: result.red6,
			},
			{
				type: choiceType.question,
				name: 'ไม่ชัก',
				to: 5,
			},
		],
	},
	{
		name: 'ขณะนี้ผู้ป่วยยังมีเลือดออกอยู่หรือไม่',
		type: questionType.single,
		from: 5,
		choices: [
			{
				type: choiceType.question,
				name: 'เลือดยังไหลอยู่',
				to: 6,
			},
			{
				type: choiceType.question,
				name: 'ไม่มีเลือดออก/เลือดหยุดแล้ว',
				to: 7,
			},
		],
	},
	{
		name: 'ให้ใช้ผ้าสะอาดหนาๆ กดบนแผนแน่นๆ ค้างไว้ แล้วมีเลือดชุ่มขึ้นมาหรือไม่',
		type: questionType.single,
		from: 6,
		choices: [
			{
				type: choiceType.result,
				name: 'ใช่',
				result: result.red5,
			},
			{
				type: choiceType.question,
				name: 'ไม่ใช่',
				to: 7,
			},
		],
	},
	{
		name: 'ผู้ป่วยถูกไหม้/ลวก/กัดกร่อนด้วยสิ่งใด',
		type: questionType.single,
		from: 7,
		choices: [
			{
				type: choiceType.question,
				name: 'ไฟ/ของร้อน',
				to: 8,
			},
			{
				type: choiceType.question,
				name: 'สารเคมี',
				to: 12,
			},
			{
				type: choiceType.result,
				name: 'ไฟฟ้าช๊อต',
				result: result.red9,
			},
			{
				type: choiceType.result,
				name: 'ถูกสารป้องกันตัว เช่น แก็สน้ำตา สเปรย์พริกไทย',
				result: result.green8,
			},
			{
				type: choiceType.result,
				name: 'ถูกไม้ขีดไฟ / บุหรี่จี้',
				result: result.white1,
			},
			{
				type: choiceType.result,
				name: 'ร้อยไหม้จากของเย็นจัด เช่น น้ำแข็งแห้ง',
				result: result.white2,
			},
			{
				type: choiceType.result,
				name: 'แสบร้อนจากถูกแดด',
				result: result.white3,
			},
		],
	},
	{
		name: '่ผู้ป่วยเป็นเด็ก/ผู้ใหญ่',
		type: questionType.single,
		from: 8,
		choices: [
			{
				type: choiceType.question,
				name: 'ทารก (อายุน้อยกว่า 1 ปี)',
				to: 9,
			},
			{
				type: choiceType.question,
				name: 'เด็ก (อายุ 1-15 ปี)',
				to: 10,
			},
			{
				type: choiceType.question,
				name: 'ผู้ใหญ่ (อายุมากกว่า 15 ปี)',
				to: 11,
			},
		],
	},
	{
		name: 'ผู้ป่วยมีรอยไหม้ / ลวก บริเวณใดบ้าง (คิดเป็นกี่ % ของร่างกาย)',
		type: questionType.single,
		from: 9,
		choices: [
			{
				type: choiceType.result,
				name: 'ศรีษะ และ คอ',
				result: result.red8,
			},
			{
				type: choiceType.result,
				name: 'มากกว่า 10%',
				result: result.red8,
			},
			{
				type: choiceType.result,
				name: 'มากกว่าหรือเท่ากับ 5%',
				result: result.yellow6,
			},
			{
				type: choiceType.result,
				name: 'น้อยกว่า 5%',
				result: result.green6,
			},
		],
	},
	{
		name: 'ผู้ป่วยมีรอยไหม้ / ลวก บริเวณใดบ้าง (คิดเป็นกี่ % ของร่างกาย)',
		type: questionType.single,
		from: 10,
		choices: [
			{
				type: choiceType.result,
				name: 'ศรีษะ และ คอ',
				result: result.red8,
			},
			{
				type: choiceType.result,
				name: 'มากกว่า 10%',
				result: result.red8,
			},
			{
				type: choiceType.result,
				name: 'มากกว่าหรือเท่ากับ 5%',
				result: result.yellow6,
			},
			{
				type: choiceType.result,
				name: 'น้อยกว่า 5%',
				result: result.green6,
			},
		],
	},
	{
		name: 'ผู้ป่วยมีรอยไหม้ / ลวก บริเวณใดบ้าง (คิดเป็นกี่ % ของร่างกาย)',
		type: questionType.single,
		from: 11,
		choices: [
			{
				type: choiceType.result,
				name: 'ศรีษะ และ คอ',
				result: result.red8,
			},
			{
				type: choiceType.result,
				name: 'มากกว่า 20%',
				result: result.red8,
			},
			{
				type: choiceType.result,
				name: 'มากกว่าหรือเท่ากับ 10%',
				result: result.yellow6,
			},
			{
				type: choiceType.result,
				name: 'น้อยกว่า 10%',
				result: result.green6,
			},
		],
	},
	{
		name: 'ผู้ป่วยสัมผัสสารเคมีจากภายนอก หรือ การกิน',
		type: questionType.single,
		from: 12,
		choices: [
			{
				type: choiceType.question,
				name: 'สัมผัสภายนอก',
				to: 13,
			},
			{
				type: choiceType.question,
				name: 'กิน / หายใจเข้าไป',
				to: 14,
			},
		],
	},
	{
		name: 'ผู้ป่วยมีรอยไหม้ / ลวก บริเวณใดบ้าง',
		type: questionType.single,
		from: 13,
		choices: [
			{
				type: choiceType.result,
				name: 'ศรีษะ และ คอ',
				result: result.red7,
			},
			{
				type: choiceType.result,
				name: 'อื่นๆ ที่ไม่ใช่ ศรีษะและคอ',
				result: result.green7,
			},
		],
	},
	{
		name: 'ผู้ป่วยกลืน (น้ำลาย น้ำ อาหาร) ลำบากหรือไม่',
		type: questionType.single,
		from: 14,
		choices: [
			{
				type: choiceType.result,
				name: 'กลืนลำบาก',
				result: module14Result.red7,
			},
			{
				type: choiceType.question,
				name: 'กลืนได้ปกติ',
				to: 15,
			},
		],
	},
	{
		name: 'มีอาการผิดปกติอื่นหรือไม่ เช่น เจ็บคอ ปวดท้อง ปวดศรีษะ คัน วิงเวียน',
		type: questionType.single,
		from: 15,
		choices: [
			{
				type: choiceType.result,
				name: 'มี',
				result: module14Result.yellow4,
			},
			{
				type: choiceType.result,
				name: 'ไม่มี',
				result: module14Result.green5,
			},
		],
	},
];

const module22 = {
	name: 'ไฟไหม้',
	module: 22,
	description: 'ลวกเหตุความร้อน, สารเคมี, ไฟฟ้าช๊อต',
	image: 'assets/imgs/house-on-fire.png',
	questions: questions,
};

export default module22;
