import { level } from "../meta";

const result = {
  red2: {
    code: "7 แดง 2",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ",
          description: ["หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท"],
        },
        {
          title: "2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป",
          description: [],
        },
        {
          title: "3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ",
          description: [
            "จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล",
          ],
        },
      ],
      notes: ["1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ"],
    },
  },
};

export { result };
