import { level, choiceType, questionType } from "../meta";

const result = {
  red1: {
    code: "4 แดง 1",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. มีใครที่อยู่บริเวณนั้นรู้เรื่องการกู้ชีพบ้างหรือไม่",
          description: [
            "<b>ถ้ามี </b>ให้ตะโกนขอความช่วยเหลือปั๊มหัวใจผู้ป่วย <br> <b>ถ้าไม่มี</b> ให้ปฏิบัติตามหัวข้อถัดไป"
          ]
        },
        {
          title: "2. นำโทรศัพท์ไปใกล้ๆ ผู้ป่วยพร้อมเปิดลำโพง",
          description: [
            " พร้อมบอกว่าญาติว่า (ตอนนี้กำลังส่งรถพยาบาลที่ใกล้ที่สุดไป แต่ตอนนี้ผู้ป่วยมีภาวะหัวใจหยุดเต้น  ซึ่งหัวใจสามารถขาดเลือดได้ 4 นาทีเท่านั้น ญาติคือบุคคลคนเดียวที่จะสามารถช่วยผู้ป่วยได้ ) ให้ญาติตั้งสติ และใจเย็นๆ ก่อนนะค่ะ กระผม/ดิฉัน จะบอกคุณว่า ต้องทำไรค่ะ"
          ]
        },
        {
          title: "3. สอนวิธีปั๊มหัวใจ",
          description: [
            "ให้นำผู้ป่วยนอนราบบนพื้นแข็ง คุกเข่าข้างๆลำตัวผู้ป่วย",
            "ใช้มือข้างใดข้างหนึ่ง วางบนครึ่งล่างของกระดูกหน้าอก แล้วใช้มืออีกข้างหนึ่งวางทับพร้อมล็อคไว้ให้แน่น เหยียดแขนตรง ทำมุม 90 องศา",
            "ให้ทำการปั๊มหัวใจผู้ป่วย ลึก 2-2.4 นิ้ว(5-6 ซม.) อัตราเร็ว 100-120/นาที โดยไม่ยกมือออกจากหน้าอกผู้ป่วย หรือนับเป็นจังหวะ หนึ่ง และ สอง และ สาม.... ไปเรื่อยๆจนกว่าหน่วยช่วยเหลือจะมาถึง (หากมีผู้ช่วยเหลือหลายคนให้เปลี่ยนคนปั๊มหัวใจทุก 2 นาที หรือหากมีอาการเมื่อยล้า สามารถเปลี่ยนคนได้)"
          ]
        }
      ],
      notes: [
        "1. หากผู้ป่วยเริ่มรู้สึกตัว / หายใจเองได้ หรือ  อาเจียน ให้จัดท่านอนตะแคงซ้าย",
        "2. เฝ้าสังเกตอาการผู้ป่วยและประเมินซ้ำทุก 2 นาที หากผู้ป่วยไม่รู้สึกตัวและไม่หายใจให้ทำการปั๊มหัวใจทันที"
      ]
    }
  },
  red2: {
    code: "4 แดง 2",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ",
          description: [
            "หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท"
          ]
        },
        {
          title: "2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป",
          description: []
        },
        {
          title:
            "3. ให้ญาติผู้พบเห็นเหตุการณ์เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด ",
          description: [
            "จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: ["1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ"]
    }
  },
  red3: {
    code: "4 แดง 3",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ",
          description: ["ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title:
            "2. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          description: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: ["1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ"]
    }
  },
  red4: {
    code: "4 แดง 4",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ",
          description: ["ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title: "2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร",
          description: ["เพราะอาจทำให้ผู้ป่วยสำลักได้"]
        },
        {
          title:
            "3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          description: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: ["1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ"]
    }
  },
  red5: {
    code: "4 แดง 5",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ",
          description: ["ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title: "2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร",
          description: ["เพราะอาจทำให้ผู้ป่วยสำลักได้"]
        },
        {
          title:
            "3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          description: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: ["1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ"]
    }
  },
  red6: {
    code: "4 แดง 6",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ",
          description: ["ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title: "2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร",
          description: ["เพราะอาจทำให้ผู้ป่วยสำลักได้"]
        },
        {
          title:
            "3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          description: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: ["1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ"]
    }
  },
  red7: {
    code: "4 แดง 7",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. จัดท่าผู้ป่วยนอนราบศรีษะต่ำ",
          description: ["ยกขาสูง อยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title: "2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร",
          description: ["ให้งดน้ำงดอาหารทุกชนิด"]
        },
        {
          title:
            "3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          description: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: ["1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ"]
    }
  },
  red9: {
    code: "4 แดง 9",
    level: level.red,
    advise: {
      contents: [
        {
          title: "1. จัดท่านอนในท่าที่ผู้ป่วยสบาย",
          description: ["และอยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title: "2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร",
          description: ["ให้งดน้ำงดอาหารทุกชนิด"]
        },
        {
          title:
            "3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          description: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: ["1. หากไม่รู้สึกตัวและไม่หายใจ แนะนำให้ปั๊มหัวใจ"]
    }
  },
  yellow1: {
    code: "4 เหลือง 1",
    level: level.yellow,
    advise: {
      contents: [
        {
          title:
            "1. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          description: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        },
        {
          title: "2. อย่าให้ผู้ป่วยดื่มหรือกินอะไร",
          description: []
        }
      ],
      notes: []
    }
  },
  yellow2: {
    code: "4 เหลือง 2",
    level: level.yellow,
    advise: {
      contents: [
        {
          title: "1. แนะนำให้ผู้ป่วยนอนราบศีรษะสูง ",
          description: [
            "หรือนั่งเพื่อให้หายใจได้สะดวก อยู่ในสถานที่อากาศถ่ายเท"
          ]
        },
        {
          title: "2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป",
          description: []
        },
        {
          title:
            "3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          description: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: []
    }
  },
  yellow3: {
    code: "4 เหลือง 3",
    level: level.yellow,
    advise: {
      contents: [
        {
          title: "1. จัดท่าผู้ป่วยนอนราบในท่าที่สบาย ",
          description: ["และอยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title: "2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป",
          description: []
        },
        {
          title:
            "3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          description: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: []
    }
  },
  yellow4: {
    code: "4 เหลือง 4",
    level: level.yellow,
    advise: {
      contents: [
        {
          title: "1. จัดท่าผู้ป่วยนอนราบในท่าที่สบาย ",
          description: ["และอยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title: "2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป",
          description: []
        },
        {
          title:
            "3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          description: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: []
    }
  },
  yellow6: {
    code: "4 เหลือง 6",
    level: level.yellow,
    advise: {
      contents: [
        {
          title: "1. ให้ผู้ป่วยนั่งหรือยืน",
          description: [
            "ให้บีบปลายจมูกโดยไม่คลายออก และอยู่ในสถานที่อากาศถ่ายเท"
          ]
        },
        {
          title: "2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป",
          description: []
        },
        {
          title:
            "3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          description: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: []
    }
  },
  yellow8: {
    code: "4 เหลือง 8",
    level: level.yellow,
    advise: {
      contents: [],
      notes: []
    }
  },
  yellow9: {
    code: "4 เหลือง 9",
    level: level.yellow,
    advise: {
      contents: [
        {
          title: "1. จัดท่าผู้ป่วยนอนราบในท่าที่สบาย ",
          description: ["และอยู่ในสถานที่อากาศถ่ายเท"]
        },
        {
          title: "2. ให้ผู้ป่วยควบคุมการหายใจเข้า-ออก ไม่เร็วจนเกินไป",
          description: []
        },
        {
          title:
            "3. ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด",
          description: [
            "ให้ญาติผู้พบเห็นเหตุการณ์ เฝ้าสังเกตอาการผู้ป่วยอย่างใกล้ชิด จนกว่ารถพยาบาลจะมาถึง และรวบรวมยาประจำตัวผู้ป่วยและผู้พบเห็นเหตุการณ์ ขึ้นรถพยาบาลไปพร้อมกับผู้ป่วยด้วย เพื่อให้ประวัติแก่ แพทย์ และเจ้าหน้าที่พยาบาล"
          ]
        }
      ],
      notes: []
    }
  },
  white1: {
    code: "4 ขาว 1",
    level: level.white,
    advise: {
      contents: [
        {
          title: "1. ให้ผู้ป่วยนอนพัก และอยู่ในท่าที่สบาย ",
          description: []
        },
        {
          title: "2. แนะนำให้นำผู้ป่วยไปตรวจในวันและเวลาราชการ ",
          description: ["และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย"]
        },
        {
          title: "3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง",
          description: []
        }
      ],
      notes: []
    }
  },
  white2: {
    code: "4 ขาว 2",
    level: level.white,
    advise: {
      contents: [
        {
          title: "1. ให้ผู้ป่วยนอนพัก และอยู่ในท่าที่สบาย ",
          description: [
            "หากมีเลือดไหลอีก ให้ผู้ป่วยนั่งหรือยืน ให้บีบปลายจมูกโดยไม่คลายออก และอยู่ในสถานที่อากาศถ่ายเท"
          ]
        },
        {
          title: "2. แนะนำให้นำผู้ป่วยไปตรวจในวันและเวลาราชการ ",
          description: ["และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย"]
        },
        {
          title: "3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง",
          description: []
        }
      ],
      notes: []
    }
  },
  white3: {
    code: "4 ขาว 3",
    level: level.white,
    advise: {
      contents: [
        {
          title: "1. ให้ผู้ป่วยนอนพัก และอยู่ในท่าที่สบาย ",
          description: []
        },
        {
          title: "2. แนะนำให้นำผู้ป่วยไปตรวจในวันและเวลาราชการ ",
          description: ["และให้นำยาที่ผู้ป่วยใช้ทั้งไป รพ. พร้อมผู้ป่วยด้วย"]
        },
        {
          title: "3. หากผู้ป่วยมีอาการเปลี่ยนแปลงให้โทรแจ้ง 1669 อีกครั้ง",
          description: []
        }
      ],
      notes: []
    }
  },
  green1: {
    code: "4 เขียว 1",
    level: level.green,
    advise: {
      contents: [],
      notes: []
    }
  },
  green2: {
    code: "4 เขียว 2",
    level: level.green,
    advise: {
      contents: [],
      notes: []
    }
  }
};

const questions = [
  {
    name: "ผู้ป่วยรู้สึกตัวหรือไม่",
    type: questionType.single,
    from: 0,
    choices: [
      {
        type: choiceType.question,

        name: "ไม่รู้สึกตัว",
        to: 1
      },
      {
        type: choiceType.question,
        name: "รู้สึกตัว",
        to: 2
      },
      {
        type: choiceType.result,
        name: "ผู้แจ้งตรวจสอบยืนยันรายละเอียดของผู้ป่วยไม่ได้",
        result: result.yellow9
      }
    ]
  },
  {
    name: "ตบไหล่ และปลุกเรียก ผู้ป่วยรู้สึกตัวขึ้นหรือไม่",
    type: questionType.single,
    from: 1,
    choices: [
      {
        type: choiceType.result,
        name: "ไม่รู้สึกตัวเพิ่มขึ้น",
        result: result.red1
      },
      {
        type: choiceType.question,
        name: "พอรู้สึกตัว",
        to: 2
      }
    ]
  },
  {
    name: "ลักษณะอาการหายใจเป็นอย่างไร",
    type: questionType.single,
    from: 2,
    choices: [
      {
        type: choiceType.result,
        name: "พูดได้แค่ประโยคสั้นๆ/พูดติดขัด",
        result: result.red2
      },
      {
        type: choiceType.result,
        name: "ซี่โครงบาน จมูกบานไหปลาร้ายุบ",
        result: result.red2
      },
      {
        type: choiceType.result,
        name: "หายใจมีเสียงดัง",
        result: result.red2
      },
      {
        type: choiceType.result,
        name: "ผู้ป่วยต้องลุกขึ้นนั่งหรือยืนเพื่อให้หายใจได้ดีขึ้น",
        result: result.red2
      },
      {
        type: choiceType.result,
        name: "ตัวซีดและเหงือท่วมตัว",
        result: result.red2
      },
      {
        type: choiceType.question,
        name: "หายใจเร็ว",
        to: 3
      },

      {
        type: choiceType.result,
        name: "หายใจขัด โดยไม่มีอาการข้างต้นร่วมด้วย",
        result: result.red2
      },
      {
        type: choiceType.question,
        name: "พูดได้ / หายใจปกติ",
        to: 5
      }
    ]
  },
  {
    name: "ผู้ป่วยมีโรคหอบหืดหรือไม่",
    type: questionType.single,
    from: 3,
    choices: [
      {
        type: choiceType.result,
        name: "มี",
        result: result.red2
      },
      {
        type: choiceType.question,
        name: "ไม่มี",
        to: 4
      }
    ]
  },
  {
    name: "ผู้ป่วยอายุเท่าไหร่",
    type: questionType.single,
    from: 4,
    choices: [
      {
        type: choiceType.result,
        name: "มากกว่า 20 ปี",
        result: result.red2
      },
      {
        type: choiceType.result,
        name: "น้อยกว่า 20 ปี",
        result: result.yellow8
      }
    ]
  },
  {
    name: "ผู้ป่วยมีอาการต่อไปนี้บ้างหรือไม่",
    type: questionType.checkbox,
    from: 5,
    to: 6,
    criteria: {
      type: choiceType.result,
      minimum: 1,
      result: result.red3
    },
    choices: [
      {
        name: "เหงื่อท่วมตัว",
        checked: false
      },
      {
        name: "เป็นลมหรือเกือบเป็นลมเมื่อลุกนั่งหรือยืน",
        checked: false
      },
      {
        name: "ซีดและผิวซีดเย็น",
        checked: false
      },
      {
        name: "มีอาการหมดสติชั่ววูบหลายครั้งในวันนั้น",
        checked: false
      }
    ]
  },
  {
    name: "ผู้ป่วยมีเลือดออกที่ใดบ้าง",
    type: questionType.single,
    from: 6,
    choices: [
      {
        type: choiceType.result,
        name: "อาเจียนเป็นเลือด",
        result: result.yellow1
      },
      {
        type: choiceType.result,
        name: "ถ่ายอุจจาระดำ / แดงคล้ำ",
        result: result.yellow1
      },
      {
        type: choiceType.result,
        name: "ไอเป็นเลือด",
        result: result.yellow1
      },

      {
        type: choiceType.question,
        name: "เลือดกำเดา",
        to: 7
      },
      {
        type: choiceType.result,
        name: "กรณีเป็นผู้หญิงมีเลือดออกทางช่องคลอด",
        result: result.yellow1
      },
      {
        type: choiceType.result,
        name: "เลือดในปัสสาวะ",
        result: result.green2
      },
      {
        type: choiceType.result,
        name: "ที่อื่น นอกจากทวารดังกล่าวข้างต้น",
        result: result.yellow1
      }
    ]
  },
  {
    name: "ผู้ป่วยยอมที่จะลองหยุดเลือดด้วยตัวเองหรือไม่",
    type: questionType.single,
    from: 7,
    choices: [
      {
        type: choiceType.result,
        name: "ยินยอม",
        result: result.white2
      },
      {
        type: choiceType.result,
        name: "ไม่ยินยอม",
        result: result.green1
      }
    ]
  }
];

const module4 = {
  module: 4,
  name: "เลือดออก",
  description: "ไม่มีสาเหตุจากการบาดเจ็บ",
  image: "assets/imgs/broken-heart-bleeding.png",
  questions: questions
};

export default module4;
